use std::collections::HashMap;
use serde::Deserialize;

#[derive(Debug, Clone, Eq, PartialEq, Deserialize)]
pub(crate) struct RaidData {
    pub star: u8,
    pub raid_info: RaidInfo
}

#[derive(Debug, Clone, Eq, PartialEq, Deserialize)]
pub (crate) struct RaidInfo {
    pub name: String,
    pub moves: Vec<String>,
    pub abilities: Vec<String>,
    pub actions: Vec<String>,
    pub types: Vec<String>,
    pub hp: u32,
    pub atk: u32,
    pub def: u32,
    pub sp_atk: u32,
    pub sp_def: u32,
    pub speed: u32
}

/// レイドの情報を返す
pub(crate) fn raid() -> HashMap<u8, Vec<RaidInfo>> {
    let json_data = r#"
    {
        "6": [
          {
            "name": "アーマーガア",
            "moves": [
              "アイアンヘッド",
              "ドリルくちばし",
              "ボディプレス",
              "つめとぎ"
            ],
            "abilities": [
              "プレッシャー",
              "きんちょうかん",
              "ミラーアーマー"
            ],
            "actions": [
              "時間90% テラ回収",
              "時間60% 強化解除",
              "体力75% つめとぎ",
              "体力50% 弱体解除",
              "体力30% おいかぜ"
            ],
            "types": [
              "ひこう",
              "はがね"
            ],
            "hp": 6900,
            "atk": 161,
            "def": 222,
            "sp_atk": 100,
            "sp_def": 186,
            "speed": 125
          },
          {
            "name": "イッカネズミ",
            "moves": [
              "じゃれつく",
              "とっしん",
              "けたぐり",
              "あまえる"
            ],
            "abilities": [
              "フレンドガード",
              "ほおぶくろ",
              "テクニシャン"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間75% あまえる",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力30% おかたづけ"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 5825,
            "atk": 140,
            "def": 159,
            "sp_atk": 122,
            "sp_def": 168,
            "speed": 204
          },
          {
            "name": "ウルガモス",
            "moves": [
              "むしのさざめき",
              "かえんほうしゃ",
              "ぼうふう",
              "おいかぜ"
            ],
            "abilities": [
              "ほのおのからだ",
              "むしのしらせ"
            ],
            "actions": [
              "時間60% 強化解除",
              "時間20% ちょうのまい",
              "体力85% ドわすれ",
              "体力75% にほんばれ",
              "体力50% 弱体解除",
              "体力30% ひかりのかべ"
            ],
            "types": [
              "むし",
              "ほのお"
            ],
            "hp": 6325,
            "atk": 113,
            "def": 150,
            "sp_atk": 248,
            "sp_def": 222,
            "speed": 185
          },
          {
            "name": "エルレイド",
            "moves": [
              "サイコカッター",
              "インファイト",
              "おにび",
              "つばめがえし"
            ],
            "abilities": [
              "ふくつのこころ",
              "きれあじ",
              "せいぎのこころ"
            ],
            "actions": [
              "時間85% さいみんじゅつ",
              "体力75% かなしばり",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力25% サイコフィールド"
            ],
            "types": [
              "エスパー",
              "かくとう"
            ],
            "hp": 5550,
            "atk": 230,
            "def": 150,
            "sp_atk": 122,
            "sp_def": 240,
            "speed": 149
          },
          {
            "name": "エーフィ",
            "moves": [
              "テラバースト",
              "サイコキネシス",
              "サイコショック",
              "くすぐる"
            ],
            "abilities": [
              "シンクロ",
              "マジックミラー"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% サイコフィールド",
              "体力50% 弱体解除",
              "体力35% めいそう",
              "体力20% サイコフィールド"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 5425,
            "atk": 122,
            "def": 113,
            "sp_atk": 239,
            "sp_def": 204,
            "speed": 203
          },
          {
            "name": "オトシドリ",
            "moves": [
              "いわなだれ",
              "アクロバット",
              "はたきおとす",
              "フェザーダンス"
            ],
            "abilities": [
              "はとむね",
              "するどいめ",
              "いわはこび"
            ],
            "actions": [
              "時間80% はたきおとす",
              "時間60% 強化解除",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力30% フェザーダンス"
            ],
            "types": [
              "ひこう",
              "あく"
            ],
            "hp": 5650,
            "atk": 190,
            "def": 186,
            "sp_atk": 113,
            "sp_def": 186,
            "speed": 152
          },
          {
            "name": "オノノクス",
            "moves": [
              "げきりん",
              "かみくだく",
              "ギガインパクト",
              "であいがしら"
            ],
            "abilities": [
              "とうそうしん",
              "かたやぶり",
              "きんちょうかん"
            ],
            "actions": [
              "時間90% 弱体解除",
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力30% りゅうのまい"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 5900,
            "atk": 269,
            "def": 195,
            "sp_atk": 113,
            "sp_def": 159,
            "speed": 179
          },
          {
            "name": "カイリュー",
            "moves": [
              "ドラゴンダイブ",
              "しんそく",
              "りゅうのまい",
              "アクアテール"
            ],
            "abilities": [
              "せいしんりょく",
              "マルチスケイル"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間65% ひかりのかべ",
              "時間50% 強化解除",
              "体力95% 弱体解除",
              "体力50% 弱体解除",
              "体力30% りゅうのまい"
            ],
            "types": [
              "ドラゴン",
              "ひこう"
            ],
            "hp": 6575,
            "atk": 246,
            "def": 176,
            "sp_atk": 185,
            "sp_def": 213,
            "speed": 149
          },
          {
            "name": "カバルドン",
            "moves": [
              "じしん",
              "こおりのキバ",
              "あくび",
              "いわなだれ"
            ],
            "abilities": [
              "すなおこし",
              "すなのちから"
            ],
            "actions": [
              "時間90% あくび",
              "時間60% 強化解除",
              "体力60% テラ回収",
              "体力50% 弱体解除",
              "体力20% あくび"
            ],
            "types": [
              "じめん"
            ],
            "hp": 7350,
            "atk": 206,
            "def": 246,
            "sp_atk": 127,
            "sp_def": 163,
            "speed": 89
          },
          {
            "name": "ガケガニ",
            "moves": [
              "ストーンエッジ",
              "いわくだき",
              "シザークロス",
              "すなあらし"
            ],
            "abilities": [
              "いかりのこうら",
              "シェルアーマー",
              "さいせいりょく"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "体力80% はたきおとす",
              "体力49% 弱体解除",
              "体力30% てっぺき"
            ],
            "types": [
              "いわ"
            ],
            "hp": 5650,
            "atk": 185,
            "def": 240,
            "sp_atk": 68,
            "sp_def": 132,
            "speed": 140
          },
          {
            "name": "ガブリアス",
            "moves": [
              "げきりん",
              "じしん",
              "かえんほうしゃ",
              "いわなだれ"
            ],
            "abilities": [
              "すながくれ",
              "さめはだ"
            ],
            "actions": [
              "時間75% テラ回収",
              "時間60% 強化解除",
              "体力90% 弱体解除",
              "体力50% 弱体解除",
              "体力30% 強化解除",
              "体力30% つるぎのまい"
            ],
            "types": [
              "ドラゴン",
              "じめん"
            ],
            "hp": 7350,
            "atk": 239,
            "def": 176,
            "sp_atk": 149,
            "sp_def": 186,
            "speed": 188
          },
          {
            "name": "キノガッサ",
            "moves": [
              "タネマシンガン",
              "ローキック",
              "キノコのほうし",
              "つばめがえし"
            ],
            "abilities": [
              "ほうし",
              "ポイズンヒール",
              "テクニシャン"
            ],
            "actions": [
              "時間80% グラスフィールド",
              "体力75% キノコのほうし",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [
              "くさ",
              "かくとう"
            ],
            "hp": 5200,
            "atk": 239,
            "def": 177,
            "sp_atk": 113,
            "sp_def": 141,
            "speed": 131
          },
          {
            "name": "キョジオーン",
            "moves": [
              "ストーンエッジ",
              "ヘビーボンバー",
              "しおづけ",
              "アームハンマー"
            ],
            "abilities": [
              "きよめのしお",
              "がんじょう",
              "クリアボディ"
            ],
            "actions": [
              "時間60% 強化解除",
              "時間60% テラ回収",
              "体力90% すなあらし",
              "体力50% 弱体解除",
              "体力20% いわなだれ"
            ],
            "types": [
              "いわ"
            ],
            "hp": 7000,
            "atk": 185,
            "def": 267,
            "sp_atk": 86,
            "sp_def": 195,
            "speed": 68
          },
          {
            "name": "キラフロル",
            "moves": [
              "パワージェム",
              "ヘドロウェーブ",
              "はかいこうせん",
              "ロックカット"
            ],
            "abilities": [
              "どくげしょう",
              "ふしょく"
            ],
            "actions": [
              "時間85% テラ回収",
              "時間60% 強化解除",
              "時間50% テラ回収",
              "体力90% すなあらし",
              "体力55% テラ回収",
              "体力50% 弱体解除"
            ],
            "types": [
              "いわ",
              "どく"
            ],
            "hp": 6225,
            "atk": 104,
            "def": 195,
            "sp_atk": 239,
            "sp_def": 179,
            "speed": 159
          },
          {
            "name": "ギャラドス",
            "moves": [
              "アクアテール",
              "かみくだく",
              "ぼうふう",
              "こおりのキバ"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% 弱体解除",
              "体力50% 弱体解除",
              "体力40% ちょうはつ",
              "体力20% りゅうのまい"
            ],
            "types": [
              "みず",
              "ひこう"
            ],
            "hp": 6775,
            "atk": 230,
            "def": 147,
            "sp_atk": 113,
            "sp_def": 213,
            "speed": 150
          },
          {
            "name": "クレベース",
            "moves": [
              "つららおとし",
              "ヘビーボンバー",
              "ゆきげしき",
              "アイススピナー"
            ],
            "abilities": [
              "マイペース",
              "アイスボディ",
              "がんじょう"
            ],
            "actions": [
              "時間90% ゆきげしき",
              "時間75% てっぺき",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力30% 強化解除"
            ],
            "types": [
              "こおり"
            ],
            "hp": 6775,
            "atk": 215,
            "def": 365,
            "sp_atk": 84,
            "sp_def": 116,
            "speed": 55
          },
          {
            "name": "グレイシア",
            "moves": [
              "テラバースト",
              "れいとうビーム",
              "ふぶき",
              "あまえる"
            ],
            "abilities": [
              "ゆきがくれ",
              "アイスボディ"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% ゆきげしき",
              "体力50% 弱体解除",
              "体力35% めいそう",
              "体力20% ゆきげしき"
            ],
            "types": [
              "こおり"
            ],
            "hp": 5425,
            "atk": 113,
            "def": 203,
            "sp_atk": 239,
            "sp_def": 204,
            "speed": 122
          },
          {
            "name": "グレンアルマ",
            "moves": [
              "アーマーキャノン",
              "サイコキネシス",
              "ナイトヘッド",
              "おにび"
            ],
            "abilities": [
              "もらいび",
              "くだけるよろい"
            ],
            "actions": [
              "時間90% めいそう",
              "時間65% テラ回収",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% にほんばれ"
            ],
            "types": [
              "ほのお",
              "エスパー"
            ],
            "hp": 6325,
            "atk": 113,
            "def": 213,
            "sp_atk": 230,
            "sp_def": 177,
            "speed": 140
          },
          {
            "name": "ケンタロス",
            "moves": [
              "フレアドライブ",
              "インファイト",
              "かえんほうしゃ",
              "ずつき"
            ],
            "abilities": [
              "いかく",
              "いかりのつぼ",
              "はんすう"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% にほんばれ",
              "体力50% 弱体解除",
              "体力35% ビルドアップ",
              "体力20% にほんばれ"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 5875,
            "atk": 185,
            "def": 204,
            "sp_atk": 77,
            "sp_def": 159,
            "speed": 203
          },
          {
            "name": "ケンタロス",
            "moves": [
              "ウェーブタックル",
              "インファイト",
              "なみのり",
              "ずつき"
            ],
            "abilities": [
              "いかく",
              "いかりのつぼ",
              "はんすう"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% あまごい",
              "体力50% 弱体解除",
              "体力35% ビルドアップ",
              "体力20% あまごい"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "ケンタロス",
            "moves": [
              "インファイト",
              "あばれる",
              "しねんのずつき",
              "レイジングブル"
            ],
            "abilities": [
              "いかく",
              "いかりのつぼ",
              "はんすう"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "体力90% ビルドアップ",
              "体力50% 弱体解除",
              "体力25% いやなおと"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "ゲンガー",
            "moves": [
              "シャドーボール",
              "ヘドロばくだん",
              "マジカルシャイン",
              "おにび"
            ],
            "abilities": [
              "のろわれボディ"
            ],
            "actions": [
              "時間85% さいみんじゅつ",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力25% さいみんじゅつ"
            ],
            "types": [
              "ゴースト",
              "どく"
            ],
            "hp": 5200,
            "atk": 122,
            "def": 141,
            "sp_atk": 239,
            "sp_def": 168,
            "speed": 203
          },
          {
            "name": "コノヨザル",
            "moves": [
              "インファイト",
              "シャドークロー",
              "ダメおし",
              "きあいだめ"
            ],
            "abilities": [
              "やるき",
              "せいしんりょく",
              "まけんき"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "時間5% ふんどのこぶし",
              "体力90% ビルドアップ",
              "体力50% 弱体解除",
              "体力25% ビルドアップ"
            ],
            "types": [
              "かくとう",
              "ゴースト"
            ],
            "hp": 7450,
            "atk": 212,
            "def": 177,
            "sp_atk": 95,
            "sp_def": 195,
            "speed": 167
          },
          {
            "name": "コータス",
            "moves": [
              "ふんえん",
              "あくび",
              "クリアスモッグ",
              "のしかかり"
            ],
            "abilities": [
              "しろいけむり",
              "ひでり",
              "シェルアーマー"
            ],
            "actions": [
              "時間75% テラ回収",
              "時間60% 強化解除",
              "体力90% にほんばれ",
              "体力50% 弱体解除",
              "体力30% あくび",
              "体力20% てっぺき"
            ],
            "types": [
              "ほのお"
            ],
            "hp": 5650,
            "atk": 158,
            "def": 257,
            "sp_atk": 158,
            "sp_def": 159,
            "speed": 41
          },
          {
            "name": "サザンドラ",
            "moves": [
              "あくのはどう",
              "りゅうのはどう",
              "かみくだく",
              "ちょうはつ"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間75% ふるいたてる",
              "時間60% 強化解除",
              "時間20% わるだくみ",
              "体力85% ちょうはつ",
              "体力50% 弱体解除",
              "体力25% 弱体解除"
            ],
            "types": [
              "あく",
              "ドラゴン"
            ],
            "hp": 6625,
            "atk": 194,
            "def": 195,
            "sp_atk": 230,
            "sp_def": 195,
            "speed": 181
          },
          {
            "name": "サンダース",
            "moves": [
              "テラバースト",
              "１０まんボルト",
              "シャドーボール",
              "でんじは"
            ],
            "abilities": [
              "ちくでん",
              "はやあし"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% エレキフィールド",
              "体力50% 弱体解除",
              "体力35% めいそう",
              "体力20% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 5425,
            "atk": 122,
            "def": 113,
            "sp_atk": 203,
            "sp_def": 204,
            "speed": 239
          },
          {
            "name": "サーナイト",
            "moves": [
              "ムーンフォース",
              "サイコキネシス",
              "めいそう",
              "でんじは"
            ],
            "abilities": [
              "シンクロ",
              "トレース",
              "テレパシー"
            ],
            "actions": [
              "時間85% ミストフィールド",
              "体力75% めいそう",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力35% サイコフィールド"
            ],
            "types": [
              "エスパー",
              "フェアリー"
            ],
            "hp": 5550,
            "atk": 122,
            "def": 150,
            "sp_atk": 230,
            "sp_def": 240,
            "speed": 149
          },
          {
            "name": "シャワーズ",
            "moves": [
              "テラバースト",
              "なみのり",
              "ハイパーボイス",
              "あくび"
            ],
            "abilities": [
              "ちょすい",
              "うるおいボディ"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% あまごい",
              "体力50% 弱体解除",
              "体力35% めいそう",
              "体力20% あまごい"
            ],
            "types": [
              "みず"
            ],
            "hp": 8350,
            "atk": 122,
            "def": 113,
            "sp_atk": 203,
            "sp_def": 204,
            "speed": 122
          },
          {
            "name": "ジバコイル",
            "moves": [
              "かみなり",
              "ラスターカノン",
              "トライアタック",
              "でんじは"
            ],
            "abilities": [
              "じりょく",
              "がんじょう",
              "アナライズ"
            ],
            "actions": [
              "時間75% てっぺき",
              "時間60% 強化解除",
              "時間20% エレキフィールド",
              "体力80% あまごい",
              "体力50% 弱体解除",
              "体力30% でんじは"
            ],
            "types": [
              "でんき",
              "はがね"
            ],
            "hp": 5650,
            "atk": 131,
            "def": 212,
            "sp_atk": 239,
            "sp_def": 195,
            "speed": 113
          },
          {
            "name": "セグレイブ",
            "moves": [
              "つららばり",
              "ドラゴンダイブ",
              "ゆきげしき",
              "ボディプレス"
            ],
            "abilities": [
              "ねつこうかん",
              "アイスボディ"
            ],
            "actions": [
              "時間80% ゆきげしき",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% ゆきげしき",
              "体力20% 強化解除"
            ],
            "types": [
              "ドラゴン",
              "こおり"
            ],
            "hp": 7675,
            "atk": 266,
            "def": 199,
            "sp_atk": 140,
            "sp_def": 188,
            "speed": 161
          },
          {
            "name": "ソウブレイズ",
            "moves": [
              "むねんのつるぎ",
              "シャドークロー",
              "サイコカッター",
              "おにび"
            ],
            "abilities": [
              "もらいび",
              "くだけるよろい"
            ],
            "actions": [
              "時間85% 弱体解除",
              "時間65% おにび",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% にほんばれ"
            ],
            "types": [
              "ほのお",
              "ゴースト"
            ],
            "hp": 5875,
            "atk": 230,
            "def": 177,
            "sp_atk": 113,
            "sp_def": 213,
            "speed": 158
          },
          {
            "name": "タイカイデン",
            "moves": [
              "ぼうふう",
              "かみなり",
              "さわぐ",
              "こわいかお"
            ],
            "abilities": [
              "ふうりょくでんき",
              "ちくでん",
              "かちき"
            ],
            "actions": [
              "時間85% テラ回収",
              "時間60% 強化解除",
              "体力90% じゅうでん",
              "体力50% 弱体解除",
              "体力20% あまごい"
            ],
            "types": [
              "でんき",
              "ひこう"
            ],
            "hp": 5650,
            "atk": 131,
            "def": 141,
            "sp_atk": 194,
            "sp_def": 141,
            "speed": 230
          },
          {
            "name": "タギングル",
            "moves": [
              "はたきおとす",
              "ダストシュート",
              "とっしん",
              "おだてる"
            ],
            "abilities": [
              "かるわざ",
              "どくしゅ",
              "いたずらごころ"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "体力75% どくどく",
              "体力50% 弱体解除",
              "体力20% ダストシュート"
            ],
            "types": [
              "どく",
              "ノーマル"
            ],
            "hp": 5325,
            "atk": 176,
            "def": 150,
            "sp_atk": 149,
            "sp_def": 163,
            "speed": 203
          },
          {
            "name": "デカヌチャン",
            "moves": [
              "デカハンマー",
              "じゃれつく",
              "はたきおとす",
              "でんじは"
            ],
            "abilities": [
              "かたやぶり",
              "マイペース",
              "わるいてぐせ"
            ],
            "actions": [
              "時間90% ミストフィールド",
              "時間60% 強化解除",
              "体力75% 弱体解除",
              "体力50% 弱体解除",
              "体力30% てんしのキッス",
              "体力15% てんしのキッス"
            ],
            "types": [
              "フェアリー",
              "はがね"
            ],
            "hp": 6325,
            "atk": 140,
            "def": 172,
            "sp_atk": 131,
            "sp_def": 222,
            "speed": 174
          },
          {
            "name": "ドオー",
            "moves": [
              "じしん",
              "どくづき",
              "メガホーン",
              "あくび"
            ],
            "abilities": [
              "どくのトゲ",
              "ちょすい",
              "てんねん"
            ],
            "actions": [
              "時間95% 強化解除",
              "時間60% 強化解除",
              "体力75% あくび",
              "体力50% 弱体解除",
              "体力20% じしん"
            ],
            "types": [
              "どく",
              "じめん"
            ],
            "hp": 8350,
            "atk": 140,
            "def": 141,
            "sp_atk": 86,
            "sp_def": 213,
            "speed": 41
          },
          {
            "name": "ドドゲザン",
            "moves": [
              "アイアンヘッド",
              "つじぎり",
              "ドゲザン",
              "でんじは"
            ],
            "abilities": [
              "まけんき",
              "そうだいしょう",
              "プレッシャー"
            ],
            "actions": [
              "時間85% 弱体解除",
              "時間65% テラ回収",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% つるぎのまい"
            ],
            "types": [
              "あく",
              "はがね"
            ],
            "hp": 7000,
            "atk": 248,
            "def": 249,
            "sp_atk": 113,
            "sp_def": 186,
            "speed": 95
          },
          {
            "name": "ドヒドイデ",
            "moves": [
              "みずのはどう",
              "アクアブレイク",
              "どくづき",
              "ミサイルばり"
            ],
            "abilities": [
              "ひとでなし",
              "じゅうなん",
              "さいせいりょく"
            ],
            "actions": [
              "時間75% どくどく",
              "時間60% 強化解除",
              "体力95% ひやみず",
              "体力50% 弱体解除",
              "体力20% ひやみず"
            ],
            "types": [
              "どく",
              "みず"
            ],
            "hp": 4750,
            "atk": 118,
            "def": 307,
            "sp_atk": 100,
            "sp_def": 289,
            "speed": 68
          },
          {
            "name": "ドラパルト",
            "moves": [
              "シャドーボール",
              "りゅうのはどう",
              "１０まんボルト",
              "かえんほうしゃ"
            ],
            "abilities": [
              "クリアボディ",
              "すりぬけ",
              "のろわれボディ"
            ],
            "actions": [
              "時間85% リフレクター",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力20% ひかりのかべ"
            ],
            "types": [
              "ドラゴン",
              "ゴースト"
            ],
            "hp": 6450,
            "atk": 221,
            "def": 168,
            "sp_atk": 185,
            "sp_def": 168,
            "speed": 260
          },
          {
            "name": "ドラミドロ",
            "moves": [
              "りゅうのはどう",
              "ヘドロばくだん",
              "みずのはどう",
              "どくどく"
            ],
            "abilities": [
              "どくのトゲ",
              "どくしゅ",
              "てきおうりょく"
            ],
            "actions": [
              "時間85% アシッドボム",
              "体力75% りゅうせいぐん",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力30% りゅうせいぐん"
            ],
            "types": [
              "どく",
              "ドラゴン"
            ],
            "hp": 5425,
            "atk": 140,
            "def": 195,
            "sp_atk": 179,
            "sp_def": 255,
            "speed": 84
          },
          {
            "name": "ニンフィア",
            "moves": [
              "テラバースト",
              "ハイパーボイス",
              "ムーンフォース",
              "あくび"
            ],
            "abilities": [
              "メロメロボディ",
              "フェアリースキン"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% ミストフィールド",
              "体力50% 弱体解除",
              "体力35% めいそう",
              "体力20% ミストフィールド"
            ],
            "types": [
              "フェアリー"
            ],
            "hp": 6775,
            "atk": 122,
            "def": 122,
            "sp_atk": 203,
            "sp_def": 267,
            "speed": 113
          },
          {
            "name": "ヌメルゴン",
            "moves": [
              "りゅうのはどう",
              "なみのり",
              "ヘドロばくだん",
              "パワーウィップ"
            ],
            "abilities": [
              "そうしょく",
              "うるおいボディ",
              "ぬめぬめ"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% あまごい",
              "体力50% 弱体解除",
              "体力30% あまごい"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 6550,
            "atk": 185,
            "def": 159,
            "sp_atk": 203,
            "sp_def": 303,
            "speed": 149
          },
          {
            "name": "ハッサム",
            "moves": [
              "シザークロス",
              "バレットパンチ",
              "インファイト",
              "アイアンヘッド"
            ],
            "abilities": [
              "むしのしらせ",
              "テクニシャン",
              "ライトメタル"
            ],
            "actions": [
              "時間85% てっぺき",
              "時間60% 強化解除",
              "体力75% きあいだめ",
              "体力50% 弱体解除"
            ],
            "types": [
              "むし",
              "はがね"
            ],
            "hp": 5650,
            "atk": 239,
            "def": 213,
            "sp_atk": 104,
            "sp_def": 177,
            "speed": 122
          },
          {
            "name": "ハピナス",
            "moves": [
              "マジカルシャイン",
              "ハイパーボイス",
              "うたう",
              "ひかりのかべ"
            ],
            "abilities": [
              "しぜんかいふく",
              "てんのめぐみ",
              "いやしのこころ"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力95% まるくなる",
              "体力75% まるくなる",
              "体力50% 弱体解除",
              "体力30% 弱体解除",
              "体力30% うたう"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 13975,
            "atk": 23,
            "def": 23,
            "sp_atk": 140,
            "sp_def": 276,
            "speed": 104
          },
          {
            "name": "ハルクジラ",
            "moves": [
              "アイススピナー",
              "のしかかり",
              "ゆきげしき",
              "じだんだ"
            ],
            "abilities": [
              "あついしぼう",
              "ゆきかき",
              "ちからずく"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間75% ゆきげしき",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力30% あくび"
            ],
            "types": [
              "こおり"
            ],
            "hp": 10150,
            "atk": 208,
            "def": 150,
            "sp_atk": 86,
            "sp_def": 132,
            "speed": 136
          },
          {
            "name": "バウッツェル",
            "moves": [
              "じゃれつく",
              "すてみタックル",
              "かみつく",
              "つぶらなひとみ"
            ],
            "abilities": [
              "こんがりボディ",
              "アロマベール"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "時間60% テラ回収",
              "体力50% 弱体解除",
              "体力20% じゃれつく"
            ],
            "types": [
              "フェアリー"
            ],
            "hp": 5050,
            "atk": 149,
            "def": 240,
            "sp_atk": 95,
            "sp_def": 177,
            "speed": 176
          },
          {
            "name": "バチンウニ",
            "moves": [
              "びりびりちくちく",
              "かみなり",
              "なみのり",
              "どくづき"
            ],
            "abilities": [
              "ひらいしん",
              "エレキメイカー"
            ],
            "actions": [
              "時間90% でんじは",
              "時間65% エレキフィールド",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 4650,
            "atk": 186,
            "def": 204,
            "sp_atk": 168,
            "sp_def": 186,
            "speed": 32
          },
          {
            "name": "バンギラス",
            "moves": [
              "ストーンエッジ",
              "かみくだく",
              "いやなおと",
              "ロックブラスト"
            ],
            "abilities": [
              "すなおこし",
              "きんちょうかん"
            ],
            "actions": [
              "時間75% テラ回収",
              "時間60% 強化解除",
              "体力90% 弱体解除",
              "体力50% 弱体解除",
              "体力30% かみくだく",
              "体力20% てっぺき"
            ],
            "types": [
              "いわ",
              "あく"
            ],
            "hp": 7000,
            "atk": 246,
            "def": 203,
            "sp_atk": 176,
            "sp_def": 213,
            "speed": 114
          },
          {
            "name": "パーモット",
            "moves": [
              "ワイルドボルト",
              "インファイト",
              "でんこうそうげき",
              "ほっぺすりすり"
            ],
            "abilities": [
              "ちくでん",
              "しぜんかいふく",
              "てつのこぶし"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "体力80% テラ回収",
              "体力50% 弱体解除",
              "体力30% エレキフィールド"
            ],
            "types": [
              "でんき",
              "かくとう"
            ],
            "hp": 5650,
            "atk": 212,
            "def": 159,
            "sp_atk": 131,
            "sp_def": 141,
            "speed": 194
          },
          {
            "name": "ファイアロー",
            "moves": [
              "ブレイブバード",
              "フレアドライブ",
              "かえんほうしゃ",
              "テラバースト"
            ],
            "abilities": [
              "ほのおのからだ",
              "はやてのつばさ"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% にほんばれ",
              "体力50% 弱体解除",
              "体力20% つるぎのまい"
            ],
            "types": [
              "ほのお",
              "ひこう"
            ],
            "hp": 6000,
            "atk": 150,
            "def": 161,
            "sp_atk": 138,
            "sp_def": 158,
            "speed": 231
          },
          {
            "name": "ブラッキー",
            "moves": [
              "テラバースト",
              "あくのはどう",
              "イカサマ",
              "くすぐる"
            ],
            "abilities": [
              "シンクロ",
              "せいしんりょく"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% めいそう",
              "体力50% 弱体解除",
              "体力35% のろい",
              "体力20% めいそう"
            ],
            "types": [
              "あく"
            ],
            "hp": 6775,
            "atk": 122,
            "def": 203,
            "sp_atk": 113,
            "sp_def": 267,
            "speed": 122
          },
          {
            "name": "ブロスター",
            "moves": [
              "みずのはどう",
              "りゅうのはどう",
              "はどうだん",
              "クラブハンマー"
            ],
            "abilities": [
              "メガランチャー"
            ],
            "actions": [
              "時間85% あまごい",
              "時間75% テラ回収",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力30% みずのはどう"
            ],
            "types": [
              "みず"
            ],
            "hp": 5675,
            "atk": 136,
            "def": 192,
            "sp_atk": 221,
            "sp_def": 194,
            "speed": 111
          },
          {
            "name": "ブロロローム",
            "moves": [
              "ダストシュート",
              "オーバーヒート",
              "アイアンヘッド",
              "ちょうはつ"
            ],
            "abilities": [
              "ぼうじん",
              "フィルター"
            ],
            "actions": [
              "時間85% こわいかお",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% ギアチェンジ",
              "体力20% ギアチェンジ"
            ],
            "types": [
              "はがね",
              "どく"
            ],
            "hp": 6100,
            "atk": 219,
            "def": 195,
            "sp_atk": 102,
            "sp_def": 154,
            "speed": 167
          },
          {
            "name": "ブースター",
            "moves": [
              "テラバースト",
              "フレアドライブ",
              "ふんえん",
              "おにび"
            ],
            "abilities": [
              "もらいび",
              "こんじょう"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% にほんばれ",
              "体力50% 弱体解除",
              "体力35% のろい",
              "体力20% にほんばれ"
            ],
            "types": [
              "ほのお"
            ],
            "hp": 5425,
            "atk": 239,
            "def": 113,
            "sp_atk": 176,
            "sp_def": 231,
            "speed": 122
          },
          {
            "name": "ヘイラッシャ",
            "moves": [
              "ウェーブタックル",
              "いっちょうあがり",
              "ヘビーボンバー",
              "あくび"
            ],
            "abilities": [
              "てんねん",
              "どんかん",
              "みずのベール"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間60% 強化解除",
              "体力75% あまごい",
              "体力50% 弱体解除",
              "体力20% のろい"
            ],
            "types": [
              "みず"
            ],
            "hp": 9250,
            "atk": 185,
            "def": 240,
            "sp_atk": 122,
            "sp_def": 150,
            "speed": 68
          },
          {
            "name": "ヘラクロス",
            "moves": [
              "メガホーン",
              "インファイト",
              "あばれる",
              "にらみつける"
            ],
            "abilities": [
              "むしのしらせ",
              "こんじょう",
              "じしんかじょう"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力75% ビルドアップ",
              "体力50% 弱体解除",
              "体力20% きあいだめ"
            ],
            "types": [
              "むし",
              "かくとう"
            ],
            "hp": 6100,
            "atk": 230,
            "def": 168,
            "sp_atk": 77,
            "sp_def": 204,
            "speed": 158
          },
          {
            "name": "ペリッパー",
            "moves": [
              "ぼうふう",
              "ハイドロポンプ",
              "しろいきり",
              "ちょうおんぱ"
            ],
            "abilities": [
              "するどいめ",
              "あめふらし",
              "あめうけざら"
            ],
            "actions": [
              "時間75% テラ回収",
              "時間60% 強化解除",
              "体力90% あまごい",
              "体力50% 弱体解除",
              "体力30% こうそくいどう",
              "体力20% あまごい"
            ],
            "types": [
              "みず",
              "ひこう"
            ],
            "hp": 5200,
            "atk": 95,
            "def": 185,
            "sp_atk": 176,
            "sp_def": 159,
            "speed": 122
          },
          {
            "name": "ボーマンダ",
            "moves": [
              "げきりん",
              "ダブルウイング",
              "かえんほうしゃ",
              "テラバースト"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう"
            ],
            "actions": [
              "時間75% テラ回収",
              "時間60% 強化解除",
              "体力90% 弱体解除",
              "体力50% 弱体解除",
              "体力30% 弱体解除",
              "体力30% りゅうのまい"
            ],
            "types": [
              "ドラゴン",
              "ひこう"
            ],
            "hp": 6775,
            "atk": 248,
            "def": 149,
            "sp_atk": 203,
            "sp_def": 177,
            "speed": 185
          },
          {
            "name": "マフィティフ",
            "moves": [
              "かみくだく",
              "きしかいせい",
              "げきりん",
              "とっしん"
            ],
            "abilities": [
              "いかく",
              "ばんけん",
              "はりこみ"
            ],
            "actions": [
              "時間80% ちょうはつ",
              "時間60% 強化解除",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力20% 強化解除"
            ],
            "types": [
              "あく"
            ],
            "hp": 6100,
            "atk": 221,
            "def": 195,
            "sp_atk": 113,
            "sp_def": 159,
            "speed": 158
          },
          {
            "name": "ミミズズ",
            "moves": [
              "アイアンヘッド",
              "じしん",
              "うちおとす",
              "すなあらし"
            ],
            "abilities": [
              "どしょく",
              "すながくれ"
            ],
            "actions": [
              "時間95% とぐろをまく",
              "時間60% 強化解除",
              "体力80% すなあらし",
              "体力50% 弱体解除",
              "体力20% すなあらし"
            ],
            "types": [
              "はがね"
            ],
            "hp": 5650,
            "atk": 158,
            "def": 294,
            "sp_atk": 113,
            "sp_def": 132,
            "speed": 122
          },
          {
            "name": "ミミッキュ",
            "moves": [
              "じゃれつく",
              "シャドークロー",
              "かげうち",
              "ウッドハンマー"
            ],
            "abilities": [
              "ばけのかわ"
            ],
            "actions": [
              "時間90% ミストフィールド",
              "時間75% 弱体解除",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力30% つるぎのまい"
            ],
            "types": [
              "ゴースト",
              "フェアリー"
            ],
            "hp": 4975,
            "atk": 167,
            "def": 177,
            "sp_atk": 95,
            "sp_def": 222,
            "speed": 177
          },
          {
            "name": "ムクホーク",
            "moves": [
              "インファイト",
              "ブレイブバード",
              "すてみタックル",
              "フェザーダンス"
            ],
            "abilities": [
              "いかく",
              "すてみ"
            ],
            "actions": [
              "時間85% 弱体解除",
              "体力75% 強化解除",
              "体力50% 強化解除",
              "体力50% 弱体解除",
              "体力25% ブレイブバード"
            ],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 6325,
            "atk": 221,
            "def": 159,
            "sp_atk": 95,
            "sp_def": 141,
            "speed": 185
          },
          {
            "name": "メタモン",
            "moves": [
              "へんしん"
            ],
            "abilities": [
              "じゅうなん",
              "かわりもの"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力50% 弱体解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 4650,
            "atk": 91,
            "def": 120,
            "sp_atk": 91,
            "sp_def": 120,
            "speed": 91
          },
          {
            "name": "モスノウ",
            "moves": [
              "ふぶき",
              "むしのさざめき",
              "ぼうふう",
              "ゆきげしき"
            ],
            "abilities": [
              "りんぷん",
              "こおりのりんぷん"
            ],
            "actions": [
              "時間80% ゆきげしき",
              "時間60% 強化解除",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力20% ちょうのまい"
            ],
            "types": [
              "こおり",
              "むし"
            ],
            "hp": 5650,
            "atk": 122,
            "def": 141,
            "sp_atk": 230,
            "sp_def": 195,
            "speed": 122
          },
          {
            "name": "モトトカゲ",
            "moves": [
              "すてみタックル",
              "ドラゴンクロー",
              "りゅうのはどう",
              "はたきおとす"
            ],
            "abilities": [
              "だっぴ",
              "さいせいりょく"
            ],
            "actions": [
              "時間95% 弱体解除",
              "時間80% はたきおとす",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% ギアチェンジ"
            ],
            "types": [
              "ドラゴン",
              "ノーマル"
            ],
            "hp": 5650,
            "atk": 176,
            "def": 150,
            "sp_atk": 158,
            "sp_def": 150,
            "speed": 222
          },
          {
            "name": "モロバレル",
            "moves": [
              "エナジーボール",
              "イカサマ",
              "キノコのほうし",
              "ヘドロばくだん"
            ],
            "abilities": [
              "ほうし",
              "さいせいりょく"
            ],
            "actions": [
              "時間90% グラスフィールド",
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% グラスフィールド"
            ],
            "types": [
              "くさ",
              "どく"
            ],
            "hp": 7625,
            "atk": 158,
            "def": 159,
            "sp_atk": 158,
            "sp_def": 177,
            "speed": 59
          },
          {
            "name": "ヤドキング",
            "moves": [
              "なみのり",
              "サイコショック",
              "トリックルーム",
              "かえんほうしゃ"
            ],
            "abilities": [
              "どんかん",
              "マイペース",
              "さいせいりょく"
            ],
            "actions": [
              "時間70% ひかりのかべ",
              "時間60% 強化解除",
              "体力90% あまごい",
              "体力50% 弱体解除",
              "体力35% めいそう",
              "体力20% トリックルーム"
            ],
            "types": [
              "みず",
              "エスパー"
            ],
            "hp": 6775,
            "atk": 140,
            "def": 149,
            "sp_atk": 185,
            "sp_def": 231,
            "speed": 59
          },
          {
            "name": "リキキリン",
            "moves": [
              "ツインビーム",
              "ハイパーボイス",
              "けたぐり",
              "さわぐ"
            ],
            "abilities": [
              "はんすう",
              "テイルアーマー",
              "そうしょく"
            ],
            "actions": [
              "時間90% こうそくいどう",
              "時間75% サイコフィールド",
              "時間60% 強化解除",
              "体力50% 弱体解除",
              "体力20% さわぐ"
            ],
            "types": [
              "ノーマル",
              "エスパー"
            ],
            "hp": 7900,
            "atk": 167,
            "def": 159,
            "sp_atk": 203,
            "sp_def": 159,
            "speed": 113
          },
          {
            "name": "リククラゲ",
            "moves": [
              "エナジーボール",
              "だいちのちから",
              "キノコのほうし",
              "たたりめ"
            ],
            "abilities": [
              "きんしのちから"
            ],
            "actions": [
              "時間75% キノコのほうし",
              "時間60% 強化解除",
              "体力90% グラスフィールド",
              "体力50% 弱体解除",
              "体力25% キノコのほうし"
            ],
            "types": [
              "じめん",
              "くさ"
            ],
            "hp": 6100,
            "atk": 131,
            "def": 150,
            "sp_atk": 149,
            "sp_def": 249,
            "speed": 185
          },
          {
            "name": "リーフィア",
            "moves": [
              "テラバースト",
              "リーフブレード",
              "にどげり",
              "あまえる"
            ],
            "abilities": [
              "リーフガード",
              "ようりょくそ"
            ],
            "actions": [
              "時間70% テラ回収",
              "時間60% 強化解除",
              "体力90% にほんばれ",
              "体力50% 弱体解除",
              "体力35% つるぎのまい",
              "体力20% つるぎのまい"
            ],
            "types": [
              "くさ"
            ],
            "hp": 5425,
            "atk": 203,
            "def": 239,
            "sp_atk": 113,
            "sp_def": 150,
            "speed": 176
          },
          {
            "name": "ルガルガン",
            "moves": [
              "アクセルロック",
              "いわなだれ",
              "かみくだく",
              "ちょうはつ"
            ],
            "abilities": [
              "するどいめ",
              "すなかき",
              "ふくつのこころ"
            ],
            "actions": [
              "時間80% すなあらし",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力20% いわなだれ"
            ],
            "types": [
              "いわ"
            ],
            "hp": 5875,
            "atk": 212,
            "def": 150,
            "sp_atk": 104,
            "sp_def": 150,
            "speed": 206
          }
        ],
        "1": [
          {
            "name": "アマカジ",
            "moves": [
              "こうそくスピン",
              "はっぱカッター",
              "じたばた",
              "なかよくする"
            ],
            "abilities": [
              "リーフガード",
              "どんかん",
              "スイートベール"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 160,
            "atk": 12,
            "def": 14,
            "sp_atk": 12,
            "sp_def": 14,
            "speed": 12
          },
          {
            "name": "アメタマ",
            "moves": [
              "バブルこうせん",
              "むしのていこう",
              "でんこうせっか",
              "サイケこうせん"
            ],
            "abilities": [
              "すいすい",
              "あめうけざら"
            ],
            "actions": [],
            "types": [
              "むし",
              "みず"
            ],
            "hp": 155,
            "atk": 12,
            "def": 12,
            "sp_atk": 17,
            "sp_def": 17,
            "speed": 20
          },
          {
            "name": "イワンコ",
            "moves": [
              "いわおとし",
              "すなかけ",
              "かみつく",
              "たいあたり"
            ],
            "abilities": [
              "するどいめ",
              "やるき",
              "ふくつのこころ"
            ],
            "actions": [],
            "types": [
              "いわ"
            ],
            "hp": 160,
            "atk": 20,
            "def": 14,
            "sp_atk": 12,
            "sp_def": 14,
            "speed": 19
          },
          {
            "name": "ウソハチ",
            "moves": [
              "いわおとし",
              "じたばた",
              "まねっこ",
              "けたぐり"
            ],
            "abilities": [
              "がんじょう",
              "いしあたま",
              "びびり"
            ],
            "actions": [],
            "types": [
              "いわ"
            ],
            "hp": 170,
            "atk": 24,
            "def": 27,
            "sp_atk": 7,
            "sp_def": 15,
            "speed": 7
          },
          {
            "name": "ウパー",
            "moves": [
              "たいあたり",
              "マッドショット",
              "たたきつける",
              "ポイズンテール"
            ],
            "abilities": [
              "どくのトゲ",
              "ちょすい",
              "てんねん"
            ],
            "actions": [],
            "types": [
              "みず",
              "じめん"
            ],
            "hp": 175,
            "atk": 15,
            "def": 15,
            "sp_atk": 11,
            "sp_def": 11,
            "speed": 8
          },
          {
            "name": "ウミディグダ",
            "moves": [
              "まきつく",
              "アクアジェット",
              "すなかけ",
              "みずでっぽう"
            ],
            "abilities": [
              "ぬめぬめ",
              "びびり",
              "すながくれ"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 120,
            "atk": 18,
            "def": 11,
            "sp_atk": 13,
            "sp_def": 11,
            "speed": 27
          },
          {
            "name": "エレズン",
            "moves": [
              "ほっぺすりすり",
              "なみだめ",
              "ようかいえき",
              "じたばた"
            ],
            "abilities": [
              "びびり",
              "せいでんき",
              "ぶきよう"
            ],
            "actions": [],
            "types": [
              "でんき",
              "どく"
            ],
            "hp": 155,
            "atk": 14,
            "def": 13,
            "sp_atk": 17,
            "sp_def": 13,
            "speed": 14
          },
          {
            "name": "オラチフ",
            "moves": [
              "バークアウト",
              "つめとぎ",
              "かみつく",
              "したでなめる"
            ],
            "abilities": [
              "いかく",
              "にげあし",
              "はりこみ"
            ],
            "actions": [],
            "types": [
              "あく"
            ],
            "hp": 180,
            "atk": 23,
            "def": 19,
            "sp_atk": 14,
            "sp_def": 17,
            "speed": 17
          },
          {
            "name": "カイデン",
            "moves": [
              "スパーク",
              "でんじは",
              "でんこうせっか",
              "ついばむ"
            ],
            "abilities": [
              "ふうりょくでんき",
              "ちくでん",
              "かちき"
            ],
            "actions": [],
            "types": [
              "でんき",
              "ひこう"
            ],
            "hp": 155,
            "atk": 14,
            "def": 13,
            "sp_atk": 18,
            "sp_def": 14,
            "speed": 21
          },
          {
            "name": "カジッチュ",
            "moves": [
              "ふいうち",
              "おどろかす",
              "ころがる",
              "まるくなる"
            ],
            "abilities": [
              "じゅくせい",
              "くいしんぼう",
              "ぼうだん"
            ],
            "actions": [],
            "types": [
              "くさ",
              "ドラゴン"
            ],
            "hp": 155,
            "atk": 14,
            "def": 24,
            "sp_atk": 14,
            "sp_def": 14,
            "speed": 9
          },
          {
            "name": "カムカメ",
            "moves": [
              "ずつき",
              "みずでっぽう",
              "かみつく",
              "カウンター"
            ],
            "abilities": [
              "がんじょうあご",
              "シェルアーマー",
              "すいすい"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 170,
            "atk": 20,
            "def": 17,
            "sp_atk": 14,
            "sp_def": 14,
            "speed": 15
          },
          {
            "name": "カリキリ",
            "moves": [
              "このは",
              "れんぞくぎり",
              "せいちょう",
              "マジカルリーフ"
            ],
            "abilities": [
              "リーフガード",
              "あまのじゃく"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 155,
            "atk": 18,
            "def": 13,
            "sp_atk": 17,
            "sp_def": 13,
            "speed": 13
          },
          {
            "name": "カルボウ",
            "moves": [
              "ひのこ",
              "おにび",
              "かなしばり",
              "からげんき"
            ],
            "abilities": [
              "もらいび",
              "ほのおのからだ"
            ],
            "actions": [],
            "types": [
              "ほのお"
            ],
            "hp": 155,
            "atk": 17,
            "def": 14,
            "sp_atk": 17,
            "sp_def": 14,
            "speed": 13
          },
          {
            "name": "キノココ",
            "moves": [
              "ずつき",
              "タネマシンガン",
              "キノコのほうし",
              "すいとる"
            ],
            "abilities": [
              "ほうし",
              "ポイズンヒール",
              "はやあし"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 180,
            "atk": 14,
            "def": 19,
            "sp_atk": 14,
            "sp_def": 19,
            "speed": 13
          },
          {
            "name": "キャモメ",
            "moves": [
              "みずでっぽう",
              "つばさでうつ",
              "なきごえ",
              "どろぼう"
            ],
            "abilities": [
              "するどいめ",
              "うるおいボディ",
              "あめうけざら"
            ],
            "actions": [],
            "types": [
              "みず",
              "ひこう"
            ],
            "hp": 155,
            "atk": 12,
            "def": 12,
            "sp_atk": 18,
            "sp_def": 12,
            "speed": 25
          },
          {
            "name": "グルトン",
            "moves": [
              "たいあたり",
              "エコーボイス",
              "ほしがる",
              "しっぽをふる"
            ],
            "abilities": [
              "アロマベール",
              "くいしんぼう",
              "あついしぼう"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 170,
            "atk": 15,
            "def": 14,
            "sp_atk": 13,
            "sp_def": 15,
            "speed": 13
          },
          {
            "name": "ケイコウオ",
            "moves": [
              "サイケこうせん",
              "みずのはどう",
              "かぜおこし",
              "はたく"
            ],
            "abilities": [
              "すいすい",
              "よびみず",
              "みずのベール"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 165,
            "atk": 16,
            "def": 18,
            "sp_atk": 16,
            "sp_def": 19,
            "speed": 20
          },
          {
            "name": "ココガラ",
            "moves": [
              "ついばむ",
              "つめとぎ",
              "みだれづき",
              "ちょうはつ"
            ],
            "abilities": [
              "するどいめ",
              "きんちょうかん",
              "はとむね"
            ],
            "actions": [],
            "types": [
              "ひこう"
            ],
            "hp": 155,
            "atk": 16,
            "def": 13,
            "sp_atk": 12,
            "sp_def": 13,
            "speed": 18
          },
          {
            "name": "コジオ",
            "moves": [
              "ロックカット",
              "いわおとし",
              "マッドショット",
              "ずつき"
            ],
            "abilities": [
              "きよめのしお",
              "がんじょう",
              "クリアボディ"
            ],
            "actions": [],
            "types": [
              "いわ"
            ],
            "hp": 175,
            "atk": 18,
            "def": 23,
            "sp_atk": 13,
            "sp_def": 13,
            "speed": 11
          },
          {
            "name": "コロボーシ",
            "moves": [
              "なきごえ",
              "むしのていこう",
              "むしくい"
            ],
            "abilities": [
              "だっぴ",
              "にげあし"
            ],
            "actions": [],
            "types": [
              "むし"
            ],
            "hp": 150,
            "atk": 11,
            "def": 14,
            "sp_atk": 11,
            "sp_def": 14,
            "speed": 11
          },
          {
            "name": "コンパン",
            "moves": [
              "サイケこうせん",
              "むしのていこう",
              "かなしばり",
              "むしくい"
            ],
            "abilities": [
              "ふくがん",
              "いろめがね",
              "にげあし"
            ],
            "actions": [],
            "types": [
              "むし",
              "どく"
            ],
            "hp": 180,
            "atk": 18,
            "def": 17,
            "sp_atk": 14,
            "sp_def": 18,
            "speed": 15
          },
          {
            "name": "シェルダー",
            "moves": [
              "みずでっぽう",
              "こおりのつぶて",
              "ちょうおんぱ",
              "オーロラビーム"
            ],
            "abilities": [
              "シェルアーマー",
              "スキルリンク",
              "ぼうじん"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 145,
            "atk": 20,
            "def": 29,
            "sp_atk": 15,
            "sp_def": 11,
            "speed": 14
          },
          {
            "name": "シガロコ",
            "moves": [
              "むしのていこう",
              "ころがる",
              "マッドショット",
              "まるくなる"
            ],
            "abilities": [
              "ふくがん",
              "だっぴ"
            ],
            "actions": [],
            "types": [
              "むし"
            ],
            "hp": 155,
            "atk": 17,
            "def": 19,
            "sp_atk": 12,
            "sp_def": 18,
            "speed": 12
          },
          {
            "name": "シキジカ",
            "moves": [
              "ずつき",
              "にどげり",
              "すなかけ",
              "なきごえ"
            ],
            "abilities": [
              "ようりょくそ",
              "そうしょく",
              "てんのめぐみ"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "くさ"
            ],
            "hp": 180,
            "atk": 19,
            "def": 17,
            "sp_atk": 14,
            "sp_def": 17,
            "speed": 23
          },
          {
            "name": "シシコ",
            "moves": [
              "ひのこ",
              "ふるいたてる",
              "ずつき",
              "にらみつける"
            ],
            "abilities": [
              "とうそうしん",
              "きんちょうかん",
              "じしんかじょう"
            ],
            "actions": [],
            "types": [
              "ほのお",
              "ノーマル"
            ],
            "hp": 180,
            "atk": 17,
            "def": 18,
            "sp_atk": 22,
            "sp_def": 17,
            "speed": 22
          },
          {
            "name": "シビシラス",
            "moves": [
              "たいあたり",
              "でんじは",
              "スパーク",
              "チャージビーム"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 150,
            "atk": 18,
            "def": 14,
            "sp_atk": 15,
            "sp_def": 14,
            "speed": 19
          },
          {
            "name": "シルシュルー",
            "moves": [
              "どくどくのキバ",
              "おだてる",
              "みだれひっかき",
              "にらみつける"
            ],
            "abilities": [
              "かるわざ",
              "わるいてぐせ",
              "いたずらごころ"
            ],
            "actions": [],
            "types": [
              "どく",
              "ノーマル"
            ],
            "hp": 155,
            "atk": 20,
            "def": 13,
            "sp_atk": 14,
            "sp_def": 13,
            "speed": 23
          },
          {
            "name": "スナヘビ",
            "moves": [
              "じならし",
              "ぶんまわす",
              "ずつき",
              "とぐろをまく"
            ],
            "abilities": [
              "すなはき",
              "だっぴ",
              "すながくれ"
            ],
            "actions": [],
            "types": [
              "じめん"
            ],
            "hp": 170,
            "atk": 18,
            "def": 23,
            "sp_atk": 13,
            "sp_def": 17,
            "speed": 16
          },
          {
            "name": "スリープ",
            "moves": [
              "かなしばり",
              "さいみんじゅつ",
              "ねんりき",
              "ずつき"
            ],
            "abilities": [
              "ふみん",
              "よちむ",
              "せいしんりょく"
            ],
            "actions": [],
            "types": [
              "エスパー"
            ],
            "hp": 180,
            "atk": 16,
            "def": 15,
            "sp_atk": 15,
            "sp_def": 26,
            "speed": 15
          },
          {
            "name": "ズピカ",
            "moves": [
              "でんきショック",
              "みずでっぽう",
              "じゅうでん",
              "マッドショット"
            ],
            "abilities": [
              "マイペース",
              "せいでんき",
              "しめりけ"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 180,
            "atk": 12,
            "def": 14,
            "sp_atk": 19,
            "sp_def": 13,
            "speed": 15
          },
          {
            "name": "タマンチュラ",
            "moves": [
              "むしのていこう",
              "とびつく",
              "ダメおし",
              "いとをはく"
            ],
            "abilities": [
              "ふみん",
              "はりこみ"
            ],
            "actions": [],
            "types": [
              "むし"
            ],
            "hp": 150,
            "atk": 14,
            "def": 15,
            "sp_atk": 11,
            "sp_def": 14,
            "speed": 9
          },
          {
            "name": "チュリネ",
            "moves": [
              "せいちょう",
              "ねむりごな",
              "すいとる",
              "メガドレイン"
            ],
            "abilities": [
              "ようりょくそ",
              "マイペース",
              "リーフガード"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 160,
            "atk": 13,
            "def": 17,
            "sp_atk": 21,
            "sp_def": 17,
            "speed": 12
          },
          {
            "name": "チルット",
            "moves": [
              "つつく",
              "りんしょう",
              "りゅうのいぶき",
              "チャームボイス"
            ],
            "abilities": [
              "しぜんかいふく",
              "ノーてんき"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 160,
            "atk": 14,
            "def": 19,
            "sp_atk": 14,
            "sp_def": 23,
            "speed": 17
          },
          {
            "name": "ドジョッチ",
            "moves": [
              "みずのはどう",
              "マッドショット",
              "とっしん",
              "スパーク"
            ],
            "abilities": [
              "どんかん",
              "きけんよち",
              "うるおいボディ"
            ],
            "actions": [],
            "types": [
              "みず",
              "じめん"
            ],
            "hp": 170,
            "atk": 16,
            "def": 15,
            "sp_atk": 16,
            "sp_def": 14,
            "speed": 19
          },
          {
            "name": "ノコッチ",
            "moves": [
              "どろかけ",
              "ころがる",
              "まるくなる",
              "じたばた"
            ],
            "abilities": [
              "てんのめぐみ",
              "にげあし",
              "びびり"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 230,
            "atk": 21,
            "def": 21,
            "sp_atk": 20,
            "sp_def": 20,
            "speed": 15
          },
          {
            "name": "ノノクラゲ",
            "moves": [
              "メガドレイン",
              "しびれごな",
              "どろかけ",
              "マッドショット"
            ],
            "abilities": [
              "きんしのちから"
            ],
            "actions": [],
            "types": [
              "じめん",
              "くさ"
            ],
            "hp": 155,
            "atk": 14,
            "def": 13,
            "sp_atk": 17,
            "sp_def": 29,
            "speed": 21
          },
          {
            "name": "ハネッコ",
            "moves": [
              "すいとる",
              "ようせいのかぜ",
              "たいあたり"
            ],
            "abilities": [
              "ようりょくそ",
              "リーフガード",
              "すりぬけ"
            ],
            "actions": [],
            "types": [
              "くさ",
              "ひこう"
            ],
            "hp": 150,
            "atk": 13,
            "def": 14,
            "sp_atk": 13,
            "sp_def": 18,
            "speed": 17
          },
          {
            "name": "パピモッチ",
            "moves": [
              "たいあたり",
              "したでなめる",
              "かみつく",
              "ほしがる"
            ],
            "abilities": [
              "マイペース",
              "ぶきよう"
            ],
            "actions": [],
            "types": [
              "フェアリー"
            ],
            "hp": 150,
            "atk": 18,
            "def": 21,
            "sp_atk": 12,
            "sp_def": 18,
            "speed": 20
          },
          {
            "name": "パモ",
            "moves": [
              "ほっぺすりすり",
              "でんこうせっか",
              "じゅうでん",
              "かみつく"
            ],
            "abilities": [
              "せいでんき",
              "しぜんかいふく",
              "てつのこぶし"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 160,
            "atk": 17,
            "def": 9,
            "sp_atk": 14,
            "sp_def": 11,
            "speed": 19
          },
          {
            "name": "ヒマナッツ",
            "moves": [
              "すいとる",
              "たいあたり",
              "ひかりのかべ",
              "メガドレイン"
            ],
            "abilities": [
              "ようりょくそ",
              "サンパワー",
              "はやおき"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 145,
            "atk": 12,
            "def": 12,
            "sp_atk": 12,
            "sp_def": 12,
            "speed": 12
          },
          {
            "name": "ヒラヒナ",
            "moves": [
              "サイケこうせん",
              "つぶらなひとみ",
              "チャームボイス",
              "つつく"
            ],
            "abilities": [
              "きけんよち",
              "おみとおし",
              "かそく"
            ],
            "actions": [],
            "types": [
              "エスパー"
            ],
            "hp": 145,
            "atk": 13,
            "def": 12,
            "sp_atk": 18,
            "sp_def": 12,
            "speed": 23
          },
          {
            "name": "ピチュー",
            "moves": [
              "でんきショック",
              "ほっぺすりすり",
              "わるだくみ",
              "スピードスター"
            ],
            "abilities": [
              "せいでんき",
              "ひらいしん"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 130,
            "atk": 14,
            "def": 8,
            "sp_atk": 13,
            "sp_def": 13,
            "speed": 19
          },
          {
            "name": "フラベベ",
            "moves": [
              "ようせいのかぜ",
              "なみだめ",
              "つるのムチ",
              "たいあたり"
            ],
            "abilities": [
              "フラワーベール",
              "きょうせい"
            ],
            "actions": [],
            "types": [
              "フェアリー"
            ],
            "hp": 160,
            "atk": 14,
            "def": 14,
            "sp_atk": 19,
            "sp_def": 23,
            "speed": 15
          },
          {
            "name": "ププリン",
            "moves": [
              "チャームボイス",
              "てんしのキッス",
              "ドレインキッス",
              "こごえるかぜ"
            ],
            "abilities": [
              "メロメロボディ",
              "かちき",
              "フレンドガード"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "フェアリー"
            ],
            "hp": 215,
            "atk": 12,
            "def": 8,
            "sp_atk": 14,
            "sp_def": 9,
            "speed": 8
          },
          {
            "name": "ホシガリス",
            "moves": [
              "たいあたり",
              "かみつく",
              "しっぽをふる",
              "カウンター"
            ],
            "abilities": [
              "ほおぶくろ",
              "くいしんぼう"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 190,
            "atk": 18,
            "def": 18,
            "sp_atk": 13,
            "sp_def": 13,
            "speed": 11
          },
          {
            "name": "ボチ",
            "moves": [
              "したでなめる",
              "かみつく",
              "ずつき",
              "なきごえ"
            ],
            "abilities": [
              "ものひろい",
              "もふもふ"
            ],
            "actions": [],
            "types": [
              "ゴースト"
            ],
            "hp": 170,
            "atk": 19,
            "def": 19,
            "sp_atk": 12,
            "sp_def": 18,
            "speed": 13
          },
          {
            "name": "マクノシタ",
            "moves": [
              "つっぱり",
              "たいあたり",
              "きあいだめ",
              "すなかけ"
            ],
            "abilities": [
              "あついしぼう",
              "こんじょう",
              "ちからずく"
            ],
            "actions": [],
            "types": [
              "かくとう"
            ],
            "hp": 195,
            "atk": 19,
            "def": 12,
            "sp_atk": 9,
            "sp_def": 12,
            "speed": 11
          },
          {
            "name": "マケンカニ",
            "moves": [
              "はさむ",
              "いわくだき",
              "にらみつける",
              "しっぺがえし"
            ],
            "abilities": [
              "かいりきバサミ",
              "てつのこぶし",
              "いかりのつぼ"
            ],
            "actions": [],
            "types": [
              "かくとう"
            ],
            "hp": 165,
            "atk": 24,
            "def": 18,
            "sp_atk": 15,
            "sp_def": 16,
            "speed": 20
          },
          {
            "name": "マメバッタ",
            "moves": [
              "ダメおし",
              "にどげり",
              "とびつく",
              "にらみつける"
            ],
            "abilities": [
              "むしのしらせ",
              "いろめがね"
            ],
            "actions": [],
            "types": [
              "むし"
            ],
            "hp": 145,
            "atk": 16,
            "def": 14,
            "sp_atk": 10,
            "sp_def": 11,
            "speed": 15
          },
          {
            "name": "ミツハニー",
            "moves": [
              "あまいかおり",
              "むしのていこう",
              "かぜおこし",
              "むしくい"
            ],
            "abilities": [
              "みつあつめ",
              "はりきり"
            ],
            "actions": [],
            "types": [
              "むし",
              "ひこう"
            ],
            "hp": 145,
            "atk": 12,
            "def": 15,
            "sp_atk": 12,
            "sp_def": 15,
            "speed": 21
          },
          {
            "name": "ミニーブ",
            "moves": [
              "たいあたり",
              "すいとる",
              "せいちょう",
              "はっぱカッター"
            ],
            "abilities": [
              "はやおき",
              "しゅうかく"
            ],
            "actions": [],
            "types": [
              "くさ",
              "ノーマル"
            ],
            "hp": 155,
            "atk": 13,
            "def": 15,
            "sp_atk": 18,
            "sp_def": 17,
            "speed": 12
          },
          {
            "name": "ミブリム",
            "moves": [
              "ねんりき",
              "チャームボイス",
              "マジカルリーフ",
              "でんじは"
            ],
            "abilities": [
              "いやしのこころ",
              "きけんよち",
              "マジックミラー"
            ],
            "actions": [],
            "types": [
              "エスパー"
            ],
            "hp": 160,
            "atk": 12,
            "def": 15,
            "sp_atk": 18,
            "sp_def": 17,
            "speed": 14
          },
          {
            "name": "ムックル",
            "moves": [
              "つばめがえし",
              "でんこうせっか",
              "かげぶんしん",
              "なきごえ"
            ],
            "abilities": [
              "するどいめ",
              "すてみ"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 155,
            "atk": 18,
            "def": 12,
            "sp_atk": 12,
            "sp_def": 12,
            "speed": 19
          },
          {
            "name": "メェークル",
            "moves": [
              "たいあたり",
              "せいちょう",
              "つるのムチ",
              "はっぱカッター"
            ],
            "abilities": [
              "そうしょく",
              "くさのけがわ"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 185,
            "atk": 20,
            "def": 16,
            "sp_atk": 19,
            "sp_def": 18,
            "speed": 17
          },
          {
            "name": "ヤングース",
            "moves": [
              "たいあたり",
              "かみつく",
              "すなかけ",
              "ふるいたてる"
            ],
            "abilities": [
              "はりこみ",
              "がんじょうあご",
              "てきおうりょく"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 165,
            "atk": 21,
            "def": 12,
            "sp_atk": 12,
            "sp_def": 12,
            "speed": 15
          },
          {
            "name": "ユキハミ",
            "moves": [
              "こなゆき",
              "むしのていこう",
              "こごえるかぜ"
            ],
            "abilities": [
              "りんぷん",
              "こおりのりんぷん"
            ],
            "actions": [],
            "types": [
              "こおり",
              "むし"
            ],
            "hp": 145,
            "atk": 11,
            "def": 13,
            "sp_atk": 15,
            "sp_def": 12,
            "speed": 9
          },
          {
            "name": "ラルトス",
            "moves": [
              "チャームボイス",
              "ねんりき",
              "ドレインキッス",
              "さいみんじゅつ"
            ],
            "abilities": [
              "シンクロ",
              "トレース",
              "テレパシー"
            ],
            "actions": [],
            "types": [
              "エスパー",
              "フェアリー"
            ],
            "hp": 140,
            "atk": 11,
            "def": 11,
            "sp_atk": 15,
            "sp_def": 13,
            "speed": 14
          },
          {
            "name": "ルリリ",
            "moves": [
              "みずでっぽう",
              "あまえる",
              "しっぽをふる",
              "たたきつける"
            ],
            "abilities": [
              "あついしぼう",
              "ちからもち",
              "そうしょく"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "フェアリー"
            ],
            "hp": 170,
            "atk": 9,
            "def": 14,
            "sp_atk": 9,
            "sp_def": 14,
            "speed": 9
          }
        ],
        "4": [
          {
            "name": "アメモース",
            "moves": [
              "むしのさざめき",
              "エアスラッシュ",
              "こうそくいどう",
              "しびれごな"
            ],
            "abilities": [
              "いかく",
              "きんちょうかん"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力40% ちょうのまい"
            ],
            "types": [
              "むし",
              "ひこう"
            ],
            "hp": 1416,
            "atk": 59,
            "def": 60,
            "sp_atk": 95,
            "sp_def": 78,
            "speed": 77
          },
          {
            "name": "イキリンコ",
            "moves": [
              "からげんき",
              "ブレイブバード",
              "ちょうはつ",
              "さわぐ"
            ],
            "abilities": [
              "いかく",
              "はりきり",
              "こんじょう"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力75% おだてる",
              "体力40% 強化解除"
            ],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 1536,
            "atk": 91,
            "def": 50,
            "sp_atk": 45,
            "sp_def": 50,
            "speed": 87
          },
          {
            "name": "イシヘンジン",
            "moves": [
              "いわなだれ",
              "のしかかり",
              "じゅうりょく",
              "じだんだ"
            ],
            "abilities": [
              "パワースポット"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% のろい"
            ],
            "types": [
              "いわ"
            ],
            "hp": 1740,
            "atk": 117,
            "def": 126,
            "sp_atk": 23,
            "sp_def": 23,
            "speed": 68
          },
          {
            "name": "イッカネズミ",
            "moves": [
              "とっしん",
              "じゃれつく",
              "アンコール",
              "タネマシンガン"
            ],
            "abilities": [
              "フレンドガード",
              "ほおぶくろ",
              "テクニシャン"
            ],
            "actions": [
              "時間75% けたぐり",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1452,
            "atk": 72,
            "def": 68,
            "sp_atk": 63,
            "sp_def": 72,
            "speed": 104
          },
          {
            "name": "ウミトリオ",
            "moves": [
              "トリプルダイブ",
              "ふいうち",
              "アクアジェット",
              "からげんき"
            ],
            "abilities": [
              "ぬめぬめ",
              "びびり",
              "すながくれ"
            ],
            "actions": [
              "時間75% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 1032,
            "atk": 95,
            "def": 50,
            "sp_atk": 50,
            "sp_def": 68,
            "speed": 113
          },
          {
            "name": "オコリザル",
            "moves": [
              "かわらわり",
              "ふんどのこぶし",
              "きしかいせい",
              "アンコール"
            ],
            "abilities": [
              "やるき",
              "いかりのつぼ",
              "まけんき"
            ],
            "actions": [
              "時間75% ビルドアップ",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 1356,
            "atk": 99,
            "def": 59,
            "sp_atk": 59,
            "sp_def": 68,
            "speed": 90
          },
          {
            "name": "オドリドリ",
            "moves": [
              "めざめるダンス",
              "エアスラッシュ",
              "メロメロ",
              "フラフラダンス"
            ],
            "abilities": [
              "おどりこ"
            ],
            "actions": [
              "時間90% にほんばれ",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "ほのお",
              "ひこう"
            ],
            "hp": 1464,
            "atk": 68,
            "def": 68,
            "sp_atk": 93,
            "sp_def": 68,
            "speed": 88
          },
          {
            "name": "オノンド",
            "moves": [
              "ドラゴンクロー",
              "かみくだく",
              "こわいかお",
              "りゅうのはどう"
            ],
            "abilities": [
              "とうそうしん",
              "かたやぶり",
              "きんちょうかん"
            ],
            "actions": [
              "時間75% りゅうのまい",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 1368,
            "atk": 110,
            "def": 68,
            "sp_atk": 41,
            "sp_def": 50,
            "speed": 65
          },
          {
            "name": "カエンジシ",
            "moves": [
              "ハイパーボイス",
              "かえんほうしゃ",
              "おたけび",
              "ほのおのキバ"
            ],
            "abilities": [
              "とうそうしん",
              "きんちょうかん",
              "じしんかじょう"
            ],
            "actions": [
              "時間60% バークアウト",
              "時間50% 強化解除",
              "体力30% 弱体解除"
            ],
            "types": [
              "ほのお",
              "ノーマル"
            ],
            "hp": 1584,
            "atk": 66,
            "def": 69,
            "sp_atk": 103,
            "sp_def": 64,
            "speed": 100
          },
          {
            "name": "カジリガメ",
            "moves": [
              "シェルブレード",
              "いわなだれ",
              "ずつき",
              "こわいかお"
            ],
            "abilities": [
              "がんじょうあご",
              "シェルアーマー",
              "すいすい"
            ],
            "actions": [
              "時間80% あまごい",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "みず",
              "いわ"
            ],
            "hp": 1632,
            "atk": 108,
            "def": 86,
            "sp_atk": 48,
            "sp_def": 66,
            "speed": 71
          },
          {
            "name": "カマスジョー",
            "moves": [
              "アクアブレイク",
              "かみくだく",
              "アクアジェット",
              "きあいだめ"
            ],
            "abilities": [
              "すいすい",
              "スクリューおびれ"
            ],
            "actions": [
              "時間75% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 1308,
            "atk": 115,
            "def": 59,
            "sp_atk": 59,
            "sp_def": 50,
            "speed": 127
          },
          {
            "name": "カラミンゴ",
            "moves": [
              "メガトンキック",
              "つばめがえし",
              "エアスラッシュ",
              "しっぺがえし"
            ],
            "abilities": [
              "きもったま",
              "ちどりあし",
              "きょうえん"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力75% ちょうはつ",
              "体力40% 強化解除"
            ],
            "types": [
              "ひこう",
              "かくとう"
            ],
            "hp": 1536,
            "atk": 108,
            "def": 71,
            "sp_atk": 72,
            "sp_def": 62,
            "speed": 86
          },
          {
            "name": "ガバイト",
            "moves": [
              "ドラゴンクロー",
              "すなあらし",
              "かみつく",
              "すなじごく"
            ],
            "abilities": [
              "すながくれ",
              "さめはだ"
            ],
            "actions": [
              "時間80% 弱体解除",
              "体力50% すなあらし",
              "体力40% 弱体解除"
            ],
            "types": [
              "ドラゴン",
              "じめん"
            ],
            "hp": 1392,
            "atk": 86,
            "def": 63,
            "sp_atk": 50,
            "sp_def": 54,
            "speed": 78
          },
          {
            "name": "キリキザン",
            "moves": [
              "アイアンヘッド",
              "つじぎり",
              "きりさく",
              "こわいかお"
            ],
            "abilities": [
              "まけんき",
              "せいしんりょく",
              "プレッシャー"
            ],
            "actions": [
              "時間40% 強化解除",
              "時間40% てっぺき",
              "体力75% 弱体解除"
            ],
            "types": [
              "あく",
              "はがね"
            ],
            "hp": 1356,
            "atk": 117,
            "def": 95,
            "sp_atk": 59,
            "sp_def": 68,
            "speed": 68
          },
          {
            "name": "クエスパトラ",
            "moves": [
              "ルミナコリジョン",
              "マジカルシャイン",
              "つぶらなひとみ",
              "フェザーダンス"
            ],
            "abilities": [
              "びんじょう",
              "おみとおし",
              "かそく"
            ],
            "actions": [
              "時間75% サイコフィールド",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 1680,
            "atk": 59,
            "def": 59,
            "sp_atk": 95,
            "sp_def": 59,
            "speed": 99
          },
          {
            "name": "ケケンカニ",
            "moves": [
              "アイスハンマー",
              "きしかいせい",
              "たたきつける",
              "いわくだき"
            ],
            "abilities": [
              "かいりきバサミ",
              "てつのこぶし",
              "いかりのつぼ"
            ],
            "actions": [
              "時間90% ゆきげしき",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "かくとう",
              "こおり"
            ],
            "hp": 1704,
            "atk": 123,
            "def": 74,
            "sp_atk": 60,
            "sp_def": 65,
            "speed": 43
          },
          {
            "name": "ケンタロス",
            "moves": [
              "レイジングブル",
              "しねんのずつき",
              "こわいかお",
              "いばる"
            ],
            "abilities": [
              "いかく",
              "いかりのつぼ",
              "はんすう"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力75% ふるいたてる",
              "体力40% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1464,
            "atk": 95,
            "def": 90,
            "sp_atk": 41,
            "sp_def": 68,
            "speed": 104
          },
          {
            "name": "コオリッポ",
            "moves": [
              "なみのり",
              "つららおとし",
              "ずつき",
              "しろいきり"
            ],
            "abilities": [
              "アイスフェイス"
            ],
            "actions": [
              "時間90% ゆきげしき",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "こおり"
            ],
            "hp": 1464,
            "atk": 77,
            "def": 104,
            "sp_atk": 63,
            "sp_def": 86,
            "speed": 50
          },
          {
            "name": "コモルー",
            "moves": [
              "ドラゴンクロー",
              "かえんほうしゃ",
              "きあいだめ",
              "ずつき"
            ],
            "abilities": [
              "いしあたま",
              "ぼうじん"
            ],
            "actions": [
              "時間75% りゅうのまい",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 1356,
            "atk": 90,
            "def": 95,
            "sp_atk": 59,
            "sp_def": 50,
            "speed": 50
          },
          {
            "name": "コータス",
            "moves": [
              "ふんえん",
              "のしかかり",
              "クリアスモッグ",
              "あくび"
            ],
            "abilities": [
              "しろいけむり",
              "ひでり",
              "シェルアーマー"
            ],
            "actions": [
              "時間40% 弱体解除",
              "体力75% からにこもる",
              "体力35% からをやぶる"
            ],
            "types": [
              "ほのお"
            ],
            "hp": 1416,
            "atk": 81,
            "def": 131,
            "sp_atk": 81,
            "sp_def": 68,
            "speed": 23
          },
          {
            "name": "ゴルダック",
            "moves": [
              "アクアテール",
              "しねんのずつき",
              "みずのはどう",
              "さいみんじゅつ"
            ],
            "abilities": [
              "しめりけ",
              "ノーてんき",
              "すいすい"
            ],
            "actions": [
              "時間75% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 1524,
            "atk": 78,
            "def": 75,
            "sp_atk": 90,
            "sp_def": 77,
            "speed": 81
          },
          {
            "name": "ゴーゴート",
            "moves": [
              "タネばくだん",
              "とっしん",
              "せいちょう",
              "しっぽをふる"
            ],
            "abilities": [
              "そうしょく",
              "くさのけがわ"
            ],
            "actions": [
              "時間90% グラスフィールド",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "くさ"
            ],
            "hp": 1980,
            "atk": 95,
            "def": 60,
            "sp_atk": 92,
            "sp_def": 77,
            "speed": 66
          },
          {
            "name": "サダイジャ",
            "moves": [
              "じならし",
              "へびにらみ",
              "ぶんまわす",
              "たたきつける"
            ],
            "abilities": [
              "すなはき",
              "だっぴ",
              "すながくれ"
            ],
            "actions": [
              "時間75% とぐろをまく",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "じめん"
            ],
            "hp": 1428,
            "atk": 101,
            "def": 117,
            "sp_atk": 63,
            "sp_def": 68,
            "speed": 68
          },
          {
            "name": "サナギラス",
            "moves": [
              "いわなだれ",
              "じだんだ",
              "うちおとす",
              "いやなおと"
            ],
            "abilities": [
              "だっぴ"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力90% すなあらし",
              "体力75% 弱体解除"
            ],
            "types": [
              "いわ",
              "じめん"
            ],
            "hp": 1416,
            "atk": 80,
            "def": 68,
            "sp_atk": 63,
            "sp_def": 68,
            "speed": 50
          },
          {
            "name": "ザングース",
            "moves": [
              "ブレイククロー",
              "つじぎり",
              "でんこうせっか",
              "つけあがる"
            ],
            "abilities": [
              "めんえき",
              "どくぼうそう"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力40% つるぎのまい"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1440,
            "atk": 108,
            "def": 59,
            "sp_atk": 59,
            "sp_def": 59,
            "speed": 86
          },
          {
            "name": "シビビール",
            "moves": [
              "ほうでん",
              "あばれる",
              "いえき",
              "かみくだく"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間75% とぐろをまく",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "でんき"
            ],
            "hp": 1356,
            "atk": 81,
            "def": 68,
            "sp_atk": 72,
            "sp_def": 68,
            "speed": 41
          },
          {
            "name": "ジヘッド",
            "moves": [
              "りゅうのはどう",
              "あくのはどう",
              "かみつく",
              "こわいかお"
            ],
            "abilities": [
              "はりきり"
            ],
            "actions": [
              "時間75% ふるいたてる",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "あく",
              "ドラゴン"
            ],
            "hp": 1428,
            "atk": 81,
            "def": 68,
            "sp_atk": 63,
            "sp_def": 68,
            "speed": 57
          },
          {
            "name": "ジュペッタ",
            "moves": [
              "シャドークロー",
              "ふいうち",
              "たたりめ",
              "ちょうはつ"
            ],
            "abilities": [
              "ふみん",
              "おみとおし",
              "のろわれボディ"
            ],
            "actions": [
              "時間50% わるだくみ",
              "時間40% 弱体解除",
              "体力90% おにび"
            ],
            "types": [
              "ゴースト"
            ],
            "hp": 1344,
            "atk": 108,
            "def": 63,
            "sp_atk": 79,
            "sp_def": 61,
            "speed": 63
          },
          {
            "name": "スカタンク",
            "moves": [
              "かみくだく",
              "どくづき",
              "のしかかり",
              "きあいだめ"
            ],
            "abilities": [
              "あくしゅう",
              "ゆうばく",
              "するどいめ"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力40% いやなおと"
            ],
            "types": [
              "どく",
              "あく"
            ],
            "hp": 1764,
            "atk": 88,
            "def": 65,
            "sp_atk": 68,
            "sp_def": 59,
            "speed": 80
          },
          {
            "name": "スコヴィラン",
            "moves": [
              "タネばくだん",
              "かえんほうしゃ",
              "なやみのタネ",
              "ずつき"
            ],
            "abilities": [
              "ようりょくそ",
              "ふみん",
              "ムラっけ"
            ],
            "actions": [
              "時間95% にほんばれ",
              "時間65% せいちょう",
              "時間40% 弱体解除"
            ],
            "types": [
              "くさ",
              "ほのお"
            ],
            "hp": 1356,
            "atk": 102,
            "def": 63,
            "sp_atk": 102,
            "sp_def": 63,
            "speed": 72
          },
          {
            "name": "ストライク",
            "moves": [
              "シザークロス",
              "つばめがえし",
              "きあいだめ",
              "きりさく"
            ],
            "abilities": [
              "むしのしらせ",
              "テクニシャン",
              "ふくつのこころ"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力40% つるぎのまい"
            ],
            "types": [
              "むし",
              "ひこう"
            ],
            "hp": 1416,
            "atk": 104,
            "def": 77,
            "sp_atk": 54,
            "sp_def": 77,
            "speed": 99
          },
          {
            "name": "スリーパー",
            "moves": [
              "サイコショック",
              "サイコキネシス",
              "さいみんじゅつ",
              "れいとうパンチ"
            ],
            "abilities": [
              "ふみん",
              "よちむ",
              "せいしんりょく"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力75% さいみんじゅつ",
              "体力45% めいそう"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 1572,
            "atk": 70,
            "def": 68,
            "sp_atk": 70,
            "sp_def": 108,
            "speed": 65
          },
          {
            "name": "タイカイデン",
            "moves": [
              "ほうでん",
              "エアスラッシュ",
              "エレキボール",
              "おいかぜ"
            ],
            "abilities": [
              "ふうりょくでんき",
              "ちくでん",
              "かちき"
            ],
            "actions": [
              "時間80% おいかぜ",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "でんき",
              "ひこう"
            ],
            "hp": 1416,
            "atk": 68,
            "def": 59,
            "sp_atk": 99,
            "sp_def": 59,
            "speed": 117
          },
          {
            "name": "タイレーツ",
            "moves": [
              "きしかいせい",
              "であいがしら",
              "かわらわり",
              "とっしん"
            ],
            "abilities": [
              "カブトアーマー",
              "まけんき"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力50% はいすいのじん"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 1356,
            "atk": 95,
            "def": 95,
            "sp_atk": 68,
            "sp_def": 59,
            "speed": 72
          },
          {
            "name": "タギングル",
            "moves": [
              "どくづき",
              "きりさく",
              "ちょうはつ",
              "おだてる"
            ],
            "abilities": [
              "かるわざ",
              "どくしゅ",
              "いたずらごころ"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間75% どくどく",
              "時間40% 強化解除"
            ],
            "types": [
              "どく",
              "ノーマル"
            ],
            "hp": 1332,
            "atk": 90,
            "def": 63,
            "sp_atk": 77,
            "sp_def": 69,
            "speed": 104
          },
          {
            "name": "ダグトリオ",
            "moves": [
              "じしん",
              "つじぎり",
              "きりさく",
              "おどろかす"
            ],
            "abilities": [
              "すながくれ",
              "ありじごく",
              "すなのちから"
            ],
            "actions": [
              "時間80% 弱体解除",
              "体力50% すなあらし",
              "体力40% 弱体解除"
            ],
            "types": [
              "じめん"
            ],
            "hp": 1032,
            "atk": 95,
            "def": 50,
            "sp_atk": 50,
            "sp_def": 68,
            "speed": 113
          },
          {
            "name": "チャーレム",
            "moves": [
              "かわらわり",
              "しねんのずつき",
              "サイケこうせん",
              "ねこだまし"
            ],
            "abilities": [
              "ヨガパワー",
              "テレパシー"
            ],
            "actions": [
              "時間75% ふるいたてる",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "かくとう",
              "エスパー"
            ],
            "hp": 1308,
            "atk": 59,
            "def": 72,
            "sp_atk": 59,
            "sp_def": 72,
            "speed": 77
          },
          {
            "name": "ツンベアー",
            "moves": [
              "つららおとし",
              "きりさく",
              "あくび",
              "れいとうビーム"
            ],
            "abilities": [
              "ゆきがくれ",
              "ゆきかき",
              "すいすい"
            ],
            "actions": [
              "時間90% ゆきげしき",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "こおり"
            ],
            "hp": 1680,
            "atk": 122,
            "def": 77,
            "sp_atk": 68,
            "sp_def": 77,
            "speed": 50
          },
          {
            "name": "デデンネ",
            "moves": [
              "ほうでん",
              "マジカルシャイン",
              "ほっぺすりすり",
              "あまえる"
            ],
            "abilities": [
              "ほおぶくろ",
              "ものひろい",
              "プラス"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% 弱体解除",
              "体力25% あまえる"
            ],
            "types": [
              "でんき",
              "フェアリー"
            ],
            "hp": 1380,
            "atk": 57,
            "def": 56,
            "sp_atk": 77,
            "sp_def": 65,
            "speed": 95
          },
          {
            "name": "デンリュウ",
            "moves": [
              "ほうでん",
              "パワージェム",
              "あやしいひかり",
              "エレキボール"
            ],
            "abilities": [
              "せいでんき",
              "プラス"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% 弱体解除",
              "体力25% コットンガード"
            ],
            "types": [
              "でんき"
            ],
            "hp": 1632,
            "atk": 72,
            "def": 81,
            "sp_atk": 108,
            "sp_def": 86,
            "speed": 54
          },
          {
            "name": "トリトドン",
            "moves": [
              "みずのはどう",
              "だいちのちから",
              "だくりゅう",
              "あくび"
            ],
            "abilities": [
              "ねんちゃく",
              "よびみず",
              "すなのちから"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% たくわえる"
            ],
            "types": [
              "みず",
              "じめん"
            ],
            "hp": 1848,
            "atk": 79,
            "def": 66,
            "sp_atk": 87,
            "sp_def": 78,
            "speed": 40
          },
          {
            "name": "トリトドン",
            "moves": [
              "みずのはどう",
              "だいちのちから",
              "だくりゅう",
              "あくび"
            ],
            "abilities": [
              "ねんちゃく",
              "よびみず",
              "すなのちから"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% たくわえる"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "トロピウス",
            "moves": [
              "リーフブレード",
              "つばめがえし",
              "ずつき",
              "おいかぜ"
            ],
            "abilities": [
              "ようりょくそ",
              "サンパワー",
              "しゅうかく"
            ],
            "actions": [
              "時間75% りゅうのまい",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "くさ",
              "ひこう"
            ],
            "hp": 1728,
            "atk": 66,
            "def": 79,
            "sp_atk": 69,
            "sp_def": 83,
            "speed": 50
          },
          {
            "name": "ドオー",
            "moves": [
              "どくづき",
              "じだんだ",
              "あくび",
              "どくどく"
            ],
            "abilities": [
              "どくのトゲ",
              "ちょすい",
              "てんねん"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% たくわえる",
              "体力60% 弱体解除"
            ],
            "types": [
              "どく",
              "じめん"
            ],
            "hp": 2064,
            "atk": 72,
            "def": 59,
            "sp_atk": 45,
            "sp_def": 95,
            "speed": 23
          },
          {
            "name": "ドクロッグ",
            "moves": [
              "どくづき",
              "かわらわり",
              "ベノムショック",
              "ちょうはつ"
            ],
            "abilities": [
              "きけんよち",
              "かんそうはだ",
              "どくしゅ"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間75% どくどく",
              "時間40% 強化解除"
            ],
            "types": [
              "どく",
              "かくとう"
            ],
            "hp": 1548,
            "atk": 100,
            "def": 63,
            "sp_atk": 82,
            "sp_def": 63,
            "speed": 81
          },
          {
            "name": "ドレディア",
            "moves": [
              "エナジーボール",
              "かふんだんご",
              "はなふぶき",
              "あまえる"
            ],
            "abilities": [
              "ようりょくそ",
              "マイペース",
              "リーフガード"
            ],
            "actions": [
              "時間80% にほんばれ",
              "体力75% 弱体解除",
              "体力40% ちょうのまい"
            ],
            "types": [
              "くさ"
            ],
            "hp": 1416,
            "atk": 59,
            "def": 72,
            "sp_atk": 104,
            "sp_def": 72,
            "speed": 86
          },
          {
            "name": "ドロンチ",
            "moves": [
              "りゅうのはどう",
              "ドラゴンダイブ",
              "とっしん",
              "たたりめ"
            ],
            "abilities": [
              "クリアボディ",
              "すりぬけ",
              "のろわれボディ"
            ],
            "actions": [
              "体力80% おにび",
              "体力75% 弱体解除",
              "体力40% りゅうのまい"
            ],
            "types": [
              "ドラゴン",
              "ゴースト"
            ],
            "hp": 1392,
            "atk": 77,
            "def": 50,
            "sp_atk": 59,
            "sp_def": 50,
            "speed": 96
          },
          {
            "name": "ドンファン",
            "moves": [
              "じだんだ",
              "たたきつける",
              "ころがる",
              "ダメおし"
            ],
            "abilities": [
              "がんじょう",
              "すながくれ"
            ],
            "actions": [
              "時間90% ころがる",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "じめん"
            ],
            "hp": 1632,
            "atk": 113,
            "def": 113,
            "sp_atk": 59,
            "sp_def": 59,
            "speed": 50
          },
          {
            "name": "ナマズン",
            "moves": [
              "だくりゅう",
              "だいちのちから",
              "くすぐる",
              "アクアテール"
            ],
            "abilities": [
              "どんかん",
              "きけんよち",
              "うるおいボディ"
            ],
            "actions": [
              "時間75% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "みず",
              "じめん"
            ],
            "hp": 1848,
            "atk": 75,
            "def": 70,
            "sp_atk": 73,
            "sp_def": 68,
            "speed": 59
          },
          {
            "name": "ヌメイル",
            "moves": [
              "りゅうのはどう",
              "みずのはどう",
              "のしかかり",
              "じたばた"
            ],
            "abilities": [
              "そうしょく",
              "うるおいボディ",
              "ぬめぬめ"
            ],
            "actions": [
              "時間80% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 1392,
            "atk": 72,
            "def": 52,
            "sp_atk": 79,
            "sp_def": 106,
            "speed": 59
          },
          {
            "name": "ネオラント",
            "moves": [
              "なみのり",
              "オーロラビーム",
              "サイケこうせん",
              "しんぴのまもり"
            ],
            "abilities": [
              "すいすい",
              "よびみず",
              "みずのベール"
            ],
            "actions": [
              "時間90% おいかぜ",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 1404,
            "atk": 67,
            "def": 73,
            "sp_atk": 67,
            "sp_def": 82,
            "speed": 86
          },
          {
            "name": "ネッコアラ",
            "moves": [
              "たたきつける",
              "ふいうち",
              "ウッドハンマー",
              "じたばた"
            ],
            "abilities": [
              "ぜったいねむり"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% たくわえる"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1356,
            "atk": 108,
            "def": 63,
            "sp_atk": 72,
            "sp_def": 90,
            "speed": 63
          },
          {
            "name": "ノクタス",
            "moves": [
              "エナジーボール",
              "しっぺがえし",
              "ミサイルばり",
              "すなかけ"
            ],
            "abilities": [
              "すながくれ",
              "ちょすい"
            ],
            "actions": [
              "時間90% すなあらし",
              "時間50% 弱体解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "くさ",
              "あく"
            ],
            "hp": 1416,
            "atk": 108,
            "def": 59,
            "sp_atk": 108,
            "sp_def": 59,
            "speed": 54
          },
          {
            "name": "ノココッチ",
            "moves": [
              "ハイパードリル",
              "ドリルライナー",
              "へびにらみ",
              "からげんき"
            ],
            "abilities": [
              "てんのめぐみ",
              "にげあし",
              "びびり"
            ],
            "actions": [
              "時間75% とぐろをまく",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 2004,
            "atk": 95,
            "def": 77,
            "sp_atk": 81,
            "sp_def": 72,
            "speed": 54
          },
          {
            "name": "ハカドッグ",
            "moves": [
              "おはかまいり",
              "かみつく",
              "あまえる",
              "したでなめる"
            ],
            "abilities": [
              "すなかき",
              "もふもふ"
            ],
            "actions": [
              "時間65% あまえる",
              "時間40% 弱体解除",
              "体力75% 強化解除"
            ],
            "types": [
              "ゴースト"
            ],
            "hp": 1428,
            "atk": 95,
            "def": 95,
            "sp_atk": 50,
            "sp_def": 92,
            "speed": 66
          },
          {
            "name": "ハクリュー",
            "moves": [
              "ドラゴンダイブ",
              "アクアテール",
              "しんぴのまもり",
              "のしかかり"
            ],
            "abilities": [
              "だっぴ",
              "ふしぎなうろこ"
            ],
            "actions": [
              "時間40% 強化解除",
              "時間40% りゅうのまい",
              "体力75% 弱体解除"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 1308,
            "atk": 80,
            "def": 63,
            "sp_atk": 68,
            "sp_def": 68,
            "speed": 68
          },
          {
            "name": "ハブネーク",
            "moves": [
              "かみくだく",
              "ヘドロばくだん",
              "いばる",
              "へびにらみ"
            ],
            "abilities": [
              "だっぴ",
              "すりぬけ"
            ],
            "actions": [
              "時間75% とぐろをまく",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "どく"
            ],
            "hp": 1440,
            "atk": 95,
            "def": 59,
            "sp_atk": 95,
            "sp_def": 59,
            "speed": 63
          },
          {
            "name": "ハラバリー",
            "moves": [
              "ほうでん",
              "マッドショット",
              "だくりゅう",
              "あやしいひかり"
            ],
            "abilities": [
              "でんきにかえる",
              "せいでんき",
              "しめりけ"
            ],
            "actions": [
              "時間80% かいでんぱ",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "でんき"
            ],
            "hp": 1836,
            "atk": 62,
            "def": 86,
            "sp_atk": 97,
            "sp_def": 79,
            "speed": 45
          },
          {
            "name": "バウッツェル",
            "moves": [
              "じゃれつく",
              "とっしん",
              "あまえる",
              "かみつく"
            ],
            "abilities": [
              "こんがりボディ",
              "アロマベール"
            ],
            "actions": [
              "時間60% 強化解除",
              "体力75% 弱体解除",
              "体力40% あまえる"
            ],
            "types": [
              "フェアリー"
            ],
            "hp": 1272,
            "atk": 77,
            "def": 108,
            "sp_atk": 50,
            "sp_def": 77,
            "speed": 90
          },
          {
            "name": "パルシェン",
            "moves": [
              "シェルブレード",
              "つららおとし",
              "こわいかお",
              "こおりのつぶて"
            ],
            "abilities": [
              "シェルアーマー",
              "スキルリンク",
              "ぼうじん"
            ],
            "actions": [
              "時間40% 弱体解除",
              "体力75% からにこもる",
              "体力35% からをやぶる"
            ],
            "types": [
              "みず",
              "こおり"
            ],
            "hp": 1200,
            "atk": 90,
            "def": 167,
            "sp_atk": 81,
            "sp_def": 45,
            "speed": 68
          },
          {
            "name": "ビークイン",
            "moves": [
              "こうげきしれい",
              "むしのさざめき",
              "つばめがえし",
              "ちょうはつ"
            ],
            "abilities": [
              "プレッシャー",
              "きんちょうかん"
            ],
            "actions": [
              "時間65% ぼうぎょしれい",
              "時間30% ぼうぎょしれい",
              "体力60% 弱体解除"
            ],
            "types": [
              "むし",
              "ひこう"
            ],
            "hp": 1416,
            "atk": 77,
            "def": 96,
            "sp_atk": 77,
            "sp_def": 96,
            "speed": 41
          },
          {
            "name": "フォレトス",
            "moves": [
              "ヘビーボンバー",
              "むしくい",
              "しっぺがえし",
              "でんじほう"
            ],
            "abilities": [
              "がんじょう",
              "ぼうじん"
            ],
            "actions": [
              "時間90% かたくなる",
              "時間40% かたくなる",
              "体力60% 強化解除"
            ],
            "types": [
              "むし",
              "はがね"
            ],
            "hp": 1464,
            "atk": 86,
            "def": 131,
            "sp_atk": 59,
            "sp_def": 59,
            "speed": 41
          },
          {
            "name": "フリージオ",
            "moves": [
              "フリーズドライ",
              "げんしのちから",
              "くろいきり",
              "あやしいひかり"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間90% ゆきげしき",
              "体力50% 弱体解除",
              "体力30% オーロラベール"
            ],
            "types": [
              "こおり"
            ],
            "hp": 1524,
            "atk": 50,
            "def": 50,
            "sp_atk": 90,
            "sp_def": 126,
            "speed": 99
          },
          {
            "name": "フローゼル",
            "moves": [
              "アクアブレイク",
              "ダブルアタック",
              "みずのはどう",
              "かみつく"
            ],
            "abilities": [
              "すいすい",
              "みずのベール"
            ],
            "actions": [
              "時間80% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 1572,
            "atk": 99,
            "def": 54,
            "sp_atk": 81,
            "sp_def": 50,
            "speed": 108
          },
          {
            "name": "フワライド",
            "moves": [
              "たたりめ",
              "エアスラッシュ",
              "でんじは",
              "エアカッター"
            ],
            "abilities": [
              "ゆうばく",
              "かるわざ",
              "ねつぼうそう"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% おにび"
            ],
            "types": [
              "ゴースト",
              "ひこう"
            ],
            "hp": 2280,
            "atk": 77,
            "def": 44,
            "sp_atk": 86,
            "sp_def": 53,
            "speed": 77
          },
          {
            "name": "ブーピッグ",
            "moves": [
              "サイコショック",
              "パワージェム",
              "あやしいひかり",
              "けたぐり"
            ],
            "abilities": [
              "あついしぼう",
              "マイペース",
              "くいしんぼう"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% ひかりのかべ",
              "体力60% 弱体解除"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 1524,
            "atk": 45,
            "def": 63,
            "sp_atk": 86,
            "sp_def": 104,
            "speed": 77
          },
          {
            "name": "プクリン",
            "moves": [
              "マジカルシャイン",
              "ハイパーボイス",
              "あまえる",
              "アンコール"
            ],
            "abilities": [
              "メロメロボディ",
              "かちき",
              "おみとおし"
            ],
            "actions": [
              "時間70% うたう",
              "時間60% 強化解除",
              "体力30% うたう"
            ],
            "types": [
              "ノーマル",
              "フェアリー"
            ],
            "hp": 2172,
            "atk": 68,
            "def": 45,
            "sp_atk": 81,
            "sp_def": 50,
            "speed": 45
          },
          {
            "name": "ヘラクロス",
            "moves": [
              "かわらわり",
              "じごくづき",
              "からげんき",
              "とびつく"
            ],
            "abilities": [
              "むしのしらせ",
              "こんじょう",
              "じしんかじょう"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力40% つるぎのまい"
            ],
            "types": [
              "むし",
              "かくとう"
            ],
            "hp": 1524,
            "atk": 117,
            "def": 72,
            "sp_atk": 41,
            "sp_def": 90,
            "speed": 81
          },
          {
            "name": "ベトベトン",
            "moves": [
              "ヘドロばくだん",
              "ほのおのパンチ",
              "どくどく",
              "かなしばり"
            ],
            "abilities": [
              "あくしゅう",
              "ねんちゃく",
              "どくしゅ"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% かたくなる",
              "体力60% 弱体解除"
            ],
            "types": [
              "どく"
            ],
            "hp": 1788,
            "atk": 99,
            "def": 72,
            "sp_atk": 63,
            "sp_def": 95,
            "speed": 50
          },
          {
            "name": "ベラカス",
            "moves": [
              "むしのさざめき",
              "じんつうりき",
              "すなかけ",
              "むしのていこう"
            ],
            "abilities": [
              "シンクロ",
              "テレパシー"
            ],
            "actions": [
              "時間75% サイコフィールド",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "むし",
              "エスパー"
            ],
            "hp": 1464,
            "atk": 50,
            "def": 81,
            "sp_atk": 108,
            "sp_def": 95,
            "speed": 45
          },
          {
            "name": "ペルシアン",
            "moves": [
              "きりさく",
              "パワージェム",
              "いやなおと",
              "ちょうはつ"
            ],
            "abilities": [
              "じゅうなん",
              "テクニシャン",
              "きんちょうかん"
            ],
            "actions": [
              "時間50% 強化解除",
              "体力90% バークアウト",
              "体力40% 弱体解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1356,
            "atk": 68,
            "def": 59,
            "sp_atk": 63,
            "sp_def": 63,
            "speed": 108
          },
          {
            "name": "ポットデス",
            "moves": [
              "シャドーボール",
              "メガドレイン",
              "おどろかす",
              "おにび"
            ],
            "abilities": [
              "くだけるよろい",
              "のろわれボディ"
            ],
            "actions": [
              "時間40% 弱体解除",
              "体力75% からにこもる",
              "体力35% からをやぶる"
            ],
            "types": [
              "ゴースト"
            ],
            "hp": 1308,
            "atk": 63,
            "def": 63,
            "sp_atk": 125,
            "sp_def": 107,
            "speed": 68
          },
          {
            "name": "ママンボウ",
            "moves": [
              "みずのはどう",
              "アクアジェット",
              "しおみず",
              "しろいきり"
            ],
            "abilities": [
              "いやしのこころ",
              "うるおいボディ",
              "さいせいりょく"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% あまごい"
            ],
            "types": [
              "みず"
            ],
            "hp": 2436,
            "atk": 72,
            "def": 77,
            "sp_atk": 41,
            "sp_def": 45,
            "speed": 63
          },
          {
            "name": "マリルリ",
            "moves": [
              "アクアテール",
              "れいとうパンチ",
              "すてみタックル",
              "アンコール"
            ],
            "abilities": [
              "あついしぼう",
              "ちからもち",
              "そうしょく"
            ],
            "actions": [
              "時間75% あまごい",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "みず",
              "フェアリー"
            ],
            "hp": 1740,
            "atk": 50,
            "def": 77,
            "sp_atk": 59,
            "sp_def": 77,
            "speed": 50
          },
          {
            "name": "マルノーム",
            "moves": [
              "ヘドロばくだん",
              "あくび",
              "アンコール",
              "のしかかり"
            ],
            "abilities": [
              "ヘドロえき",
              "ねんちゃく",
              "くいしんぼう"
            ],
            "actions": [
              "時間90% たくわえる",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "どく"
            ],
            "hp": 1740,
            "atk": 70,
            "def": 79,
            "sp_atk": 70,
            "sp_def": 79,
            "speed": 54
          },
          {
            "name": "マルマイン",
            "moves": [
              "ほうでん",
              "スピードスター",
              "イカサマ",
              "でんじふゆう"
            ],
            "abilities": [
              "ぼうおん",
              "せいでんき",
              "ゆうばく"
            ],
            "actions": [
              "時間80% ひかりのかべ",
              "時間40% 強化解除",
              "体力60% 弱体解除"
            ],
            "types": [
              "でんき"
            ],
            "hp": 1308,
            "atk": 50,
            "def": 68,
            "sp_atk": 77,
            "sp_def": 77,
            "speed": 140
          },
          {
            "name": "ミガルーサ",
            "moves": [
              "アクアカッター",
              "サイコカッター",
              "きりさく",
              "アクアジェット"
            ],
            "abilities": [
              "かたやぶり",
              "きれあじ"
            ],
            "actions": [
              "時間75% 弱体解除",
              "体力35% みをけずる",
              "体力30% 弱体解除"
            ],
            "types": [
              "みず",
              "エスパー"
            ],
            "hp": 1632,
            "atk": 96,
            "def": 70,
            "sp_atk": 75,
            "sp_def": 63,
            "speed": 68
          },
          {
            "name": "メタモン",
            "moves": [
              "へんしん"
            ],
            "abilities": [
              "じゅうなん",
              "かわりもの"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力90% 弱体解除",
              "体力75% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1176,
            "atk": 48,
            "def": 48,
            "sp_atk": 48,
            "sp_def": 48,
            "speed": 48
          },
          {
            "name": "メブキジカ",
            "moves": [
              "エナジーボール",
              "すてみタックル",
              "にどげり",
              "あまえる"
            ],
            "abilities": [
              "ようりょくそ",
              "そうしょく",
              "てんのめぐみ"
            ],
            "actions": [
              "時間80% にほんばれ",
              "体力75% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "ノーマル",
              "くさ"
            ],
            "hp": 1524,
            "atk": 95,
            "def": 68,
            "sp_atk": 59,
            "sp_def": 68,
            "speed": 90
          },
          {
            "name": "モスノウ",
            "moves": [
              "むしのさざめき",
              "しびれごな",
              "しろいきり",
              "オーロラビーム"
            ],
            "abilities": [
              "りんぷん",
              "こおりのりんぷん"
            ],
            "actions": [
              "時間90% ゆきげしき",
              "体力75% 弱体解除",
              "体力50% ちょうのまい"
            ],
            "types": [
              "こおり",
              "むし"
            ],
            "hp": 1416,
            "atk": 63,
            "def": 59,
            "sp_atk": 117,
            "sp_def": 86,
            "speed": 63
          },
          {
            "name": "モトトカゲ",
            "moves": [
              "ドラゴンクロー",
              "りゅうのはどう",
              "すてみタックル",
              "でんこうせっか"
            ],
            "abilities": [
              "だっぴ",
              "さいせいりょく"
            ],
            "actions": [
              "時間40% 強化解除",
              "時間40% ギアチェンジ",
              "体力75% 弱体解除"
            ],
            "types": [
              "ドラゴン",
              "ノーマル"
            ],
            "hp": 1416,
            "atk": 90,
            "def": 63,
            "sp_atk": 81,
            "sp_def": 63,
            "speed": 113
          },
          {
            "name": "ヤルキモノ",
            "moves": [
              "からげんき",
              "きりさく",
              "シャドークロー",
              "きあいだめ"
            ],
            "abilities": [
              "やるき"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力75% あくび"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1524,
            "atk": 77,
            "def": 77,
            "sp_atk": 54,
            "sp_def": 54,
            "speed": 86
          },
          {
            "name": "ライチュウ",
            "moves": [
              "ほうでん",
              "アイアンテール",
              "あまえる",
              "ほっぺすりすり"
            ],
            "abilities": [
              "せいでんき",
              "ひらいしん"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% 弱体解除",
              "体力25% わるだくみ"
            ],
            "types": [
              "でんき"
            ],
            "hp": 1308,
            "atk": 86,
            "def": 54,
            "sp_atk": 86,
            "sp_def": 77,
            "speed": 104
          },
          {
            "name": "ラランテス",
            "moves": [
              "リーフブレード",
              "シザークロス",
              "こわいかお",
              "きりさく"
            ],
            "abilities": [
              "リーフガード",
              "あまのじゃく"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% せいちょう"
            ],
            "types": [
              "くさ"
            ],
            "hp": 1416,
            "atk": 99,
            "def": 86,
            "sp_atk": 77,
            "sp_def": 86,
            "speed": 45
          },
          {
            "name": "リキキリン",
            "moves": [
              "ツインビーム",
              "ふみつけ",
              "でんじは",
              "サイコキネシス"
            ],
            "abilities": [
              "はんすう",
              "テイルアーマー",
              "そうしょく"
            ],
            "actions": [
              "時間75% めいそう",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "ノーマル",
              "エスパー"
            ],
            "hp": 1956,
            "atk": 86,
            "def": 68,
            "sp_atk": 104,
            "sp_def": 68,
            "speed": 59
          },
          {
            "name": "リククラゲ",
            "moves": [
              "だいちのちから",
              "タネばくだん",
              "しびれごな",
              "イカサマ"
            ],
            "abilities": [
              "きんしのちから"
            ],
            "actions": [
              "時間75% 弱体解除",
              "時間40% 強化解除",
              "体力75% せいちょう"
            ],
            "types": [
              "じめん",
              "くさ"
            ],
            "hp": 1524,
            "atk": 68,
            "def": 63,
            "sp_atk": 77,
            "sp_def": 113,
            "speed": 95
          },
          {
            "name": "リングマ",
            "moves": [
              "からげんき",
              "きりさく",
              "じゃれつく",
              "にらみつける"
            ],
            "abilities": [
              "こんじょう",
              "はやあし",
              "きんちょうかん"
            ],
            "actions": [
              "時間90% くさわけ",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1632,
            "atk": 122,
            "def": 72,
            "sp_atk": 72,
            "sp_def": 72,
            "speed": 54
          },
          {
            "name": "ルガルガン",
            "moves": [
              "いわなだれ",
              "かみくだく",
              "カウンター",
              "がむしゃら"
            ],
            "abilities": [
              "するどいめ",
              "すなかき",
              "ふくつのこころ"
            ],
            "actions": [
              "時間90% すなあらし",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "いわ"
            ],
            "hp": 1464,
            "atk": 108,
            "def": 63,
            "sp_atk": 54,
            "sp_def": 63,
            "speed": 105
          },
          {
            "name": "ルガルガン",
            "moves": [
              "いわなだれ",
              "かみくだく",
              "アクセルロック",
              "ちょうはつ"
            ],
            "abilities": [
              "するどいめ",
              "すなかき",
              "ふくつのこころ"
            ],
            "actions": [
              "時間90% すなあらし",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "ルチャブル",
            "moves": [
              "かわらわり",
              "フライングプレス",
              "ちょうはつ",
              "フェザーダンス"
            ],
            "abilities": [
              "じゅうなん",
              "かるわざ",
              "かたやぶり"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力40% つるぎのまい"
            ],
            "types": [
              "かくとう",
              "ひこう"
            ],
            "hp": 1500,
            "atk": 87,
            "def": 72,
            "sp_atk": 71,
            "sp_def": 61,
            "speed": 111
          },
          {
            "name": "レアコイル",
            "moves": [
              "ほうでん",
              "ラスターカノン",
              "きんぞくおん",
              "でんじは"
            ],
            "abilities": [
              "じりょく",
              "がんじょう",
              "アナライズ"
            ],
            "actions": [
              "時間75% エレキフィールド",
              "時間40% 強化解除",
              "体力75% 弱体解除"
            ],
            "types": [
              "でんき",
              "はがね"
            ],
            "hp": 1200,
            "atk": 59,
            "def": 90,
            "sp_atk": 113,
            "sp_def": 68,
            "speed": 68
          },
          {
            "name": "ロトム",
            "moves": [
              "ほうでん",
              "シャドーボール",
              "さわぐ",
              "でんじは"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力45% わるだくみ"
            ],
            "types": [
              "でんき",
              "ゴースト"
            ],
            "hp": 1200,
            "atk": 50,
            "def": 74,
            "sp_atk": 90,
            "sp_def": 74,
            "speed": 86
          },
          {
            "name": "ワルビル",
            "moves": [
              "かみくだく",
              "じしん",
              "いちゃもん",
              "いばる"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう",
              "いかりのつぼ"
            ],
            "actions": [
              "時間40% 強化解除",
              "体力75% 弱体解除",
              "体力75% いやなおと"
            ],
            "types": [
              "じめん",
              "あく"
            ],
            "hp": 1308,
            "atk": 78,
            "def": 45,
            "sp_atk": 45,
            "sp_def": 45,
            "speed": 71
          }
        ],
        "5": [
          {
            "name": "アップリュー",
            "moves": [
              "Ｇのちから",
              "りゅうのいぶき",
              "ドラゴンダイブ",
              "くさわけ"
            ],
            "abilities": [
              "じゅくせい",
              "くいしんぼう",
              "はりきり"
            ],
            "actions": [
              "時間85% グラスフィールド",
              "体力75% てっぺき",
              "体力50% 弱体解除",
              "体力40% りゅうのまい",
              "体力20% 強化解除"
            ],
            "types": [
              "くさ",
              "ドラゴン"
            ],
            "hp": 3800,
            "atk": 170,
            "def": 125,
            "sp_atk": 147,
            "sp_def": 95,
            "speed": 110
          },
          {
            "name": "アノホラグサ",
            "moves": [
              "ギガドレイン",
              "シャドーボール",
              "パワーウィップ",
              "まとわりつく"
            ],
            "abilities": [
              "かぜのり",
              "すりぬけ"
            ],
            "actions": [
              "時間80% グラスフィールド",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力20% グラスフィールド"
            ],
            "types": [
              "くさ",
              "ゴースト"
            ],
            "hp": 3340,
            "atk": 177,
            "def": 110,
            "sp_atk": 125,
            "sp_def": 110,
            "speed": 140
          },
          {
            "name": "アマージョ",
            "moves": [
              "とびひざげり",
              "パワーウィップ",
              "ふみつけ",
              "トロピカルキック"
            ],
            "abilities": [
              "リーフガード",
              "じょおうのいげん",
              "スイートベール"
            ],
            "actions": [
              "時間85% リフレクター",
              "体力75% グラスフィールド",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% グラスフィールド"
            ],
            "types": [
              "くさ"
            ],
            "hp": 3860,
            "atk": 185,
            "def": 152,
            "sp_atk": 80,
            "sp_def": 152,
            "speed": 113
          },
          {
            "name": "アーマーガア",
            "moves": [
              "はがねのつばさ",
              "ドリルくちばし",
              "ちょうはつ",
              "ボディプレス"
            ],
            "abilities": [
              "プレッシャー",
              "きんちょうかん",
              "ミラーアーマー"
            ],
            "actions": [
              "時間85% 弱体解除",
              "体力75% てっぺき",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% つめとぎ"
            ],
            "types": [
              "ひこう",
              "はがね"
            ],
            "hp": 4640,
            "atk": 135,
            "def": 162,
            "sp_atk": 84,
            "sp_def": 132,
            "speed": 105
          },
          {
            "name": "イエッサン",
            "moves": [
              "サイコキネシス",
              "ハイパーボイス",
              "シャドーボール",
              "トリックルーム"
            ],
            "abilities": [
              "せいしんりょく",
              "シンクロ",
              "サイコメイカー"
            ],
            "actions": [
              "時間80% なかよくする",
              "体力75% めいそう",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% めいそう"
            ],
            "types": [
              "エスパー",
              "ノーマル"
            ],
            "hp": 3500,
            "atk": 102,
            "def": 87,
            "sp_atk": 162,
            "sp_def": 147,
            "speed": 147
          },
          {
            "name": "イエッサン",
            "moves": [
              "サイコキネシス",
              "ハイパーボイス",
              "シャドーボール",
              "トリックルーム"
            ],
            "abilities": [
              "せいしんりょく",
              "シンクロ",
              "サイコメイカー"
            ],
            "actions": [
              "時間80% なかよくする",
              "体力75% めいそう",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% めいそう"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "イルカマン",
            "moves": [
              "アクアブレイク",
              "アクロバット",
              "あまえる",
              "ばくおんぱ"
            ],
            "abilities": [
              "マイティチェンジ"
            ],
            "actions": [
              "時間85% テラ回収",
              "体力85% あまごい",
              "体力50% 弱体解除",
              "体力40% ビルドアップ",
              "体力20% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 4700,
            "atk": 110,
            "def": 113,
            "sp_atk": 84,
            "sp_def": 98,
            "speed": 155
          },
          {
            "name": "イーブイ",
            "moves": [
              "テラバースト",
              "とっしん",
              "シャドーボール",
              "くすぐる"
            ],
            "abilities": [
              "にげあし",
              "てきおうりょく",
              "きけんよち"
            ],
            "actions": [
              "時間85% あくび",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力25% めいそう"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 3340,
            "atk": 87,
            "def": 80,
            "sp_atk": 72,
            "sp_def": 102,
            "speed": 87
          },
          {
            "name": "ウインディ",
            "moves": [
              "かえんほうしゃ",
              "かみくだく",
              "しんそく",
              "ほのおのキバ"
            ],
            "abilities": [
              "いかく",
              "もらいび",
              "せいぎのこころ"
            ],
            "actions": [
              "時間85% にほんばれ",
              "体力75% にらみつける",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力35% にほんばれ"
            ],
            "types": [
              "ほのお"
            ],
            "hp": 4400,
            "atk": 170,
            "def": 125,
            "sp_atk": 155,
            "sp_def": 125,
            "speed": 147
          },
          {
            "name": "ウォーグル",
            "moves": [
              "アクロバット",
              "ブレイククロー",
              "ばかぢから",
              "エアスラッシュ"
            ],
            "abilities": [
              "するどいめ",
              "ちからずく",
              "まけんき"
            ],
            "actions": [
              "時間85% おいかぜ",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% つめとぎ",
              "体力25% 弱体解除"
            ],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 4700,
            "atk": 189,
            "def": 117,
            "sp_atk": 90,
            "sp_def": 117,
            "speed": 125
          },
          {
            "name": "ウルガモス",
            "moves": [
              "だいもんじ",
              "むしのさざめき",
              "ぼうふう",
              "おにび"
            ],
            "abilities": [
              "ほのおのからだ",
              "むしのしらせ"
            ],
            "actions": [
              "時間85% にほんばれ",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% ちょうのまい",
              "体力20% ちょうのまい"
            ],
            "types": [
              "むし",
              "ほのお"
            ],
            "hp": 4240,
            "atk": 95,
            "def": 102,
            "sp_atk": 207,
            "sp_def": 162,
            "speed": 155
          },
          {
            "name": "エルレイド",
            "moves": [
              "サイコカッター",
              "かわらわり",
              "かげうち",
              "れんぞくぎり"
            ],
            "abilities": [
              "ふくつのこころ",
              "きれあじ",
              "せいぎのこころ"
            ],
            "actions": [
              "時間85% さいみんじゅつ",
              "体力75% かなしばり",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力25% サイコフィールド"
            ],
            "types": [
              "エスパー",
              "かくとう"
            ],
            "hp": 3740,
            "atk": 192,
            "def": 102,
            "sp_atk": 102,
            "sp_def": 177,
            "speed": 125
          },
          {
            "name": "オトシドリ",
            "moves": [
              "いわなだれ",
              "ふいうち",
              "ブレイブバード",
              "いちゃもん"
            ],
            "abilities": [
              "はとむね",
              "するどいめ",
              "いわはこび"
            ],
            "actions": [
              "時間80% はたきおとす",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力30% フェザーダンス"
            ],
            "types": [
              "ひこう",
              "あく"
            ],
            "hp": 3800,
            "atk": 159,
            "def": 132,
            "sp_atk": 95,
            "sp_def": 132,
            "speed": 128
          },
          {
            "name": "オニゴーリ",
            "moves": [
              "フリーズドライ",
              "かみくだく",
              "ずつき",
              "こおりのいぶき"
            ],
            "abilities": [
              "せいしんりょく",
              "アイスボディ",
              "ムラっけ"
            ],
            "actions": [
              "時間85% ゆきげしき",
              "体力85% ゆきげしき",
              "体力75% かなしばり",
              "体力50% 弱体解除",
              "体力50% テラ回収"
            ],
            "types": [
              "こおり"
            ],
            "hp": 4100,
            "atk": 125,
            "def": 125,
            "sp_atk": 125,
            "sp_def": 125,
            "speed": 125
          },
          {
            "name": "オノノクス",
            "moves": [
              "ドラゴンクロー",
              "かみくだく",
              "ギガインパクト",
              "であいがしら"
            ],
            "abilities": [
              "とうそうしん",
              "かたやぶり",
              "きんちょうかん"
            ],
            "actions": [
              "時間85% かたくなる",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力40% りゅうのまい",
              "体力25% 強化解除"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 3980,
            "atk": 225,
            "def": 140,
            "sp_atk": 95,
            "sp_def": 110,
            "speed": 150
          },
          {
            "name": "オリーヴァ",
            "moves": [
              "エナジーボール",
              "ハイパーボイス",
              "だいちのちから",
              "あまえる"
            ],
            "abilities": [
              "こぼれダネ",
              "しゅうかく"
            ],
            "actions": [
              "時間85% にほんばれ",
              "体力75% せいちょう",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力20% リーフストーム"
            ],
            "types": [
              "くさ",
              "ノーマル"
            ],
            "hp": 4040,
            "atk": 108,
            "def": 140,
            "sp_atk": 192,
            "sp_def": 168,
            "speed": 63
          },
          {
            "name": "オンバーン",
            "moves": [
              "エアスラッシュ",
              "りゅうのはどう",
              "アクロバット",
              "ばくおんぱ"
            ],
            "abilities": [
              "おみとおし",
              "すりぬけ",
              "テレパシー"
            ],
            "actions": [
              "時間85% おいかぜ",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力45% おいかぜ",
              "体力25% 弱体解除"
            ],
            "types": [
              "ひこう",
              "ドラゴン"
            ],
            "hp": 4240,
            "atk": 110,
            "def": 125,
            "sp_atk": 150,
            "sp_def": 125,
            "speed": 189
          },
          {
            "name": "オーロンゲ",
            "moves": [
              "ソウルクラッシュ",
              "どげざつき",
              "こわいかお",
              "イカサマ"
            ],
            "abilities": [
              "いたずらごころ",
              "おみとおし",
              "わるいてぐせ"
            ],
            "actions": [
              "時間80% ひかりのかべ",
              "体力50% 弱体解除",
              "体力40% ビルドアップ",
              "体力20% 強化解除"
            ],
            "types": [
              "あく",
              "フェアリー"
            ],
            "hp": 4540,
            "atk": 185,
            "def": 102,
            "sp_atk": 147,
            "sp_def": 117,
            "speed": 95
          },
          {
            "name": "カイリュー",
            "moves": [
              "ドラゴンダイブ",
              "つばめがえし",
              "しんそく",
              "ぼうふう"
            ],
            "abilities": [
              "せいしんりょく",
              "マルチスケイル"
            ],
            "actions": [
              "時間85% しんぴのまもり",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% りゅうのまい",
              "体力35% あまごい"
            ],
            "types": [
              "ドラゴン",
              "ひこう"
            ],
            "hp": 4420,
            "atk": 206,
            "def": 147,
            "sp_atk": 155,
            "sp_def": 155,
            "speed": 125
          },
          {
            "name": "カバルドン",
            "moves": [
              "じしん",
              "あくび",
              "いわなだれ",
              "のしかかり"
            ],
            "abilities": [
              "すなおこし",
              "すなのちから"
            ],
            "actions": [
              "時間85% あくび",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% たくわえる"
            ],
            "types": [
              "じめん"
            ],
            "hp": 4940,
            "atk": 173,
            "def": 182,
            "sp_atk": 107,
            "sp_def": 113,
            "speed": 75
          },
          {
            "name": "ガブリアス",
            "moves": [
              "じしん",
              "ドラゴンクロー",
              "アイアンヘッド",
              "きりさく"
            ],
            "abilities": [
              "すながくれ",
              "さめはだ"
            ],
            "actions": [
              "時間85% すなあらし",
              "体力75% じならし",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力35% すなあらし"
            ],
            "types": [
              "ドラゴン",
              "じめん"
            ],
            "hp": 4940,
            "atk": 200,
            "def": 147,
            "sp_atk": 125,
            "sp_def": 132,
            "speed": 158
          },
          {
            "name": "キノガッサ",
            "moves": [
              "タネばくだん",
              "マッハパンチ",
              "なやみのタネ",
              "ずつき"
            ],
            "abilities": [
              "ほうし",
              "ポイズンヒール",
              "テクニシャン"
            ],
            "actions": [
              "時間80% グラスフィールド",
              "体力75% キノコのほうし",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [
              "くさ",
              "かくとう"
            ],
            "hp": 3500,
            "atk": 200,
            "def": 125,
            "sp_atk": 95,
            "sp_def": 95,
            "speed": 110
          },
          {
            "name": "キョジオーン",
            "moves": [
              "しおづけ",
              "いわなだれ",
              "アームハンマー",
              "すなあらし"
            ],
            "abilities": [
              "きよめのしお",
              "がんじょう",
              "クリアボディ"
            ],
            "actions": [
              "時間80% すなあらし",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力20% いわなだれ"
            ],
            "types": [
              "いわ"
            ],
            "hp": 4700,
            "atk": 155,
            "def": 200,
            "sp_atk": 72,
            "sp_def": 140,
            "speed": 57
          },
          {
            "name": "キラフロル",
            "moves": [
              "パワージェム",
              "ヘドロばくだん",
              "キラースピン",
              "げんしのちから"
            ],
            "abilities": [
              "どくげしょう",
              "ふしょく"
            ],
            "actions": [
              "時間80% すなあらし",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% テラバースト"
            ],
            "types": [
              "いわ",
              "どく"
            ],
            "hp": 4180,
            "atk": 87,
            "def": 140,
            "sp_atk": 200,
            "sp_def": 126,
            "speed": 134
          },
          {
            "name": "ギャラドス",
            "moves": [
              "アクアテール",
              "たつまき",
              "ぼうふう",
              "かみくだく"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう"
            ],
            "actions": [
              "時間85% こわいかお",
              "体力75% ちょうはつ",
              "体力50% 弱体解除",
              "体力45% りゅうのまい",
              "体力35% あまごい"
            ],
            "types": [
              "みず",
              "ひこう"
            ],
            "hp": 4540,
            "atk": 192,
            "def": 123,
            "sp_atk": 95,
            "sp_def": 155,
            "speed": 126
          },
          {
            "name": "クレベース",
            "moves": [
              "つららおとし",
              "すてみタックル",
              "かみくだく",
              "こおりのキバ"
            ],
            "abilities": [
              "マイペース",
              "アイスボディ",
              "がんじょう"
            ],
            "actions": [
              "時間85% ゆきげしき",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力45% ゆきげしき",
              "体力30% てっぺき"
            ],
            "types": [
              "こおり"
            ],
            "hp": 4540,
            "atk": 180,
            "def": 281,
            "sp_atk": 71,
            "sp_def": 74,
            "speed": 47
          },
          {
            "name": "グレンアルマ",
            "moves": [
              "アーマーキャノン",
              "サイコキネシス",
              "ナイトヘッド",
              "おにび"
            ],
            "abilities": [
              "もらいび",
              "くだけるよろい"
            ],
            "actions": [
              "時間80% 弱体解除",
              "体力75% にほんばれ",
              "体力50% 弱体解除",
              "体力40% めいそう",
              "体力25% 強化解除"
            ],
            "types": [
              "ほのお",
              "エスパー"
            ],
            "hp": 4240,
            "atk": 95,
            "def": 155,
            "sp_atk": 192,
            "sp_def": 125,
            "speed": 117
          },
          {
            "name": "ケッキング",
            "moves": [
              "からげんき",
              "シャドークロー",
              "じゃれつく",
              "いばる"
            ],
            "abilities": [
              "なまけ"
            ],
            "actions": [
              "時間85% アンコール",
              "体力75% 弱体解除",
              "体力50% 弱体解除",
              "体力50% テラ回収"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 6200,
            "atk": 245,
            "def": 155,
            "sp_atk": 147,
            "sp_def": 102,
            "speed": 155
          },
          {
            "name": "ケンタロス",
            "moves": [
              "フレアドライブ",
              "インファイト",
              "かえんほうしゃ",
              "ずつき"
            ],
            "abilities": [
              "いかく",
              "いかりのつぼ",
              "はんすう"
            ],
            "actions": [
              "時間80% ふるいたてる",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% にほんばれ",
              "体力25% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 3940,
            "atk": 155,
            "def": 147,
            "sp_atk": 65,
            "sp_def": 110,
            "speed": 170
          },
          {
            "name": "ケンタロス",
            "moves": [
              "ウェーブタックル",
              "インファイト",
              "なみのり",
              "ずつき"
            ],
            "abilities": [
              "いかく",
              "いかりのつぼ",
              "はんすう"
            ],
            "actions": [
              "時間80% ふるいたてる",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% あまごい",
              "体力25% 強化解除"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "ゲンガー",
            "moves": [
              "シャドーボール",
              "ヘドロばくだん",
              "あやしいひかり",
              "うらみ"
            ],
            "abilities": [
              "のろわれボディ"
            ],
            "actions": [
              "時間85% さいみんじゅつ",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力25% さいみんじゅつ"
            ],
            "types": [
              "ゴースト",
              "どく"
            ],
            "hp": 3500,
            "atk": 102,
            "def": 95,
            "sp_atk": 200,
            "sp_def": 117,
            "speed": 170
          },
          {
            "name": "コノヨザル",
            "moves": [
              "シャドークロー",
              "インファイト",
              "げきりん",
              "にらみつける"
            ],
            "abilities": [
              "やるき",
              "せいしんりょく",
              "まけんき"
            ],
            "actions": [
              "時間80% ちょうはつ",
              "体力75% 弱体解除",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力35% ビルドアップ"
            ],
            "types": [
              "かくとう",
              "ゴースト"
            ],
            "hp": 5000,
            "atk": 177,
            "def": 125,
            "sp_atk": 80,
            "sp_def": 140,
            "speed": 140
          },
          {
            "name": "ゴチルゼル",
            "moves": [
              "サイコキネシス",
              "でんじは",
              "１０まんボルト",
              "アシストパワー"
            ],
            "abilities": [
              "おみとおし",
              "かちき",
              "かげふみ"
            ],
            "actions": [
              "時間85% めいそう",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力40% めいそう",
              "体力25% ひかりのかべ"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 3800,
            "atk": 87,
            "def": 147,
            "sp_atk": 147,
            "sp_def": 170,
            "speed": 102
          },
          {
            "name": "サザンドラ",
            "moves": [
              "あくのはどう",
              "りゅうのはどう",
              "こわいかお",
              "ドラゴンダイブ"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間85% ちょうはつ",
              "体力75% リフレクター",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力30% わるだくみ"
            ],
            "types": [
              "あく",
              "ドラゴン"
            ],
            "hp": 4460,
            "atk": 162,
            "def": 140,
            "sp_atk": 192,
            "sp_def": 140,
            "speed": 152
          },
          {
            "name": "サーナイト",
            "moves": [
              "サイコキネシス",
              "ムーンフォース",
              "かなしばり",
              "ドレインキッス"
            ],
            "abilities": [
              "シンクロ",
              "トレース",
              "テレパシー"
            ],
            "actions": [
              "時間85% ミストフィールド",
              "体力75% めいそう",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力35% サイコフィールド"
            ],
            "types": [
              "エスパー",
              "フェアリー"
            ],
            "hp": 3740,
            "atk": 102,
            "def": 102,
            "sp_atk": 192,
            "sp_def": 177,
            "speed": 125
          },
          {
            "name": "シビルドン",
            "moves": [
              "ワイルドボルト",
              "かえんほうしゃ",
              "ほうでん",
              "ブレイククロー"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間85% プラズマシャワー",
              "体力75% でんじは",
              "体力75% でんじは",
              "体力50% 弱体解除",
              "体力25% とぐろをまく"
            ],
            "types": [
              "でんき"
            ],
            "hp": 4240,
            "atk": 177,
            "def": 125,
            "sp_atk": 162,
            "sp_def": 125,
            "speed": 80
          },
          {
            "name": "シャリタツ",
            "moves": [
              "みずのはどう",
              "りゅうのはどう",
              "こうそくスピン",
              "カウンター"
            ],
            "abilities": [
              "しれいとう",
              "よびみず"
            ],
            "actions": [
              "時間80% テラ回収",
              "体力75% ひやみず",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [
              "ドラゴン",
              "みず"
            ],
            "hp": 3740,
            "atk": 80,
            "def": 95,
            "sp_atk": 185,
            "sp_def": 147,
            "speed": 128
          },
          {
            "name": "シャリタツ",
            "moves": [
              "みずのはどう",
              "りゅうのはどう",
              "こうそくスピン",
              "カウンター"
            ],
            "abilities": [
              "しれいとう",
              "よびみず"
            ],
            "actions": [
              "時間80% テラ回収",
              "体力75% ひやみず",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "シャリタツ",
            "moves": [
              "みずのはどう",
              "りゅうのはどう",
              "こうそくスピン",
              "カウンター"
            ],
            "abilities": [
              "しれいとう",
              "よびみず"
            ],
            "actions": [
              "時間80% テラ回収",
              "体力75% ひやみず",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "ジバコイル",
            "moves": [
              "１０まんボルト",
              "ラスターカノン",
              "トライアタック",
              "でんじは"
            ],
            "abilities": [
              "じりょく",
              "がんじょう",
              "アナライズ"
            ],
            "actions": [
              "時間85% でんじふゆう",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% エレキフィールド",
              "体力25% 強化解除"
            ],
            "types": [
              "でんき",
              "はがね"
            ],
            "hp": 3800,
            "atk": 110,
            "def": 177,
            "sp_atk": 200,
            "sp_def": 140,
            "speed": 95
          },
          {
            "name": "ストライク",
            "moves": [
              "つばめがえし",
              "シザークロス",
              "きりさく",
              "こうそくいどう"
            ],
            "abilities": [
              "むしのしらせ",
              "テクニシャン",
              "ふくつのこころ"
            ],
            "actions": [
              "時間85% きあいだめ",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力45% つるぎのまい"
            ],
            "types": [
              "むし",
              "ひこう"
            ],
            "hp": 3800,
            "atk": 170,
            "def": 125,
            "sp_atk": 87,
            "sp_def": 125,
            "speed": 162
          },
          {
            "name": "ストリンダー",
            "moves": [
              "オーバードライブ",
              "どくづき",
              "ほっぺすりすり",
              "ばくおんぱ"
            ],
            "abilities": [
              "パンクロック",
              "プラス",
              "テクニシャン"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% エレキフィールド"
            ],
            "types": [
              "でんき",
              "どく"
            ],
            "hp": 3940,
            "atk": 152,
            "def": 110,
            "sp_atk": 176,
            "sp_def": 110,
            "speed": 117
          },
          {
            "name": "ストリンダー",
            "moves": [
              "オーバードライブ",
              "どくづき",
              "ほっぺすりすり",
              "ばくおんぱ"
            ],
            "abilities": [
              "パンクロック",
              "プラス",
              "テクニシャン"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% エレキフィールド"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "セキタンザン",
            "moves": [
              "ヒートスタンプ",
              "ストーンエッジ",
              "やきつくす",
              "げんしのちから"
            ],
            "abilities": [
              "じょうききかん",
              "ほのおのからだ",
              "もらいび"
            ],
            "actions": [
              "時間80% すなあらし",
              "体力75% タールショット",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力20% だいもんじ"
            ],
            "types": [
              "いわ",
              "ほのお"
            ],
            "hp": 5000,
            "atk": 125,
            "def": 185,
            "sp_atk": 125,
            "sp_def": 140,
            "speed": 50
          },
          {
            "name": "セグレイブ",
            "moves": [
              "ドラゴンクロー",
              "つららおとし",
              "こおりのつぶて",
              "ボディプレス"
            ],
            "abilities": [
              "ねつこうかん",
              "アイスボディ"
            ],
            "actions": [
              "時間80% ゆきげしき",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% ゆきげしき",
              "体力20% 強化解除"
            ],
            "types": [
              "ドラゴン",
              "こおり"
            ],
            "hp": 5140,
            "atk": 222,
            "def": 143,
            "sp_atk": 117,
            "sp_def": 134,
            "speed": 135
          },
          {
            "name": "ソウブレイズ",
            "moves": [
              "むねんのつるぎ",
              "シャドークロー",
              "サイコカッター",
              "おにび"
            ],
            "abilities": [
              "もらいび",
              "くだけるよろい"
            ],
            "actions": [
              "時間80% 弱体解除",
              "体力75% にほんばれ",
              "体力50% 弱体解除",
              "体力40% つるぎのまい",
              "体力25% 強化解除"
            ],
            "types": [
              "ほのお",
              "ゴースト"
            ],
            "hp": 3940,
            "atk": 192,
            "def": 125,
            "sp_atk": 95,
            "sp_def": 155,
            "speed": 132
          },
          {
            "name": "ゾロアーク",
            "moves": [
              "ナイトバースト",
              "シャドークロー",
              "ちょうはつ",
              "ハイパーボイス"
            ],
            "abilities": [
              "イリュージョン"
            ],
            "actions": [
              "時間85% いちゃもん",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力30% わるだくみ"
            ],
            "types": [
              "あく"
            ],
            "hp": 3500,
            "atk": 162,
            "def": 95,
            "sp_atk": 185,
            "sp_def": 95,
            "speed": 162
          },
          {
            "name": "タイレーツ",
            "moves": [
              "メガホーン",
              "きしかいせい",
              "ずつき",
              "かわらわり"
            ],
            "abilities": [
              "カブトアーマー",
              "まけんき"
            ],
            "actions": [
              "体力50% 弱体解除",
              "体力40% はいすいのじん",
              "体力20% 強化解除"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 3640,
            "atk": 155,
            "def": 155,
            "sp_atk": 110,
            "sp_def": 95,
            "speed": 117
          },
          {
            "name": "タルップル",
            "moves": [
              "りんごさん",
              "りゅうのはどう",
              "ギガドレイン",
              "ボディプレス"
            ],
            "abilities": [
              "じゅくせい",
              "くいしんぼう",
              "あついしぼう"
            ],
            "actions": [
              "時間85 行動3",
              "体力75% せいちょう",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [
              "くさ",
              "ドラゴン"
            ],
            "hp": 5000,
            "atk": 132,
            "def": 125,
            "sp_atk": 155,
            "sp_def": 125,
            "speed": 50
          },
          {
            "name": "ダイオウドウ",
            "moves": [
              "ヘビーボンバー",
              "かいりき",
              "のろい",
              "１０まんばりき"
            ],
            "abilities": [
              "ちからずく",
              "ヘヴィメタル"
            ],
            "actions": [
              "時間80% すなあらし",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力30% てっぺき"
            ],
            "types": [
              "はがね"
            ],
            "hp": 5360,
            "atk": 200,
            "def": 108,
            "sp_atk": 125,
            "sp_def": 108,
            "speed": 50
          },
          {
            "name": "チルタリス",
            "moves": [
              "りゅうのはどう",
              "ぼうふう",
              "うたう",
              "しろいきり"
            ],
            "abilities": [
              "しぜんかいふく",
              "ノーてんき"
            ],
            "actions": [
              "時間85% しんぴのまもり",
              "体力75 行動3",
              "体力50% 弱体解除",
              "体力45% コットンガード",
              "体力25% うたう"
            ],
            "types": [
              "ドラゴン",
              "ひこう"
            ],
            "hp": 3940,
            "atk": 110,
            "def": 140,
            "sp_atk": 110,
            "sp_def": 162,
            "speed": 125
          },
          {
            "name": "デカヌチャン",
            "moves": [
              "デカハンマー",
              "じゃれつく",
              "ぶんまわす",
              "いわくだき"
            ],
            "abilities": [
              "かたやぶり",
              "マイペース",
              "わるいてぐせ"
            ],
            "actions": [
              "時間80% ミストフィールド",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% でんじは",
              "体力25% あまえる"
            ],
            "types": [
              "フェアリー",
              "はがね"
            ],
            "hp": 4240,
            "atk": 117,
            "def": 120,
            "sp_atk": 110,
            "sp_def": 162,
            "speed": 146
          },
          {
            "name": "デリバード",
            "moves": [
              "プレゼント",
              "ドリルくちばし",
              "れいとうパンチ",
              "ふぶき"
            ],
            "abilities": [
              "やるき",
              "はりきり",
              "ふみん"
            ],
            "actions": [
              "時間85% ゆきげしき",
              "体力75% プレゼント",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力35% プレゼント"
            ],
            "types": [
              "こおり",
              "ひこう"
            ],
            "hp": 3040,
            "atk": 87,
            "def": 72,
            "sp_atk": 102,
            "sp_def": 72,
            "speed": 117
          },
          {
            "name": "ドドゲザン",
            "moves": [
              "アイアンヘッド",
              "つじぎり",
              "いちゃもん",
              "きりさく"
            ],
            "abilities": [
              "まけんき",
              "そうだいしょう",
              "プレッシャー"
            ],
            "actions": [
              "時間80% ちょうはつ",
              "時間15% メタルバースト",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力40% いちゃもん"
            ],
            "types": [
              "あく",
              "はがね"
            ],
            "hp": 4700,
            "atk": 207,
            "def": 185,
            "sp_atk": 95,
            "sp_def": 132,
            "speed": 80
          },
          {
            "name": "ドラパルト",
            "moves": [
              "シャドーボール",
              "ドラゴンアロー",
              "１０まんボルト",
              "たたりめ"
            ],
            "abilities": [
              "クリアボディ",
              "すりぬけ",
              "のろわれボディ"
            ],
            "actions": [
              "時間85% リフレクター",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力20% ひかりのかべ"
            ],
            "types": [
              "ドラゴン",
              "ゴースト"
            ],
            "hp": 4340,
            "atk": 185,
            "def": 117,
            "sp_atk": 155,
            "sp_def": 117,
            "speed": 218
          },
          {
            "name": "ドラミドロ",
            "moves": [
              "りゅうのはどう",
              "ヘドロばくだん",
              "みずのはどう",
              "どくどく"
            ],
            "abilities": [
              "どくのトゲ",
              "どくしゅ",
              "てきおうりょく"
            ],
            "actions": [
              "時間85% アシッドボム",
              "体力75% りゅうせいぐん",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力30% りゅうせいぐん"
            ],
            "types": [
              "どく",
              "ドラゴン"
            ],
            "hp": 3640,
            "atk": 117,
            "def": 140,
            "sp_atk": 150,
            "sp_def": 189,
            "speed": 71
          },
          {
            "name": "ドンカラス",
            "moves": [
              "つじぎり",
              "ぼうふう",
              "くろいきり",
              "つばさでうつ"
            ],
            "abilities": [
              "ふみん",
              "きょううん",
              "じしんかじょう"
            ],
            "actions": [
              "時間85% テラ回収",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力25% わるだくみ"
            ],
            "types": [
              "あく",
              "ひこう"
            ],
            "hp": 4700,
            "atk": 192,
            "def": 83,
            "sp_atk": 162,
            "sp_def": 83,
            "speed": 111
          },
          {
            "name": "ドータクン",
            "moves": [
              "ラスターカノン",
              "じんつうりき",
              "きんぞくおん",
              "しっぺがえし"
            ],
            "abilities": [
              "ふゆう",
              "たいねつ",
              "ヘヴィメタル"
            ],
            "actions": [
              "時間85% あまごい",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% めいそう",
              "体力25% リフレクター"
            ],
            "types": [
              "はがね",
              "エスパー"
            ],
            "hp": 3700,
            "atk": 138,
            "def": 179,
            "sp_atk": 123,
            "sp_def": 179,
            "speed": 54
          },
          {
            "name": "ナゲツケサル",
            "moves": [
              "きしかいせい",
              "いわくだき",
              "からげんき",
              "ダストシュート"
            ],
            "abilities": [
              "レシーバー",
              "まけんき"
            ],
            "actions": [
              "時間80% ちょうはつ",
              "体力75% くさわけ",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力35% ビルドアップ"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 4700,
            "atk": 185,
            "def": 140,
            "sp_atk": 65,
            "sp_def": 95,
            "speed": 125
          },
          {
            "name": "ヌメルゴン",
            "moves": [
              "みずのはどう",
              "りゅうのはどう",
              "ヘドロばくだん",
              "パワーウィップ"
            ],
            "abilities": [
              "そうしょく",
              "うるおいボディ",
              "ぬめぬめ"
            ],
            "actions": [
              "時間85% あまごい",
              "体力75% りゅうせいぐん",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力30% とける"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 4400,
            "atk": 155,
            "def": 110,
            "sp_atk": 170,
            "sp_def": 230,
            "speed": 125
          },
          {
            "name": "ハッサム",
            "moves": [
              "アイアンヘッド",
              "シザークロス",
              "バレットパンチ",
              "きりさく"
            ],
            "abilities": [
              "むしのしらせ",
              "テクニシャン",
              "ライトメタル"
            ],
            "actions": [
              "時間85% てっぺき",
              "体力75% きあいだめ",
              "体力50% 弱体解除",
              "体力45% 強化解除"
            ],
            "types": [
              "むし",
              "はがね"
            ],
            "hp": 3800,
            "atk": 200,
            "def": 155,
            "sp_atk": 87,
            "sp_def": 125,
            "speed": 102
          },
          {
            "name": "ハピナス",
            "moves": [
              "マジカルシャイン",
              "ハイパーボイス",
              "うたう",
              "ちきゅうなげ"
            ],
            "abilities": [
              "しぜんかいふく",
              "てんのめぐみ",
              "いやしのこころ"
            ],
            "actions": [
              "時間85% じゅうりょく",
              "体力75% 弱体解除",
              "体力50% 弱体解除",
              "体力25% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 9340,
            "atk": 20,
            "def": 20,
            "sp_atk": 117,
            "sp_def": 207,
            "speed": 87
          },
          {
            "name": "ハリテヤマ",
            "moves": [
              "きしかいせい",
              "かわらわり",
              "しおみず",
              "ヘビーボンバー"
            ],
            "abilities": [
              "あついしぼう",
              "こんじょう",
              "ちからずく"
            ],
            "actions": [
              "時間85% こわいかお",
              "体力75% ちょうはつ",
              "体力50% 弱体解除",
              "体力45% ビルドアップ",
              "体力30% 強化解除"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 6020,
            "atk": 185,
            "def": 95,
            "sp_atk": 65,
            "sp_def": 95,
            "speed": 80
          },
          {
            "name": "ハルクジラ",
            "moves": [
              "アイススピナー",
              "アクアブレイク",
              "あくび",
              "なかまづくり"
            ],
            "abilities": [
              "あついしぼう",
              "ゆきかき",
              "ちからずく"
            ],
            "actions": [
              "時間80% ゆきげしき",
              "体力75% あくび",
              "体力50% 弱体解除",
              "体力40% ゆきげしき",
              "体力20% 強化解除"
            ],
            "types": [
              "こおり"
            ],
            "hp": 6800,
            "atk": 174,
            "def": 102,
            "sp_atk": 72,
            "sp_def": 87,
            "speed": 114
          },
          {
            "name": "バクーダ",
            "moves": [
              "かえんほうしゃ",
              "だいちのちから",
              "あくび",
              "ふんか"
            ],
            "abilities": [
              "マグマのよろい",
              "ハードロック",
              "いかりのつぼ"
            ],
            "actions": [
              "時間85% にほんばれ",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力35% にほんばれ"
            ],
            "types": [
              "ほのお",
              "じめん"
            ],
            "hp": 3800,
            "atk": 155,
            "def": 110,
            "sp_atk": 162,
            "sp_def": 117,
            "speed": 65
          },
          {
            "name": "バチンウニ",
            "moves": [
              "びりびりちくちく",
              "かみなり",
              "なみのり",
              "どくづき"
            ],
            "abilities": [
              "ひらいしん",
              "エレキメイカー"
            ],
            "actions": [
              "時間80% あまごい",
              "体力50% 弱体解除",
              "体力40% 強化解除",
              "体力25% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 3140,
            "atk": 156,
            "def": 147,
            "sp_atk": 141,
            "sp_def": 132,
            "speed": 27
          },
          {
            "name": "バンギラス",
            "moves": [
              "いわなだれ",
              "かみくだく",
              "いやなおと",
              "あくのはどう"
            ],
            "abilities": [
              "すなおこし",
              "きんちょうかん"
            ],
            "actions": [
              "時間85% テラ回収",
              "体力75% 弱体解除",
              "体力50% 弱体解除",
              "体力45% りゅうのまい",
              "体力35% すなあらし"
            ],
            "types": [
              "いわ",
              "あく"
            ],
            "hp": 4700,
            "atk": 206,
            "def": 170,
            "sp_atk": 147,
            "sp_def": 155,
            "speed": 96
          },
          {
            "name": "バンバドロ",
            "moves": [
              "１０まんばりき",
              "ボディプレス",
              "いわくだき",
              "ヘビーボンバー"
            ],
            "abilities": [
              "マイペース",
              "じきゅうりょく",
              "せいしんりょく"
            ],
            "actions": [
              "時間80% こわいかお",
              "時間75% てっぺき",
              "体力50% 弱体解除",
              "体力40% 強化解除"
            ],
            "types": [
              "じめん"
            ],
            "hp": 4700,
            "atk": 192,
            "def": 155,
            "sp_atk": 87,
            "sp_def": 132,
            "speed": 57
          },
          {
            "name": "パルシェン",
            "moves": [
              "つららばり",
              "ハイドロポンプ",
              "こおりのつぶて",
              "ちょうおんぱ"
            ],
            "abilities": [
              "シェルアーマー",
              "スキルリンク",
              "ぼうじん"
            ],
            "actions": [
              "時間85% テラ回収",
              "体力50% 弱体解除",
              "体力35% からをやぶる",
              "体力30% 弱体解除"
            ],
            "types": [
              "みず",
              "こおり"
            ],
            "hp": 3200,
            "atk": 147,
            "def": 275,
            "sp_atk": 132,
            "sp_def": 72,
            "speed": 110
          },
          {
            "name": "パーモット",
            "moves": [
              "ワイルドボルト",
              "インファイト",
              "ほっぺすりすり",
              "てんしのキッス"
            ],
            "abilities": [
              "ちくでん",
              "しぜんかいふく",
              "てつのこぶし"
            ],
            "actions": [
              "時間80% ほっぺすりすり",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力40% エレキフィールド",
              "体力20% でんこうそうげき"
            ],
            "types": [
              "でんき",
              "かくとう"
            ],
            "hp": 3800,
            "atk": 177,
            "def": 110,
            "sp_atk": 110,
            "sp_def": 95,
            "speed": 162
          },
          {
            "name": "ファイアロー",
            "moves": [
              "アクロバット",
              "フレアドライブ",
              "はがねのつばさ",
              "ねっぷう"
            ],
            "abilities": [
              "ほのおのからだ",
              "はやてのつばさ"
            ],
            "actions": [
              "時間85% ビルドアップ",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力30% ビルドアップ"
            ],
            "types": [
              "ほのお",
              "ひこう"
            ],
            "hp": 4040,
            "atk": 126,
            "def": 111,
            "sp_atk": 116,
            "sp_def": 108,
            "speed": 194
          },
          {
            "name": "フラージェス",
            "moves": [
              "はなびらのまい",
              "ムーンフォース",
              "サイコキネシス",
              "しんぴのまもり"
            ],
            "abilities": [
              "フラワーベール",
              "きょうせい"
            ],
            "actions": [
              "時間85% グラスフィールド",
              "体力75% めいそう",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力30% グラスフィールド"
            ],
            "types": [
              "フェアリー"
            ],
            "hp": 4040,
            "atk": 102,
            "def": 107,
            "sp_atk": 173,
            "sp_def": 236,
            "speed": 117
          },
          {
            "name": "フワライド",
            "moves": [
              "たたりめ",
              "エアスラッシュ",
              "でんじは",
              "シャドーボール"
            ],
            "abilities": [
              "ゆうばく",
              "かるわざ",
              "ねつぼうそう"
            ],
            "actions": [
              "時間85% おにび",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力25% 強化解除"
            ],
            "types": [
              "ゴースト",
              "ひこう"
            ],
            "hp": 6200,
            "atk": 125,
            "def": 71,
            "sp_atk": 140,
            "sp_def": 86,
            "speed": 125
          },
          {
            "name": "ブリムオン",
            "moves": [
              "マジカルシャイン",
              "サイコキネシス",
              "あくのはどう",
              "あまえる"
            ],
            "abilities": [
              "いやしのこころ",
              "きけんよち",
              "マジックミラー"
            ],
            "actions": [
              "時間85% ミストフィールド",
              "体力75% めいそう",
              "体力50% 弱体解除",
              "体力40% めいそう",
              "体力20% サイコフィールド"
            ],
            "types": [
              "エスパー",
              "フェアリー"
            ],
            "hp": 3400,
            "atk": 140,
            "def": 147,
            "sp_atk": 209,
            "sp_def": 159,
            "speed": 48
          },
          {
            "name": "ブロスター",
            "moves": [
              "みずのはどう",
              "りゅうのはどう",
              "はどうだん",
              "クラブハンマー"
            ],
            "abilities": [
              "メガランチャー"
            ],
            "actions": [
              "時間85% あまごい",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力30% みずのはどう"
            ],
            "types": [
              "みず"
            ],
            "hp": 3820,
            "atk": 114,
            "def": 137,
            "sp_atk": 185,
            "sp_def": 138,
            "speed": 93
          },
          {
            "name": "ブロロローム",
            "moves": [
              "ホイールスピン",
              "ちょうはつ",
              "ダストシュート",
              "オーバーヒート"
            ],
            "abilities": [
              "ぼうじん",
              "フィルター"
            ],
            "actions": [
              "時間85% こわいかお",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% ギアチェンジ",
              "体力20% ギアチェンジ"
            ],
            "types": [
              "はがね",
              "どく"
            ],
            "hp": 4100,
            "atk": 183,
            "def": 140,
            "sp_atk": 86,
            "sp_def": 105,
            "speed": 140
          },
          {
            "name": "ヘイラッシャ",
            "moves": [
              "いっちょうあがり",
              "たきのぼり",
              "ヘビーボンバー",
              "くすぐる"
            ],
            "abilities": [
              "てんねん",
              "どんかん",
              "みずのベール"
            ],
            "actions": [
              "時間85% あまごい",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力40% たくわえる",
              "体力20% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 6200,
            "atk": 155,
            "def": 177,
            "sp_atk": 102,
            "sp_def": 102,
            "speed": 57
          },
          {
            "name": "ヘルガー",
            "moves": [
              "かえんほうしゃ",
              "かみくだく",
              "ちょうはつ",
              "おにび"
            ],
            "abilities": [
              "はやおき",
              "もらいび",
              "きんちょうかん"
            ],
            "actions": [
              "時間85% にほんばれ",
              "体力75% とおぼえ",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力35% にほんばれ"
            ],
            "types": [
              "あく",
              "ほのお"
            ],
            "hp": 3940,
            "atk": 140,
            "def": 80,
            "sp_atk": 170,
            "sp_def": 125,
            "speed": 147
          },
          {
            "name": "ボーマンダ",
            "moves": [
              "ドラゴンダイブ",
              "つばめがえし",
              "ハイパーボイス",
              "りゅうせいぐん"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう"
            ],
            "actions": [
              "時間85% テラ回収",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力45% りゅうのまい",
              "体力25% きあいだめ"
            ],
            "types": [
              "ドラゴン",
              "ひこう"
            ],
            "hp": 4540,
            "atk": 207,
            "def": 125,
            "sp_atk": 170,
            "sp_def": 125,
            "speed": 155
          },
          {
            "name": "ポットデス",
            "moves": [
              "シャドーボール",
              "メガドレイン",
              "おどろかす",
              "おにび"
            ],
            "abilities": [
              "くだけるよろい",
              "のろわれボディ"
            ],
            "actions": [
              "時間85% テラ回収",
              "体力50% 弱体解除",
              "体力35% からをやぶる",
              "体力30% 弱体解除"
            ],
            "types": [
              "ゴースト"
            ],
            "hp": 3500,
            "atk": 102,
            "def": 102,
            "sp_atk": 206,
            "sp_def": 176,
            "speed": 110
          },
          {
            "name": "マニューラ",
            "moves": [
              "れいとうパンチ",
              "つじぎり",
              "ちょうはつ",
              "からげんき"
            ],
            "abilities": [
              "プレッシャー",
              "わるいてぐせ"
            ],
            "actions": [
              "時間85% リフレクター",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力25% つるぎのまい"
            ],
            "types": [
              "あく",
              "こおり"
            ],
            "hp": 3800,
            "atk": 185,
            "def": 102,
            "sp_atk": 72,
            "sp_def": 132,
            "speed": 192
          },
          {
            "name": "マフィティフ",
            "moves": [
              "かみくだく",
              "じゃれつく",
              "とっしん",
              "いばる"
            ],
            "abilities": [
              "いかく",
              "ばんけん",
              "はりこみ"
            ],
            "actions": [
              "時間80% ちょうはつ",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% テラ回収",
              "体力20% 強化解除"
            ],
            "types": [
              "あく"
            ],
            "hp": 4100,
            "atk": 185,
            "def": 140,
            "sp_atk": 95,
            "sp_def": 110,
            "speed": 132
          },
          {
            "name": "ミミズズ",
            "moves": [
              "アイアンヘッド",
              "じしん",
              "じだんだ",
              "まきつく"
            ],
            "abilities": [
              "どしょく",
              "すながくれ"
            ],
            "actions": [
              "時間85% すなあらし",
              "体力75% とぐろをまく",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力35% すなあらし"
            ],
            "types": [
              "はがね"
            ],
            "hp": 3800,
            "atk": 132,
            "def": 222,
            "sp_atk": 95,
            "sp_def": 87,
            "speed": 102
          },
          {
            "name": "ミミッキュ",
            "moves": [
              "じゃれつく",
              "シャドークロー",
              "おにび",
              "かげうち"
            ],
            "abilities": [
              "ばけのかわ"
            ],
            "actions": [
              "時間85% ひかりのかべ",
              "体力75% ちょうはつ",
              "体力50% 弱体解除",
              "体力40% おにび",
              "体力25% 強化解除"
            ],
            "types": [
              "ゴースト",
              "フェアリー"
            ],
            "hp": 3340,
            "atk": 140,
            "def": 125,
            "sp_atk": 80,
            "sp_def": 162,
            "speed": 149
          },
          {
            "name": "ムウマージ",
            "moves": [
              "マジカルフレイム",
              "シャドーボール",
              "あやしいひかり",
              "ちょうはつ"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間85% ひかりのかべ",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力25% わるだくみ"
            ],
            "types": [
              "ゴースト"
            ],
            "hp": 3500,
            "atk": 95,
            "def": 95,
            "sp_atk": 162,
            "sp_def": 162,
            "speed": 162
          },
          {
            "name": "ムクホーク",
            "moves": [
              "インファイト",
              "ブレイブバード",
              "でんこうせっか",
              "すてみタックル"
            ],
            "abilities": [
              "いかく",
              "すてみ"
            ],
            "actions": [
              "時間85% 弱体解除",
              "体力75% 強化解除",
              "体力50% 強化解除",
              "体力50% 弱体解除",
              "体力25% ブレイブバード"
            ],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 4240,
            "atk": 185,
            "def": 110,
            "sp_atk": 80,
            "sp_def": 95,
            "speed": 155
          },
          {
            "name": "メタモン",
            "moves": [
              "へんしん"
            ],
            "abilities": [
              "じゅうなん",
              "かわりもの"
            ],
            "actions": [
              "体力50% 弱体解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 3140,
            "atk": 77,
            "def": 77,
            "sp_atk": 77,
            "sp_def": 77,
            "speed": 77
          },
          {
            "name": "モロバレル",
            "moves": [
              "エナジーボール",
              "ヘドロばくだん",
              "キノコのほうし",
              "クリアスモッグ"
            ],
            "abilities": [
              "ほうし",
              "さいせいりょく"
            ],
            "actions": [
              "時間85% グラスフィールド",
              "体力75% キノコのほうし",
              "体力50% 弱体解除",
              "体力40% キノコのほうし",
              "体力25% 強化解除"
            ],
            "types": [
              "くさ",
              "どく"
            ],
            "hp": 5120,
            "atk": 132,
            "def": 110,
            "sp_atk": 132,
            "sp_def": 125,
            "speed": 50
          },
          {
            "name": "ヤドキング",
            "moves": [
              "サイコキネシス",
              "なみのり",
              "あくび",
              "みずのはどう"
            ],
            "abilities": [
              "どんかん",
              "マイペース",
              "さいせいりょく"
            ],
            "actions": [
              "時間85% サイコフィールド",
              "体力70% あくび",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力35% めいそう"
            ],
            "types": [
              "みず",
              "エスパー"
            ],
            "hp": 4540,
            "atk": 117,
            "def": 125,
            "sp_atk": 155,
            "sp_def": 170,
            "speed": 50
          },
          {
            "name": "ヤドラン",
            "moves": [
              "しねんのずつき",
              "アクアブレイク",
              "あくび",
              "みずのはどう"
            ],
            "abilities": [
              "どんかん",
              "マイペース",
              "さいせいりょく"
            ],
            "actions": [
              "時間85% のろい",
              "体力70% あくび",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力35% のろい"
            ],
            "types": [
              "みず",
              "エスパー"
            ],
            "hp": 4540,
            "atk": 117,
            "def": 170,
            "sp_atk": 155,
            "sp_def": 125,
            "speed": 50
          },
          {
            "name": "ヤミラミ",
            "moves": [
              "シャドークロー",
              "イカサマ",
              "おにび",
              "ナイトヘッド"
            ],
            "abilities": [
              "するどいめ",
              "あとだし",
              "いたずらごころ"
            ],
            "actions": [
              "時間85% 強化解除",
              "体力75% おだてる",
              "体力50% 弱体解除",
              "体力45% いちゃもん",
              "体力30% 強化解除"
            ],
            "types": [
              "あく",
              "ゴースト"
            ],
            "hp": 3200,
            "atk": 117,
            "def": 117,
            "sp_atk": 102,
            "sp_def": 102,
            "speed": 80
          },
          {
            "name": "ヤレユータン",
            "moves": [
              "からげんき",
              "サイコキネシス",
              "アシストパワー",
              "あくび"
            ],
            "abilities": [
              "せいしんりょく",
              "テレパシー",
              "きょうせい"
            ],
            "actions": [
              "時間80% めいそう",
              "体力75% ひかりのかべ",
              "体力50% 弱体解除",
              "体力40% めいそう",
              "体力20% めいそう"
            ],
            "types": [
              "ノーマル",
              "エスパー"
            ],
            "hp": 4400,
            "atk": 95,
            "def": 125,
            "sp_atk": 140,
            "sp_def": 170,
            "speed": 95
          },
          {
            "name": "ユキノオー",
            "moves": [
              "エナジーボール",
              "れいとうパンチ",
              "こおりのつぶて",
              "にらみつける"
            ],
            "abilities": [
              "ゆきふらし",
              "ぼうおん"
            ],
            "actions": [
              "時間85% ふぶき",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% ゆきげしき",
              "体力25% オーロラベール"
            ],
            "types": [
              "くさ",
              "こおり"
            ],
            "hp": 4400,
            "atk": 143,
            "def": 117,
            "sp_atk": 143,
            "sp_def": 132,
            "speed": 95
          },
          {
            "name": "ユキメノコ",
            "moves": [
              "こおりのいぶき",
              "シャドーボール",
              "こわいかお",
              "ドレインキッス"
            ],
            "abilities": [
              "ゆきがくれ",
              "のろわれボディ"
            ],
            "actions": [
              "時間85% ゆきげしき",
              "体力75% かなしばり",
              "体力50% 弱体解除",
              "体力40% ゆきげしき",
              "体力25% オーロラベール"
            ],
            "types": [
              "こおり",
              "ゴースト"
            ],
            "hp": 3800,
            "atk": 125,
            "def": 110,
            "sp_atk": 125,
            "sp_def": 110,
            "speed": 170
          },
          {
            "name": "ヨクバリス",
            "moves": [
              "のしかかり",
              "ボディプレス",
              "タネマシンガン",
              "しっぽをふる"
            ],
            "abilities": [
              "ほおぶくろ",
              "くいしんぼう"
            ],
            "actions": [
              "時間85% たくわえる",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力25% たくわえる"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 5300,
            "atk": 147,
            "def": 147,
            "sp_atk": 87,
            "sp_def": 117,
            "speed": 35
          },
          {
            "name": "ライチュウ",
            "moves": [
              "ほうでん",
              "アイアンテール",
              "あまえる",
              "ほっぺすりすり"
            ],
            "abilities": [
              "せいでんき",
              "ひらいしん"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% でんじは",
              "体力50% 強化解除",
              "体力50% 弱体解除",
              "体力35% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 3500,
            "atk": 140,
            "def": 87,
            "sp_atk": 140,
            "sp_def": 125,
            "speed": 170
          },
          {
            "name": "レントラー",
            "moves": [
              "かみくだく",
              "ワイルドボルト",
              "ほうでん",
              "でんじは"
            ],
            "abilities": [
              "とうそうしん",
              "いかく",
              "こんじょう"
            ],
            "actions": [
              "時間85% エレキフィールド",
              "体力75% にらみつける",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力35% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 4100,
            "atk": 185,
            "def": 123,
            "sp_atk": 147,
            "sp_def": 123,
            "speed": 110
          },
          {
            "name": "ロトム",
            "moves": [
              "ほうでん",
              "さわぐ",
              "たたりめ",
              "でんじは"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "時間85% じゅうでん",
              "体力75% テラ回収",
              "体力50% 弱体解除",
              "体力45% 強化解除",
              "体力25% かいでんぱ"
            ],
            "types": [
              "でんき",
              "ゴースト"
            ],
            "hp": 3200,
            "atk": 80,
            "def": 120,
            "sp_atk": 147,
            "sp_def": 120,
            "speed": 141
          },
          {
            "name": "ワルビアル",
            "moves": [
              "じしん",
              "かみくだく",
              "すなじごく",
              "カウンター"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう",
              "いかりのつぼ"
            ],
            "actions": [
              "時間85% いちゃもん",
              "体力75% 強化解除",
              "体力50% 弱体解除",
              "体力50% テラ回収",
              "体力35% つめとぎ"
            ],
            "types": [
              "じめん",
              "あく"
            ],
            "hp": 4540,
            "atk": 180,
            "def": 125,
            "sp_atk": 102,
            "sp_def": 110,
            "speed": 143
          }
        ],
        "3": [
          {
            "name": "アオガラス",
            "moves": [
              "ドリルくちばし",
              "つめとぎ",
              "ちょうはつ",
              "からげんき"
            ],
            "abilities": [
              "するどいめ",
              "きんちょうかん",
              "はとむね"
            ],
            "actions": [
              "時間75% つけあがる"
            ],
            "types": [
              "ひこう"
            ],
            "hp": 736,
            "atk": 51,
            "def": 43,
            "sp_atk": 35,
            "sp_def": 43,
            "speed": 58
          },
          {
            "name": "アママイコ",
            "moves": [
              "ふみつけ",
              "フラフラダンス",
              "マジカルリーフ",
              "ドレインキッス"
            ],
            "abilities": [
              "リーフガード",
              "どんかん",
              "スイートベール"
            ],
            "actions": [
              "時間90% グラスフィールド"
            ],
            "types": [
              "くさ"
            ],
            "hp": 648,
            "atk": 33,
            "def": 38,
            "sp_atk": 33,
            "sp_def": 38,
            "speed": 48
          },
          {
            "name": "アルクジラ",
            "moves": [
              "ゆきなだれ",
              "とっしん",
              "じならし",
              "ゆきげしき"
            ],
            "abilities": [
              "あついしぼう",
              "ゆきがくれ",
              "ちからずく"
            ],
            "actions": [
              "時間90% ゆきげしき"
            ],
            "types": [
              "こおり"
            ],
            "hp": 960,
            "atk": 52,
            "def": 36,
            "sp_atk": 26,
            "sp_def": 33,
            "speed": 35
          },
          {
            "name": "イエッサン",
            "moves": [
              "サイコキネシス",
              "アンコール",
              "のしかかり",
              "シャドーボール"
            ],
            "abilities": [
              "せいしんりょく",
              "シンクロ",
              "サイコメイカー"
            ],
            "actions": [
              "体力75% サイコフィールド"
            ],
            "types": [
              "エスパー",
              "ノーマル"
            ],
            "hp": 696,
            "atk": 50,
            "def": 43,
            "sp_atk": 78,
            "sp_def": 71,
            "speed": 71
          },
          {
            "name": "イエッサン",
            "moves": [
              "サイコキネシス",
              "じこあんじ",
              "のしかかり",
              "シャドーボール"
            ],
            "abilities": [
              "せいしんりょく",
              "シンクロ",
              "サイコメイカー"
            ],
            "actions": [
              "体力75% サイコフィールド"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "イーブイ",
            "moves": [
              "でんこうせっか",
              "めいそう",
              "スピードスター",
              "どろかけ"
            ],
            "abilities": [
              "にげあし",
              "てきおうりょく",
              "きけんよち"
            ],
            "actions": [
              "体力50% あまえる"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 664,
            "atk": 43,
            "def": 40,
            "sp_atk": 36,
            "sp_def": 50,
            "speed": 43
          },
          {
            "name": "ウソッキー",
            "moves": [
              "ウッドハンマー",
              "がんせきふうじ",
              "じたばた",
              "かたくなる"
            ],
            "abilities": [
              "がんじょう",
              "いしあたま",
              "びびり"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "いわ"
            ],
            "hp": 752,
            "atk": 75,
            "def": 85,
            "sp_atk": 26,
            "sp_def": 50,
            "speed": 26
          },
          {
            "name": "エクスレッグ",
            "moves": [
              "じごくづき",
              "とびかかる",
              "つばめがえし",
              "ちょうはつ"
            ],
            "abilities": [
              "むしのしらせ",
              "いろめがね"
            ],
            "actions": [
              "体力50% ローキック"
            ],
            "types": [
              "むし",
              "あく"
            ],
            "hp": 752,
            "atk": 76,
            "def": 59,
            "sp_atk": 41,
            "sp_def": 43,
            "speed": 69
          },
          {
            "name": "オドシシ",
            "moves": [
              "ふみつけ",
              "サイコショック",
              "かみつく",
              "にらみつける"
            ],
            "abilities": [
              "いかく",
              "おみとおし",
              "そうしょく"
            ],
            "actions": [
              "体力75% リフレクター"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 768,
            "atk": 71,
            "def": 48,
            "sp_atk": 64,
            "sp_def": 50,
            "speed": 64
          },
          {
            "name": "オリーニョ",
            "moves": [
              "せいちょう",
              "タネばくだん",
              "メガドレイン",
              "からげんき"
            ],
            "abilities": [
              "はやおき",
              "しゅうかく"
            ],
            "actions": [],
            "types": [
              "くさ",
              "ノーマル"
            ],
            "hp": 648,
            "atk": 42,
            "def": 47,
            "sp_atk": 59,
            "sp_def": 59,
            "speed": 28
          },
          {
            "name": "オンバット",
            "moves": [
              "エアスラッシュ",
              "ドラゴンダイブ",
              "いかりのまえば",
              "ハイパーボイス"
            ],
            "abilities": [
              "おみとおし",
              "すりぬけ",
              "テレパシー"
            ],
            "actions": [
              "体力50% おいかぜ"
            ],
            "types": [
              "ひこう",
              "ドラゴン"
            ],
            "hp": 584,
            "atk": 26,
            "def": 29,
            "sp_atk": 36,
            "sp_def": 33,
            "speed": 43
          },
          {
            "name": "カチコール",
            "moves": [
              "こおりのキバ",
              "かみつく",
              "とっしん",
              "のろい"
            ],
            "abilities": [
              "マイペース",
              "アイスボディ",
              "がんじょう"
            ],
            "actions": [
              "時間90% ゆきげしき"
            ],
            "types": [
              "こおり"
            ],
            "hp": 664,
            "atk": 53,
            "def": 64,
            "sp_atk": 27,
            "sp_def": 29,
            "speed": 24
          },
          {
            "name": "カルボウ",
            "moves": [
              "ふんえん",
              "おにび",
              "ナイトヘッド",
              "クリアスモッグ"
            ],
            "abilities": [
              "もらいび",
              "ほのおのからだ"
            ],
            "actions": [
              "体力50% 弱体解除"
            ],
            "types": [
              "ほのお"
            ],
            "hp": 584,
            "atk": 40,
            "def": 33,
            "sp_atk": 40,
            "sp_def": 33,
            "speed": 29
          },
          {
            "name": "キバゴ",
            "moves": [
              "かみつく",
              "ドラゴンクロー",
              "とっしん",
              "りゅうのはどう"
            ],
            "abilities": [
              "とうそうしん",
              "かたやぶり",
              "きんちょうかん"
            ],
            "actions": [
              "体力50% きあいだめ"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 616,
            "atk": 65,
            "def": 47,
            "sp_atk": 26,
            "sp_def": 33,
            "speed": 44
          },
          {
            "name": "キマワリ",
            "moves": [
              "せいちょう",
              "ギガドレイン",
              "とっしん",
              "だいちのちから"
            ],
            "abilities": [
              "ようりょくそ",
              "サンパワー",
              "はやおき"
            ],
            "actions": [
              "時間90% にほんばれ"
            ],
            "types": [
              "くさ"
            ],
            "hp": 776,
            "atk": 57,
            "def": 43,
            "sp_atk": 78,
            "sp_def": 64,
            "speed": 26
          },
          {
            "name": "キラーメ",
            "moves": [
              "ベノムショック",
              "パワージェム",
              "どくどく",
              "マッドショット"
            ],
            "abilities": [
              "どくげしょう",
              "ふしょく"
            ],
            "actions": [
              "時間75% どくどく"
            ],
            "types": [
              "いわ",
              "どく"
            ],
            "hp": 624,
            "atk": 29,
            "def": 34,
            "sp_atk": 78,
            "sp_def": 47,
            "speed": 47
          },
          {
            "name": "キリンリキ",
            "moves": [
              "とっしん",
              "サイケこうせん",
              "サイコショック",
              "ダメおし"
            ],
            "abilities": [
              "せいしんりょく",
              "はやおき",
              "そうしょく"
            ],
            "actions": [
              "時間90% サイコフィールド"
            ],
            "types": [
              "ノーマル",
              "エスパー"
            ],
            "hp": 752,
            "atk": 61,
            "def": 50,
            "sp_atk": 68,
            "sp_def": 50,
            "speed": 64
          },
          {
            "name": "キルリア",
            "moves": [
              "マジカルシャイン",
              "サイケこうせん",
              "めいそう",
              "あまえる"
            ],
            "abilities": [
              "シンクロ",
              "トレース",
              "テレパシー"
            ],
            "actions": [
              "時間90% リフレクター"
            ],
            "types": [
              "エスパー",
              "フェアリー"
            ],
            "hp": 568,
            "atk": 29,
            "def": 29,
            "sp_atk": 50,
            "sp_def": 43,
            "speed": 40
          },
          {
            "name": "ギモー",
            "moves": [
              "かみつく",
              "あくのはどう",
              "じゃれつく",
              "うそなき"
            ],
            "abilities": [
              "いたずらごころ",
              "おみとおし",
              "わるいてぐせ"
            ],
            "actions": [
              "体力50% わるだくみ"
            ],
            "types": [
              "あく",
              "フェアリー"
            ],
            "hp": 720,
            "atk": 47,
            "def": 36,
            "sp_atk": 57,
            "sp_def": 43,
            "speed": 54
          },
          {
            "name": "クマシュン",
            "moves": [
              "れいとうパンチ",
              "つじぎり",
              "あくび",
              "けたぐり"
            ],
            "abilities": [
              "ゆきがくれ",
              "ゆきかき",
              "びびり"
            ],
            "actions": [
              "時間90% ゆきげしき"
            ],
            "types": [
              "こおり"
            ],
            "hp": 664,
            "atk": 54,
            "def": 33,
            "sp_atk": 47,
            "sp_def": 33,
            "speed": 33
          },
          {
            "name": "コイキング",
            "moves": [
              "たいあたり",
              "はねる",
              "じたばた"
            ],
            "abilities": [
              "すいすい",
              "びびり"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "みず"
            ],
            "hp": 472,
            "atk": 12,
            "def": 43,
            "sp_atk": 15,
            "sp_def": 19,
            "speed": 61
          },
          {
            "name": "コロトック",
            "moves": [
              "つばめがえし",
              "きりさく",
              "れんぞくぎり",
              "シザークロス"
            ],
            "abilities": [
              "むしのしらせ",
              "テクニシャン"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "むし"
            ],
            "hp": 784,
            "atk": 64,
            "def": 40,
            "sp_atk": 43,
            "sp_def": 40,
            "speed": 50
          },
          {
            "name": "ゴチミル",
            "moves": [
              "サイコショック",
              "さいみんじゅつ",
              "うそなき",
              "シャドーボール"
            ],
            "abilities": [
              "おみとおし",
              "かちき",
              "かげふみ"
            ],
            "actions": [
              "時間90% リフレクター"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 696,
            "atk": 36,
            "def": 54,
            "sp_atk": 57,
            "sp_def": 64,
            "speed": 43
          },
          {
            "name": "ゴースト",
            "moves": [
              "ナイトヘッド",
              "たたりめ",
              "ふいうち",
              "クリアスモッグ"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [
              "体力50% おにび"
            ],
            "types": [
              "ゴースト",
              "どく"
            ],
            "hp": 608,
            "atk": 40,
            "def": 36,
            "sp_atk": 85,
            "sp_def": 43,
            "speed": 71
          },
          {
            "name": "ザングース",
            "moves": [
              "ブレイククロー",
              "にらみつける",
              "つじぎり",
              "でんこうせっか"
            ],
            "abilities": [
              "めんえき",
              "どくぼうそう"
            ],
            "actions": [
              "体力50% にらみつける"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 768,
            "atk": 85,
            "def": 47,
            "sp_atk": 47,
            "sp_def": 47,
            "speed": 68
          },
          {
            "name": "ジオヅム",
            "moves": [
              "しおづけ",
              "いわなだれ",
              "ずつき",
              "てっぺき"
            ],
            "abilities": [
              "きよめのしお",
              "がんじょう",
              "クリアボディ"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "いわ"
            ],
            "hp": 696,
            "atk": 47,
            "def": 75,
            "sp_atk": 29,
            "sp_def": 50,
            "speed": 29
          },
          {
            "name": "セビエ",
            "moves": [
              "こおりのキバ",
              "ドラゴンクロー",
              "かみつく",
              "にらみつける"
            ],
            "abilities": [
              "ねつこうかん",
              "アイスボディ"
            ],
            "actions": [
              "時間90% ゆきげしき"
            ],
            "types": [
              "ドラゴン",
              "こおり"
            ],
            "hp": 720,
            "atk": 57,
            "def": 36,
            "sp_atk": 29,
            "sp_def": 36,
            "speed": 43
          },
          {
            "name": "ゾロア",
            "moves": [
              "バークアウト",
              "はたきおとす",
              "みだれひっかき",
              "じんつうりき"
            ],
            "abilities": [
              "イリュージョン"
            ],
            "actions": [
              "体力50% わるだくみ"
            ],
            "types": [
              "あく"
            ],
            "hp": 584,
            "atk": 50,
            "def": 33,
            "sp_atk": 61,
            "sp_def": 33,
            "speed": 50
          },
          {
            "name": "タツベイ",
            "moves": [
              "ドラゴンクロー",
              "かみくだく",
              "とっしん",
              "きあいだめ"
            ],
            "abilities": [
              "いしあたま",
              "ちからずく"
            ],
            "actions": [
              "体力75% りゅうのまい"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 608,
            "atk": 57,
            "def": 47,
            "sp_atk": 33,
            "sp_def": 26,
            "speed": 40
          },
          {
            "name": "テブリム",
            "moves": [
              "マジカルシャイン",
              "ぶんまわす",
              "サイケこうせん",
              "でんじは"
            ],
            "abilities": [
              "いやしのこころ",
              "きけんよち",
              "マジックミラー"
            ],
            "actions": [
              "体力50% トリックルーム"
            ],
            "types": [
              "エスパー"
            ],
            "hp": 672,
            "atk": 33,
            "def": 50,
            "sp_atk": 65,
            "sp_def": 56,
            "speed": 39
          },
          {
            "name": "デカグース",
            "moves": [
              "とっしん",
              "どろかけ",
              "くさわけ",
              "ほのおのキバ"
            ],
            "abilities": [
              "はりこみ",
              "がんじょうあご",
              "てきおうりょく"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 848,
            "atk": 82,
            "def": 47,
            "sp_atk": 43,
            "sp_def": 47,
            "speed": 36
          },
          {
            "name": "デデンネ",
            "moves": [
              "マジカルシャイン",
              "ほうでん",
              "ほっぺすりすり",
              "でんじは"
            ],
            "abilities": [
              "ほおぶくろ",
              "ものひろい",
              "プラス"
            ],
            "actions": [
              "体力50% エレキフィールド"
            ],
            "types": [
              "でんき",
              "フェアリー"
            ],
            "hp": 728,
            "atk": 45,
            "def": 44,
            "sp_atk": 61,
            "sp_def": 51,
            "speed": 75
          },
          {
            "name": "トロッゴン",
            "moves": [
              "がんせきふうじ",
              "やきつくす",
              "ニトロチャージ",
              "いわなだれ"
            ],
            "abilities": [
              "じょうききかん",
              "ほのおのからだ",
              "もらいび"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "いわ",
              "ほのお"
            ],
            "hp": 808,
            "atk": 47,
            "def": 68,
            "sp_atk": 47,
            "sp_def": 54,
            "speed": 40
          },
          {
            "name": "ドラメシヤ",
            "moves": [
              "かみつく",
              "でんこうせっか",
              "おどろかす",
              "まとわりつく"
            ],
            "abilities": [
              "クリアボディ",
              "すりぬけ",
              "のろわれボディ"
            ],
            "actions": [
              "時間90% リフレクター"
            ],
            "types": [
              "ドラゴン",
              "ゴースト"
            ],
            "hp": 512,
            "atk": 47,
            "def": 26,
            "sp_atk": 33,
            "sp_def": 26,
            "speed": 62
          },
          {
            "name": "ドンメル",
            "moves": [
              "じならし",
              "ふんえん",
              "あくび",
              "きあいだめ"
            ],
            "abilities": [
              "どんかん",
              "たんじゅん",
              "マイペース"
            ],
            "actions": [
              "体力75% にほんばれ"
            ],
            "types": [
              "ほのお",
              "じめん"
            ],
            "hp": 696,
            "atk": 47,
            "def": 33,
            "sp_atk": 50,
            "sp_def": 36,
            "speed": 29
          },
          {
            "name": "ドーミラー",
            "moves": [
              "ジャイロボール",
              "さいみんじゅつ",
              "ヘビーボンバー",
              "サイコキネシス"
            ],
            "abilities": [
              "ふゆう",
              "たいねつ",
              "ヘヴィメタル"
            ],
            "actions": [
              "体力50% トリックルーム"
            ],
            "types": [
              "はがね",
              "エスパー"
            ],
            "hp": 672,
            "atk": 21,
            "def": 65,
            "sp_atk": 21,
            "sp_def": 65,
            "speed": 21
          },
          {
            "name": "ナカヌチャン",
            "moves": [
              "たたきつける",
              "じゃれつく",
              "ラスターカノン",
              "ぶんまわす"
            ],
            "abilities": [
              "かたやぶり",
              "マイペース",
              "わるいてぐせ"
            ],
            "actions": [
              "体力50% 弱体解除"
            ],
            "types": [
              "フェアリー",
              "はがね"
            ],
            "hp": 720,
            "atk": 43,
            "def": 43,
            "sp_atk": 36,
            "sp_def": 62,
            "speed": 59
          },
          {
            "name": "ナゲツケサル",
            "moves": [
              "かわらわり",
              "こわいかお",
              "いわくだき",
              "とっしん"
            ],
            "abilities": [
              "レシーバー",
              "まけんき"
            ],
            "actions": [
              "体力50% ビルドアップ"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 920,
            "atk": 89,
            "def": 68,
            "sp_atk": 33,
            "sp_def": 47,
            "speed": 61
          },
          {
            "name": "ナミイルカ",
            "moves": [
              "ダブルアタック",
              "アクアテール",
              "ちょうおんぱ",
              "くろいきり"
            ],
            "abilities": [
              "みずのベール"
            ],
            "actions": [
              "体力50% あまえる"
            ],
            "types": [
              "みず"
            ],
            "hp": 752,
            "atk": 36,
            "def": 33,
            "sp_atk": 36,
            "sp_def": 33,
            "speed": 57
          },
          {
            "name": "ニューラ",
            "moves": [
              "つららおとし",
              "こおりのつぶて",
              "きりさく",
              "にらみつける"
            ],
            "abilities": [
              "せいしんりょく",
              "するどいめ",
              "わるいてぐせ"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "あく",
              "こおり"
            ],
            "hp": 664,
            "atk": 71,
            "def": 43,
            "sp_atk": 29,
            "sp_def": 57,
            "speed": 85
          },
          {
            "name": "ヌメラ",
            "moves": [
              "りゅうのはどう",
              "ヘドロばくだん",
              "あまえる",
              "みずのはどう"
            ],
            "abilities": [
              "そうしょく",
              "うるおいボディ",
              "ぬめぬめ"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 608,
            "atk": 40,
            "def": 29,
            "sp_atk": 43,
            "sp_def": 57,
            "speed": 33
          },
          {
            "name": "ノコッチ",
            "moves": [
              "のしかかり",
              "ドリルライナー",
              "あくび",
              "どろかけ"
            ],
            "abilities": [
              "てんのめぐみ",
              "にげあし",
              "びびり"
            ],
            "actions": [
              "体力50% 弱体解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 920,
            "atk": 54,
            "def": 54,
            "sp_atk": 50,
            "sp_def": 50,
            "speed": 36
          },
          {
            "name": "ハギギシリ",
            "moves": [
              "サイコファング",
              "かみつく",
              "アクアジェット",
              "いやなおと"
            ],
            "abilities": [
              "ビビッドボディ",
              "がんじょうあご",
              "ミラクルスキン"
            ],
            "actions": [
              "体力75% あまごい"
            ],
            "types": [
              "みず",
              "エスパー"
            ],
            "hp": 736,
            "atk": 78,
            "def": 54,
            "sp_atk": 54,
            "sp_def": 54,
            "speed": 69
          },
          {
            "name": "ハブネーク",
            "moves": [
              "ポイズンテール",
              "いやなおと",
              "つじぎり",
              "まきつく"
            ],
            "abilities": [
              "だっぴ",
              "すりぬけ"
            ],
            "actions": [
              "体力50% にらみつける"
            ],
            "types": [
              "どく"
            ],
            "hp": 768,
            "atk": 75,
            "def": 47,
            "sp_atk": 75,
            "sp_def": 47,
            "speed": 50
          },
          {
            "name": "ハリーセン",
            "moves": [
              "たきのぼり",
              "どくづき",
              "ミサイルばり",
              "ちいさくなる"
            ],
            "abilities": [
              "どくのトゲ",
              "すいすい",
              "いかく"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "みず",
              "どく"
            ],
            "hp": 720,
            "atk": 71,
            "def": 64,
            "sp_atk": 43,
            "sp_def": 43,
            "speed": 64
          },
          {
            "name": "バスラオ",
            "moves": [
              "アクアジェット",
              "かみつく",
              "ずつき",
              "じたばた"
            ],
            "abilities": [
              "すてみ",
              "てきおうりょく",
              "かたやぶり"
            ],
            "actions": [
              "時間50% あまごい"
            ],
            "types": [
              "みず"
            ],
            "hp": 752,
            "atk": 69,
            "def": 50,
            "sp_atk": 61,
            "sp_def": 43,
            "speed": 73
          },
          {
            "name": "バチンウニ",
            "moves": [
              "スパーク",
              "バブルこうせん",
              "どくづき",
              "のろい"
            ],
            "abilities": [
              "ひらいしん",
              "エレキメイカー"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "でんき"
            ],
            "hp": 624,
            "atk": 75,
            "def": 71,
            "sp_atk": 68,
            "sp_def": 64,
            "speed": 15
          },
          {
            "name": "パチリス",
            "moves": [
              "スパーク",
              "でんこうせっか",
              "てんしのキッス",
              "タネばくだん"
            ],
            "abilities": [
              "にげあし",
              "ものひろい",
              "ちくでん"
            ],
            "actions": [
              "体力75% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 696,
            "atk": 36,
            "def": 54,
            "sp_atk": 36,
            "sp_def": 68,
            "speed": 71
          },
          {
            "name": "パフュートン",
            "moves": [
              "とっしん",
              "タネばくだん",
              "ハイパーボイス",
              "ふるいたてる"
            ],
            "abilities": [
              "とれないにおい",
              "くいしんぼう",
              "あついしぼう"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 976,
            "atk": 75,
            "def": 57,
            "sp_atk": 46,
            "sp_def": 61,
            "speed": 50
          },
          {
            "name": "パフュートン",
            "moves": [
              "とっしん",
              "タネばくだん",
              "ハイパーボイス",
              "ふるいたてる"
            ],
            "abilities": [
              "とれないにおい",
              "くいしんぼう",
              "あついしぼう"
            ],
            "actions": [
              "時間50% 弱体解除"
            ],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "パモット",
            "moves": [
              "つっぱり",
              "スパーク",
              "ほっぺすりすり",
              "ローキック"
            ],
            "abilities": [
              "ちくでん",
              "しぜんかいふく",
              "てつのこぶし"
            ],
            "actions": [
              "体力75% エレキフィールド"
            ],
            "types": [
              "でんき",
              "かくとう"
            ],
            "hp": 696,
            "atk": 57,
            "def": 33,
            "sp_atk": 40,
            "sp_def": 33,
            "speed": 64
          },
          {
            "name": "ヒドイデ",
            "moves": [
              "どくづき",
              "アクアブレイク",
              "どくどく",
              "ミサイルばり"
            ],
            "abilities": [
              "ひとでなし",
              "じゅうなん",
              "さいせいりょく"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "どく",
              "みず"
            ],
            "hp": 640,
            "atk": 42,
            "def": 48,
            "sp_atk": 35,
            "sp_def": 41,
            "speed": 36
          },
          {
            "name": "ヒノヤコマ",
            "moves": [
              "ニトロチャージ",
              "つばめがえし",
              "つるぎのまい",
              "どろぼう"
            ],
            "abilities": [
              "ほのおのからだ",
              "はやてのつばさ"
            ],
            "actions": [
              "体力75% にほんばれ"
            ],
            "types": [
              "ほのお",
              "ひこう"
            ],
            "hp": 704,
            "atk": 56,
            "def": 43,
            "sp_atk": 44,
            "sp_def": 41,
            "speed": 63
          },
          {
            "name": "ヒポポタス",
            "moves": [
              "じならし",
              "かみつく",
              "とっしん",
              "あくび"
            ],
            "abilities": [
              "すなおこし",
              "すなのちから"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "じめん"
            ],
            "hp": 736,
            "atk": 55,
            "def": 59,
            "sp_atk": 31,
            "sp_def": 34,
            "speed": 27
          },
          {
            "name": "ピカチュウ",
            "moves": [
              "１０まんボルト",
              "ほっぺすりすり",
              "アイアンテール",
              "スパーク"
            ],
            "abilities": [
              "せいでんき",
              "ひらいしん"
            ],
            "actions": [
              "体力75% エレキフィールド"
            ],
            "types": [
              "でんき"
            ],
            "hp": 552,
            "atk": 43,
            "def": 33,
            "sp_atk": 40,
            "sp_def": 40,
            "speed": 68
          },
          {
            "name": "フカマル",
            "moves": [
              "ドラゴンクロー",
              "じならし",
              "かみつく",
              "がんせきふうじ"
            ],
            "abilities": [
              "すながくれ",
              "さめはだ"
            ],
            "actions": [
              "体力50% つるぎのまい"
            ],
            "types": [
              "ドラゴン",
              "じめん"
            ],
            "hp": 680,
            "atk": 54,
            "def": 36,
            "sp_atk": 33,
            "sp_def": 36,
            "speed": 34
          },
          {
            "name": "ペリッパー",
            "moves": [
              "エアスラッシュ",
              "なみのり",
              "しろいきり",
              "ちょうおんぱ"
            ],
            "abilities": [
              "するどいめ",
              "あめふらし",
              "あめうけざら"
            ],
            "actions": [
              "体力50% おいかぜ"
            ],
            "types": [
              "みず",
              "ひこう"
            ],
            "hp": 696,
            "atk": 40,
            "def": 75,
            "sp_atk": 71,
            "sp_def": 54,
            "speed": 50
          },
          {
            "name": "ポポッコ",
            "moves": [
              "アクロバット",
              "タネばくだん",
              "わたほうし"
            ],
            "abilities": [
              "ようりょくそ",
              "リーフガード",
              "すりぬけ"
            ],
            "actions": [
              "体力75% にほんばれ"
            ],
            "types": [
              "くさ",
              "ひこう"
            ],
            "hp": 664,
            "atk": 36,
            "def": 40,
            "sp_atk": 36,
            "sp_def": 50,
            "speed": 61
          },
          {
            "name": "マクノシタ",
            "moves": [
              "かわらわり",
              "すなかけ",
              "のしかかり",
              "きあいだめ"
            ],
            "abilities": [
              "あついしぼう",
              "こんじょう",
              "ちからずく"
            ],
            "actions": [
              "体力50% 弱体解除"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 760,
            "atk": 47,
            "def": 26,
            "sp_atk": 19,
            "sp_def": 26,
            "speed": 22
          },
          {
            "name": "マリル",
            "moves": [
              "アクアジェット",
              "じゃれつく",
              "しっぽをふる"
            ],
            "abilities": [
              "あついしぼう",
              "ちからもち",
              "そうしょく"
            ],
            "actions": [
              "体力75% あまごい"
            ],
            "types": [
              "みず",
              "フェアリー"
            ],
            "hp": 752,
            "atk": 19,
            "def": 40,
            "sp_atk": 19,
            "sp_def": 40,
            "speed": 33
          },
          {
            "name": "ミニリュウ",
            "moves": [
              "ドラゴンダイブ",
              "しんぴのまもり",
              "アクアテール",
              "たたきつける"
            ],
            "abilities": [
              "だっぴ",
              "ふしぎなうろこ"
            ],
            "actions": [
              "体力75% でんじは"
            ],
            "types": [
              "ドラゴン"
            ],
            "hp": 584,
            "atk": 49,
            "def": 36,
            "sp_atk": 40,
            "sp_def": 40,
            "speed": 40
          },
          {
            "name": "ムクバード",
            "moves": [
              "とっしん",
              "つばめがえし",
              "こうそくいどう",
              "さわぐ"
            ],
            "abilities": [
              "いかく",
              "すてみ"
            ],
            "actions": [
              "体力50% なきごえ"
            ],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 664,
            "atk": 57,
            "def": 40,
            "sp_atk": 33,
            "sp_def": 33,
            "speed": 61
          },
          {
            "name": "メタモン",
            "moves": [
              "へんしん"
            ],
            "abilities": [
              "じゅうなん",
              "かわりもの"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 624,
            "atk": 38,
            "def": 38,
            "sp_atk": 38,
            "sp_def": 38,
            "speed": 38
          },
          {
            "name": "メラルバ",
            "moves": [
              "ニトロチャージ",
              "かえんぐるま",
              "きゅうけつ",
              "いやなおと"
            ],
            "abilities": [
              "ほのおのからだ",
              "むしのしらせ"
            ],
            "actions": [
              "体力50% いやなおと"
            ],
            "types": [
              "むし",
              "ほのお"
            ],
            "hp": 664,
            "atk": 64,
            "def": 43,
            "sp_atk": 40,
            "sp_def": 43,
            "speed": 47
          },
          {
            "name": "モココ",
            "moves": [
              "あやしいひかり",
              "パワージェム",
              "ほうでん",
              "わたほうし"
            ],
            "abilities": [
              "せいでんき",
              "プラス"
            ],
            "actions": [
              "時間90% リフレクター"
            ],
            "types": [
              "でんき"
            ],
            "hp": 752,
            "atk": 43,
            "def": 43,
            "sp_atk": 61,
            "sp_def": 47,
            "speed": 36
          },
          {
            "name": "モノズ",
            "moves": [
              "かみくだく",
              "たたきつける",
              "りゅうのいぶき",
              "バークアウト"
            ],
            "abilities": [
              "はりきり"
            ],
            "actions": [
              "時間90% きあいだめ"
            ],
            "types": [
              "あく",
              "ドラゴン"
            ],
            "hp": 648,
            "atk": 50,
            "def": 40,
            "sp_atk": 36,
            "sp_def": 40,
            "speed": 31
          },
          {
            "name": "モルフォン",
            "moves": [
              "エアスラッシュ",
              "むしのさざめき",
              "サイケこうせん",
              "ねむりごな"
            ],
            "abilities": [
              "りんぷん",
              "いろめがね",
              "ミラクルスキン"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "むし",
              "どく"
            ],
            "hp": 752,
            "atk": 50,
            "def": 47,
            "sp_atk": 68,
            "sp_def": 57,
            "speed": 68
          },
          {
            "name": "ヤミラミ",
            "moves": [
              "たたりめ",
              "イカサマ",
              "バークアウト",
              "つばめがえし"
            ],
            "abilities": [
              "するどいめ",
              "あとだし",
              "いたずらごころ"
            ],
            "actions": [
              "体力50% おにび"
            ],
            "types": [
              "あく",
              "ゴースト"
            ],
            "hp": 640,
            "atk": 57,
            "def": 57,
            "sp_atk": 50,
            "sp_def": 50,
            "speed": 40
          },
          {
            "name": "ヤレユータン",
            "moves": [
              "じんつうりき",
              "からげんき",
              "ちょうはつ",
              "イカサマ"
            ],
            "abilities": [
              "せいしんりょく",
              "テレパシー",
              "きょうせい"
            ],
            "actions": [
              "体力50% サイコフィールド"
            ],
            "types": [
              "ノーマル",
              "エスパー"
            ],
            "hp": 864,
            "atk": 47,
            "def": 61,
            "sp_atk": 68,
            "sp_def": 82,
            "speed": 47
          },
          {
            "name": "ユキカブリ",
            "moves": [
              "こごえるかぜ",
              "はっぱカッター",
              "ウェザーボール",
              "みずのはどう"
            ],
            "abilities": [
              "ゆきふらし",
              "ぼうおん"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "くさ",
              "こおり"
            ],
            "hp": 696,
            "atk": 48,
            "def": 40,
            "sp_atk": 48,
            "sp_def": 47,
            "speed": 33
          },
          {
            "name": "ヨクバリス",
            "moves": [
              "のしかかり",
              "かみつく",
              "たくわえる",
              "ボディプレス"
            ],
            "abilities": [
              "ほおぶくろ",
              "くいしんぼう"
            ],
            "actions": [
              "体力75% たくわえる"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1032,
            "atk": 71,
            "def": 71,
            "sp_atk": 43,
            "sp_def": 57,
            "speed": 19
          },
          {
            "name": "ヨーギラス",
            "moves": [
              "いわなだれ",
              "じならし",
              "かみつく",
              "すなあらし"
            ],
            "abilities": [
              "こんじょう",
              "すながくれ"
            ],
            "actions": [
              "体力75% すなあらし"
            ],
            "types": [
              "いわ",
              "じめん"
            ],
            "hp": 640,
            "atk": 49,
            "def": 40,
            "sp_atk": 36,
            "sp_def": 40,
            "speed": 33
          },
          {
            "name": "ラッキー",
            "moves": [
              "エコーボイス",
              "シャドーボール",
              "まるくなる",
              "うたう"
            ],
            "abilities": [
              "しぜんかいふく",
              "てんのめぐみ",
              "いやしのこころ"
            ],
            "actions": [
              "時間90% ひかりのかべ"
            ],
            "types": [
              "ノーマル"
            ],
            "hp": 1760,
            "atk": 8,
            "def": 8,
            "sp_atk": 29,
            "sp_def": 78,
            "speed": 40
          },
          {
            "name": "リオル",
            "moves": [
              "はっけい",
              "バレットパンチ",
              "しんくうは",
              "いやなおと"
            ],
            "abilities": [
              "ふくつのこころ",
              "せいしんりょく",
              "いたずらごころ"
            ],
            "actions": [
              "時間50% 強化解除"
            ],
            "types": [
              "かくとう"
            ],
            "hp": 584,
            "atk": 54,
            "def": 33,
            "sp_atk": 29,
            "sp_def": 33,
            "speed": 47
          },
          {
            "name": "ルクシオ",
            "moves": [
              "かみなりのキバ",
              "かみつく",
              "ほのおのキバ",
              "じゅうでん"
            ],
            "abilities": [
              "とうそうしん",
              "いかく",
              "こんじょう"
            ],
            "actions": [
              "時間90% にらみつける"
            ],
            "types": [
              "でんき"
            ],
            "hp": 696,
            "atk": 64,
            "def": 39,
            "sp_atk": 47,
            "sp_def": 39,
            "speed": 47
          },
          {
            "name": "ワシボン",
            "moves": [
              "きりさく",
              "つばめがえし",
              "いわくだき",
              "こわいかお"
            ],
            "abilities": [
              "するどいめ",
              "ちからずく",
              "はりきり"
            ],
            "actions": [
              "体力50% おいかぜ"
            ],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 752,
            "atk": 63,
            "def": 40,
            "sp_atk": 30,
            "sp_def": 40,
            "speed": 47
          },
          {
            "name": "ワナイダー",
            "moves": [
              "シザークロス",
              "シャドークロー",
              "ダメおし",
              "カウンター"
            ],
            "abilities": [
              "ふみん",
              "はりこみ"
            ],
            "actions": [
              "体力50% 強化解除"
            ],
            "types": [
              "むし"
            ],
            "hp": 696,
            "atk": 60,
            "def": 69,
            "sp_atk": 41,
            "sp_def": 65,
            "speed": 29
          }
        ],
        "2": [
          {
            "name": "アサナン",
            "moves": [
              "ねこだまし",
              "ねんりき",
              "ローキック",
              "じこあんじ"
            ],
            "abilities": [
              "ヨガパワー",
              "テレパシー"
            ],
            "actions": [],
            "types": [
              "かくとう",
              "エスパー"
            ],
            "hp": 210,
            "atk": 21,
            "def": 27,
            "sp_atk": 21,
            "sp_def": 27,
            "speed": 29
          },
          {
            "name": "アノクサ",
            "moves": [
              "ころがる",
              "タネマシンガン",
              "まとわりつく",
              "かげうち"
            ],
            "abilities": [
              "かぜのり",
              "すりぬけ"
            ],
            "actions": [],
            "types": [
              "くさ",
              "ゴースト"
            ],
            "hp": 230,
            "atk": 31,
            "def": 17,
            "sp_atk": 23,
            "sp_def": 19,
            "speed": 29
          },
          {
            "name": "ウデッポウ",
            "moves": [
              "アクアジェット",
              "うちおとす",
              "どろぼう",
              "じたばた"
            ],
            "abilities": [
              "メガランチャー"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 250,
            "atk": 26,
            "def": 29,
            "sp_atk": 28,
            "sp_def": 30,
            "speed": 22
          },
          {
            "name": "カゲボウズ",
            "moves": [
              "かげうち",
              "いやなおと",
              "おにび",
              "サイケこうせん"
            ],
            "abilities": [
              "ふみん",
              "おみとおし",
              "のろわれボディ"
            ],
            "actions": [],
            "types": [
              "ゴースト"
            ],
            "hp": 235,
            "atk": 35,
            "def": 19,
            "sp_atk": 30,
            "sp_def": 18,
            "speed": 23
          },
          {
            "name": "カヌチャン",
            "moves": [
              "うそなき",
              "メタルクロー",
              "おどろかす",
              "いわくだき"
            ],
            "abilities": [
              "かたやぶり",
              "マイペース",
              "わるいてぐせ"
            ],
            "actions": [],
            "types": [
              "フェアリー",
              "はがね"
            ],
            "hp": 250,
            "atk": 23,
            "def": 23,
            "sp_atk": 19,
            "sp_def": 30,
            "speed": 28
          },
          {
            "name": "カプサイジ",
            "moves": [
              "かみつく",
              "はっぱカッター",
              "タネマシンガン",
              "ずつき"
            ],
            "abilities": [
              "ようりょくそ",
              "ふみん",
              "ぶきよう"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 250,
            "atk": 29,
            "def": 21,
            "sp_atk": 29,
            "sp_def": 21,
            "speed": 25
          },
          {
            "name": "カラナクシ",
            "moves": [
              "マッドショット",
              "みずのはどう",
              "げんしのちから",
              "クリアスモッグ"
            ],
            "abilities": [
              "ねんちゃく",
              "よびみず",
              "すなのちから"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 300,
            "atk": 24,
            "def": 24,
            "sp_atk": 27,
            "sp_def": 29,
            "speed": 18
          },
          {
            "name": "カラナクシ",
            "moves": [
              "マッドショット",
              "みずのはどう",
              "げんしのちから",
              "クリアスモッグ"
            ],
            "abilities": [
              "ねんちゃく",
              "よびみず",
              "すなのちから"
            ],
            "actions": [],
            "types": [],
            "hp": 0,
            "atk": 0,
            "def": 0,
            "sp_atk": 0,
            "sp_def": 0,
            "speed": 0
          },
          {
            "name": "ガーディ",
            "moves": [
              "かえんぐるま",
              "かみつく",
              "とおぼえ",
              "かたきうち"
            ],
            "abilities": [
              "いかく",
              "もらいび",
              "せいぎのこころ"
            ],
            "actions": [],
            "types": [
              "ほのお"
            ],
            "hp": 260,
            "atk": 33,
            "def": 23,
            "sp_atk": 33,
            "sp_def": 25,
            "speed": 29
          },
          {
            "name": "クズモー",
            "moves": [
              "ようかいえき",
              "たつまき",
              "くろいきり",
              "みずでっぽう"
            ],
            "abilities": [
              "どくのトゲ",
              "どくしゅ",
              "てきおうりょく"
            ],
            "actions": [],
            "types": [
              "どく",
              "みず"
            ],
            "hp": 250,
            "atk": 29,
            "def": 29,
            "sp_atk": 29,
            "sp_def": 29,
            "speed": 17
          },
          {
            "name": "クヌギダマ",
            "moves": [
              "むしくい",
              "とっしん",
              "ころがる",
              "むしのていこう"
            ],
            "abilities": [
              "がんじょう",
              "ぼうじん"
            ],
            "actions": [],
            "types": [
              "むし"
            ],
            "hp": 250,
            "atk": 31,
            "def": 41,
            "sp_atk": 19,
            "sp_def": 19,
            "speed": 11
          },
          {
            "name": "グレッグル",
            "moves": [
              "おどろかす",
              "ちょうはつ",
              "けたぐり",
              "ベノムショック"
            ],
            "abilities": [
              "きけんよち",
              "かんそうはだ",
              "どくしゅ"
            ],
            "actions": [],
            "types": [
              "どく",
              "かくとう"
            ],
            "hp": 245,
            "atk": 29,
            "def": 21,
            "sp_atk": 29,
            "sp_def": 21,
            "speed": 25
          },
          {
            "name": "ケイコウオ",
            "moves": [
              "みずでっぽう",
              "かぜおこし",
              "オーロラビーム",
              "あやしいひかり"
            ],
            "abilities": [
              "すいすい",
              "よびみず",
              "みずのベール"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 245,
            "atk": 24,
            "def": 27,
            "sp_atk": 24,
            "sp_def": 29,
            "speed": 31
          },
          {
            "name": "コイキング",
            "moves": [
              "たいあたり",
              "じたばた",
              "はねる"
            ],
            "abilities": [
              "すいすい",
              "びびり"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 190,
            "atk": 9,
            "def": 27,
            "sp_atk": 11,
            "sp_def": 13,
            "speed": 37
          },
          {
            "name": "コイル",
            "moves": [
              "でんじは",
              "スパーク",
              "いやなおと",
              "エレキネット"
            ],
            "abilities": [
              "じりょく",
              "がんじょう",
              "アナライズ"
            ],
            "actions": [],
            "types": [
              "でんき",
              "はがね"
            ],
            "hp": 200,
            "atk": 19,
            "def": 33,
            "sp_atk": 43,
            "sp_def": 27,
            "speed": 23
          },
          {
            "name": "コダック",
            "moves": [
              "みずのはどう",
              "しねんのずつき",
              "かなしばり",
              "さいみんじゅつ"
            ],
            "abilities": [
              "しめりけ",
              "ノーてんき",
              "すいすい"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 250,
            "atk": 25,
            "def": 24,
            "sp_atk": 31,
            "sp_def": 25,
            "speed": 27
          },
          {
            "name": "コマタナ",
            "moves": [
              "れんぞくぎり",
              "メタルクロー",
              "こわいかお",
              "ダメおし"
            ],
            "abilities": [
              "まけんき",
              "せいしんりょく",
              "プレッシャー"
            ],
            "actions": [],
            "types": [
              "あく",
              "はがね"
            ],
            "hp": 240,
            "atk": 39,
            "def": 33,
            "sp_atk": 21,
            "sp_def": 21,
            "speed": 29
          },
          {
            "name": "コリンク",
            "moves": [
              "かみつく",
              "かみなりのキバ",
              "にどげり",
              "つぶらなひとみ"
            ],
            "abilities": [
              "とうそうしん",
              "いかく",
              "こんじょう"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 240,
            "atk": 31,
            "def": 18,
            "sp_atk": 21,
            "sp_def": 18,
            "speed": 23
          },
          {
            "name": "ゴクリン",
            "moves": [
              "ヘドロこうげき",
              "アシッドボム",
              "どろかけ",
              "のしかかり"
            ],
            "abilities": [
              "ヘドロえき",
              "ねんちゃく",
              "くいしんぼう"
            ],
            "actions": [],
            "types": [
              "どく"
            ],
            "hp": 290,
            "atk": 22,
            "def": 26,
            "sp_atk": 22,
            "sp_def": 26,
            "speed": 21
          },
          {
            "name": "ゴチム",
            "moves": [
              "くすぐる",
              "サイケこうせん",
              "いちゃもん",
              "はたく"
            ],
            "abilities": [
              "おみとおし",
              "かちき",
              "かげふみ"
            ],
            "actions": [],
            "types": [
              "エスパー"
            ],
            "hp": 240,
            "atk": 17,
            "def": 25,
            "sp_atk": 27,
            "sp_def": 31,
            "speed": 23
          },
          {
            "name": "ゴマゾウ",
            "moves": [
              "まるくなる",
              "ころがる",
              "じならし",
              "たたきつける"
            ],
            "abilities": [
              "ものひろい",
              "すながくれ"
            ],
            "actions": [],
            "types": [
              "じめん"
            ],
            "hp": 330,
            "atk": 29,
            "def": 29,
            "sp_atk": 21,
            "sp_def": 21,
            "speed": 21
          },
          {
            "name": "ゴース",
            "moves": [
              "しっぺがえし",
              "たたりめ",
              "あやしいひかり",
              "こごえるかぜ"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [],
            "types": [
              "ゴースト",
              "どく"
            ],
            "hp": 210,
            "atk": 19,
            "def": 17,
            "sp_atk": 45,
            "sp_def": 19,
            "speed": 37
          },
          {
            "name": "サシカマス",
            "moves": [
              "アクアジェット",
              "つつく",
              "かみつく",
              "こうそくいどう"
            ],
            "abilities": [
              "すいすい",
              "スクリューおびれ"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 230,
            "atk": 30,
            "def": 21,
            "sp_atk": 21,
            "sp_def": 17,
            "speed": 31
          },
          {
            "name": "サボネア",
            "moves": [
              "すいとる",
              "タネマシンガン",
              "すなかけ",
              "しっぺがえし"
            ],
            "abilities": [
              "すながくれ",
              "ちょすい"
            ],
            "actions": [],
            "types": [
              "くさ"
            ],
            "hp": 250,
            "atk": 39,
            "def": 21,
            "sp_atk": 39,
            "sp_def": 21,
            "speed": 19
          },
          {
            "name": "シェルダー",
            "moves": [
              "シェルブレード",
              "こおりのつぶて",
              "にらみつける",
              "たいあたり"
            ],
            "abilities": [
              "シェルアーマー",
              "スキルリンク",
              "ぼうじん"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 210,
            "atk": 31,
            "def": 45,
            "sp_atk": 23,
            "sp_def": 15,
            "speed": 21
          },
          {
            "name": "スカンプー",
            "moves": [
              "えんまく",
              "みだれひっかき",
              "かみつく",
              "ベノムショック"
            ],
            "abilities": [
              "あくしゅう",
              "ゆうばく",
              "するどいめ"
            ],
            "actions": [],
            "types": [
              "どく",
              "あく"
            ],
            "hp": 275,
            "atk": 30,
            "def": 23,
            "sp_atk": 21,
            "sp_def": 21,
            "speed": 34
          },
          {
            "name": "スナバァ",
            "moves": [
              "じならし",
              "おどろかす",
              "すなじごく",
              "すなかけ"
            ],
            "abilities": [
              "みずがため",
              "すながくれ"
            ],
            "actions": [],
            "types": [
              "ゴースト",
              "じめん"
            ],
            "hp": 260,
            "atk": 27,
            "def": 37,
            "sp_atk": 33,
            "sp_def": 23,
            "speed": 11
          },
          {
            "name": "ゾウドウ",
            "moves": [
              "いわくだき",
              "じならし",
              "ふみつけ",
              "なきごえ"
            ],
            "abilities": [
              "ちからずく",
              "ヘヴィメタル"
            ],
            "actions": [],
            "types": [
              "はがね"
            ],
            "hp": 290,
            "atk": 37,
            "def": 24,
            "sp_atk": 21,
            "sp_def": 24,
            "speed": 21
          },
          {
            "name": "タマゲタケ",
            "moves": [
              "クリアスモッグ",
              "おどろかす",
              "メガドレイン",
              "しびれごな"
            ],
            "abilities": [
              "ほうし",
              "さいせいりょく"
            ],
            "actions": [],
            "types": [
              "くさ",
              "どく"
            ],
            "hp": 285,
            "atk": 27,
            "def": 23,
            "sp_atk": 27,
            "sp_def": 27,
            "speed": 11
          },
          {
            "name": "タンドン",
            "moves": [
              "えんまく",
              "どろかけ",
              "やきつくす",
              "うちおとす"
            ],
            "abilities": [
              "じょうききかん",
              "たいねつ",
              "もらいび"
            ],
            "actions": [],
            "types": [
              "いわ"
            ],
            "hp": 210,
            "atk": 21,
            "def": 25,
            "sp_atk": 21,
            "sp_def": 25,
            "speed": 17
          },
          {
            "name": "ディグダ",
            "moves": [
              "じならし",
              "きりさく",
              "つめとぎ",
              "おどろかす"
            ],
            "abilities": [
              "すながくれ",
              "ありじごく",
              "すなのちから"
            ],
            "actions": [],
            "types": [
              "じめん"
            ],
            "hp": 170,
            "atk": 27,
            "def": 15,
            "sp_atk": 19,
            "sp_def": 23,
            "speed": 43
          },
          {
            "name": "デルビル",
            "moves": [
              "かみつく",
              "ひのこ",
              "ふくろだたき",
              "からげんき"
            ],
            "abilities": [
              "はやおき",
              "もらいび",
              "きんちょうかん"
            ],
            "actions": [],
            "types": [
              "あく",
              "ほのお"
            ],
            "hp": 240,
            "atk": 29,
            "def": 17,
            "sp_atk": 37,
            "sp_def": 25,
            "speed": 31
          },
          {
            "name": "ドロバンコ",
            "moves": [
              "にどげり",
              "じならし",
              "ふみつけ",
              "どろかけ"
            ],
            "abilities": [
              "マイペース",
              "じきゅうりょく",
              "せいしんりょく"
            ],
            "actions": [],
            "types": [
              "じめん"
            ],
            "hp": 290,
            "atk": 45,
            "def": 33,
            "sp_atk": 23,
            "sp_def": 27,
            "speed": 23
          },
          {
            "name": "ナマケロ",
            "moves": [
              "ずつき",
              "アンコール",
              "あくび",
              "じゃれつく"
            ],
            "abilities": [
              "なまけ"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 270,
            "atk": 29,
            "def": 29,
            "sp_atk": 19,
            "sp_def": 19,
            "speed": 17
          },
          {
            "name": "ニャース",
            "moves": [
              "かみつく",
              "ネコにこばん",
              "ダメおし",
              "みだれひっかき"
            ],
            "abilities": [
              "ものひろい",
              "テクニシャン",
              "きんちょうかん"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 230,
            "atk": 23,
            "def": 19,
            "sp_atk": 21,
            "sp_def": 21,
            "speed": 41
          },
          {
            "name": "バネブー",
            "moves": [
              "サイケこうせん",
              "あやしいひかり",
              "くさわけ",
              "ねんりき"
            ],
            "abilities": [
              "あついしぼう",
              "マイペース",
              "くいしんぼう"
            ],
            "actions": [],
            "types": [
              "エスパー"
            ],
            "hp": 270,
            "atk": 15,
            "def": 19,
            "sp_atk": 33,
            "sp_def": 37,
            "speed": 29
          },
          {
            "name": "ヒメグマ",
            "moves": [
              "ほしがる",
              "しっぺがえし",
              "つぶらなひとみ",
              "メタルクロー"
            ],
            "abilities": [
              "ものひろい",
              "はやあし",
              "みつあつめ"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 270,
            "atk": 37,
            "def": 25,
            "sp_atk": 25,
            "sp_def": 25,
            "speed": 21
          },
          {
            "name": "ビリリダマ",
            "moves": [
              "かいでんぱ",
              "でんきショック",
              "スピードスター",
              "ころがる"
            ],
            "abilities": [
              "ぼうおん",
              "せいでんき",
              "ゆうばく"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 230,
            "atk": 17,
            "def": 25,
            "sp_atk": 27,
            "sp_def": 27,
            "speed": 45
          },
          {
            "name": "ピカチュウ",
            "moves": [
              "スパーク",
              "ほっぺすりすり",
              "でんじは",
              "スピードスター"
            ],
            "abilities": [
              "せいでんき",
              "ひらいしん"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 220,
            "atk": 27,
            "def": 21,
            "sp_atk": 25,
            "sp_def": 25,
            "speed": 41
          },
          {
            "name": "フワンテ",
            "moves": [
              "かぜおこし",
              "しっぺがえし",
              "おどろかす",
              "くろいきり"
            ],
            "abilities": [
              "ゆうばく",
              "かるわざ",
              "ねつぼうそう"
            ],
            "actions": [],
            "types": [
              "ゴースト",
              "ひこう"
            ],
            "hp": 330,
            "atk": 25,
            "def": 18,
            "sp_atk": 29,
            "sp_def": 22,
            "speed": 33
          },
          {
            "name": "ブイゼル",
            "moves": [
              "アクアジェット",
              "みずでっぽう",
              "なきごえ",
              "れんぞくぎり"
            ],
            "abilities": [
              "すいすい",
              "みずのベール"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 260,
            "atk": 31,
            "def": 19,
            "sp_atk": 29,
            "sp_def": 17,
            "speed": 39
          },
          {
            "name": "ブロロン",
            "moves": [
              "ジャイロボール",
              "ヘドロこうげき",
              "ダメおし",
              "どくガス"
            ],
            "abilities": [
              "ぼうじん",
              "スロースタート"
            ],
            "actions": [],
            "types": [
              "はがね",
              "どく"
            ],
            "hp": 240,
            "atk": 33,
            "def": 30,
            "sp_atk": 17,
            "sp_def": 23,
            "speed": 23
          },
          {
            "name": "プリン",
            "moves": [
              "のしかかり",
              "チャームボイス",
              "ジャイロボール",
              "うたう"
            ],
            "abilities": [
              "メロメロボディ",
              "かちき",
              "フレンドガード"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "フェアリー"
            ],
            "hp": 380,
            "atk": 23,
            "def": 13,
            "sp_atk": 23,
            "sp_def": 15,
            "speed": 13
          },
          {
            "name": "ベトベター",
            "moves": [
              "ヘドロこうげき",
              "マッドショット",
              "かなしばり",
              "かげうち"
            ],
            "abilities": [
              "あくしゅう",
              "ねんちゃく",
              "どくしゅ"
            ],
            "actions": [],
            "types": [
              "どく"
            ],
            "hp": 310,
            "atk": 37,
            "def": 25,
            "sp_atk": 21,
            "sp_def": 25,
            "speed": 15
          },
          {
            "name": "ベロバー",
            "moves": [
              "かみつく",
              "おだてる",
              "けたぐり",
              "ちょうはつ"
            ],
            "abilities": [
              "いたずらごころ",
              "おみとおし",
              "わるいてぐせ"
            ],
            "actions": [],
            "types": [
              "あく",
              "フェアリー"
            ],
            "hp": 240,
            "atk": 23,
            "def": 17,
            "sp_atk": 27,
            "sp_def": 21,
            "speed": 25
          },
          {
            "name": "マンキー",
            "moves": [
              "かわらわり",
              "みだれひっかき",
              "にらみつける",
              "きあいだめ"
            ],
            "abilities": [
              "やるき",
              "いかりのつぼ",
              "まけんき"
            ],
            "actions": [],
            "types": [
              "かくとう"
            ],
            "hp": 230,
            "atk": 37,
            "def": 19,
            "sp_atk": 19,
            "sp_def": 23,
            "speed": 33
          },
          {
            "name": "ムウマ",
            "moves": [
              "でんじは",
              "おどろかす",
              "ねんりき",
              "かげうち"
            ],
            "abilities": [
              "ふゆう"
            ],
            "actions": [],
            "types": [
              "ゴースト"
            ],
            "hp": 270,
            "atk": 29,
            "def": 29,
            "sp_atk": 39,
            "sp_def": 39,
            "speed": 39
          },
          {
            "name": "メグロコ",
            "moves": [
              "じならし",
              "かみつく",
              "すなかけ",
              "にらみつける"
            ],
            "abilities": [
              "いかく",
              "じしんかじょう",
              "いかりのつぼ"
            ],
            "actions": [],
            "types": [
              "じめん",
              "あく"
            ],
            "hp": 250,
            "atk": 33,
            "def": 19,
            "sp_atk": 19,
            "sp_def": 19,
            "speed": 31
          },
          {
            "name": "メリープ",
            "moves": [
              "でんじは",
              "でんきショック",
              "たいあたり",
              "パワージェム"
            ],
            "abilities": [
              "せいでんき",
              "プラス"
            ],
            "actions": [],
            "types": [
              "でんき"
            ],
            "hp": 260,
            "atk": 21,
            "def": 21,
            "sp_atk": 31,
            "sp_def": 23,
            "speed": 19
          },
          {
            "name": "ヤトウモリ",
            "moves": [
              "ひのこ",
              "やきつくす",
              "どろかけ",
              "ポイズンテール"
            ],
            "abilities": [
              "ふしょく",
              "どんかん"
            ],
            "actions": [],
            "types": [
              "どく",
              "ほのお"
            ],
            "hp": 245,
            "atk": 22,
            "def": 21,
            "sp_atk": 33,
            "sp_def": 21,
            "speed": 35
          },
          {
            "name": "ヤドン",
            "moves": [
              "みずのはどう",
              "ねんりき",
              "あくび",
              "なきごえ"
            ],
            "abilities": [
              "どんかん",
              "マイペース",
              "さいせいりょく"
            ],
            "actions": [],
            "types": [
              "みず",
              "エスパー"
            ],
            "hp": 330,
            "atk": 31,
            "def": 31,
            "sp_atk": 21,
            "sp_def": 21,
            "speed": 11
          },
          {
            "name": "ヤバチャ",
            "moves": [
              "おどろかす",
              "メガドレイン",
              "からにこもる",
              "サイケこうせん"
            ],
            "abilities": [
              "くだけるよろい",
              "のろわれボディ"
            ],
            "actions": [],
            "types": [
              "ゴースト"
            ],
            "hp": 230,
            "atk": 23,
            "def": 23,
            "sp_atk": 34,
            "sp_def": 26,
            "speed": 25
          },
          {
            "name": "ヤミカラス",
            "moves": [
              "つばさでうつ",
              "おどろかす",
              "ダメおし",
              "くろいきり"
            ],
            "abilities": [
              "ふみん",
              "きょううん",
              "いたずらごころ"
            ],
            "actions": [],
            "types": [
              "あく",
              "ひこう"
            ],
            "hp": 270,
            "atk": 39,
            "def": 21,
            "sp_atk": 39,
            "sp_def": 21,
            "speed": 41
          },
          {
            "name": "ヤヤコマ",
            "moves": [
              "ニトロチャージ",
              "でんこうせっか",
              "じたばた",
              "つつく"
            ],
            "abilities": [
              "はとむね",
              "はやてのつばさ"
            ],
            "actions": [],
            "types": [
              "ノーマル",
              "ひこう"
            ],
            "hp": 240,
            "atk": 25,
            "def": 22,
            "sp_atk": 21,
            "sp_def": 20,
            "speed": 29
          },
          {
            "name": "ユキワラシ",
            "moves": [
              "こおりのつぶて",
              "こごえるかぜ",
              "にらみつける",
              "ころがる"
            ],
            "abilities": [
              "せいしんりょく",
              "アイスボディ",
              "ムラっけ"
            ],
            "actions": [],
            "types": [
              "こおり"
            ],
            "hp": 250,
            "atk": 25,
            "def": 25,
            "sp_atk": 25,
            "sp_def": 25,
            "speed": 25
          },
          {
            "name": "ラブカス",
            "moves": [
              "あまえる",
              "みずのはどう",
              "ドレインキッス",
              "じたばた"
            ],
            "abilities": [
              "すいすい",
              "うるおいボディ"
            ],
            "actions": [],
            "types": [
              "みず"
            ],
            "hp": 235,
            "atk": 17,
            "def": 27,
            "sp_atk": 21,
            "sp_def": 31,
            "speed": 43
          },
          {
            "name": "ワッカネズミ",
            "moves": [
              "エコーボイス",
              "ダブルアタック",
              "つぶらなひとみ",
              "じゃれつく"
            ],
            "abilities": [
              "にげあし",
              "ものひろい",
              "マイペース"
            ],
            "actions": [],
            "types": [
              "ノーマル"
            ],
            "hp": 250,
            "atk": 25,
            "def": 23,
            "sp_atk": 21,
            "sp_def": 23,
            "speed": 35
          }
        ]
      }"#;
    serde_json::from_str(json_data).unwrap()
}